<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Elua-svn] r493 - in trunk/doc: en pt
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/elua-svn/2009-October/index.html" >
   <LINK REL="made" HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r493%20-%20in%20trunk/doc%3A%20en%20pt&In-Reply-To=%3C200910252351.n9PNp8wv005303%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000448.html">
   <LINK REL="Next"  HREF="000450.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Elua-svn] r493 - in trunk/doc: en pt</H1>
    <B>dadosutter at BerliOS</B> 
    <A HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r493%20-%20in%20trunk/doc%3A%20en%20pt&In-Reply-To=%3C200910252351.n9PNp8wv005303%40sheep.berlios.de%3E"
       TITLE="[Elua-svn] r493 - in trunk/doc: en pt">dadosutter at mail.berlios.de
       </A><BR>
    <I>Mon Oct 26 00:51:08 CET 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000448.html">[Elua-svn] r492 - branches
</A></li>
        <LI>Next message: <A HREF="000450.html">[Elua-svn] r494 - tags/pre0.6/doc/pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#449">[ date ]</a>
              <a href="thread.html#449">[ thread ]</a>
              <a href="subject.html#449">[ subject ]</a>
              <a href="author.html#449">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: dadosutter
Date: 2009-10-26 00:51:06 +0100 (Mon, 26 Oct 2009)
New Revision: 493

Modified:
   trunk/doc/en/comunity.html
   trunk/doc/pt/comunity.html
   trunk/doc/pt/overview.html
Log:
PT Overview page minor revisions
ZModem mention removed, as we actually don't have it working yet.



Modified: trunk/doc/en/comunity.html
===================================================================
--- trunk/doc/en/comunity.html	2009-10-25 20:29:49 UTC (rev 492)
+++ trunk/doc/en/comunity.html	2009-10-25 23:51:06 UTC (rev 493)
@@ -16,7 +16,7 @@
 &lt;/p&gt; 
 &lt;a name=&quot;credits&quot; /&gt;&lt;h3&gt;Credits&lt;/h3&gt;
 &lt;p&gt;The authors of &lt;strong&gt;eLua&lt;/strong&gt; would like
-to thank the colaborative help from the comunity for the
+to thank the colaborative help from the community for the
 continuous development of the project. Here's an alphabetically
 ordered non-exhaustive list of contributors:&lt;/p&gt;
 &lt;ul&gt;
@@ -24,14 +24,13 @@
  &lt;li&gt;Fr&#233;deric Thomas - Site hosting, LM3S enhancements&lt;/li&gt;
  &lt;li&gt;James Snyder - ADC, CAN, LuaRPC (&lt;a href=&quot;<A HREF="http://q12.org/lua/index.html">http://q12.org/lua/index.html</A>&quot;&gt;originaly by Russell Smith&lt;/a&gt;), testing&lt;/li&gt;
  &lt;li&gt;Mike Panetta - STM32 port&lt;/li&gt;
- &lt;li&gt;Mike Thompson - ZModem protocol for the shell&lt;/li&gt;
  &lt;li&gt;Pedro Bittencourt - RIT OLED, &lt;a href=&quot;<A HREF="http://code.google.com/p/vhews/">http://code.google.com/p/vhews/</A>&quot;&gt;VHeHS&lt;/a&gt;, testing...&lt;/li&gt;
  &lt;li&gt;Raul Nunes - The fundamental support from &lt;a href=&quot;<A HREF="http://www.puc-rio.br">http://www.puc-rio.br</A>&quot;&gt;PUC-Rio&lt;/a&gt;.&lt;/li&gt;
  &lt;li&gt;Roberto Ierusalimschy, Luiz Henrique Figueiredo, Waldemar Celles - for
  &lt;a href=&quot;<A HREF="http://www.lua.org">http://www.lua.org</A>&quot;&gt;Lua&lt;/a&gt; (!!! :)&lt;/li&gt;
  &lt;li&gt;T&#233;o Benjamin, Ives Cunha, Rafael Barmak - Pong, TetrIves, SpaceShip
  games and &lt;a href=&quot;<A HREF="http://www.giga.puc-rio.br/site/embedded/manfredo">http://www.giga.puc-rio.br/site/embedded/manfredo</A>&quot;&gt;Manfredo&lt;/a&gt;, a GPS guided robot, powered by eLua.&lt;/li&gt;
- &lt;li&gt;The whole comunity of users on our eLua list at &lt;a
+ &lt;li&gt;The whole community of users on our eLua list at &lt;a
  href=&quot;<A HREF="https://lists.berlios.de/mailman/listinfo/elua-dev">https://lists.berlios.de/mailman/listinfo/elua-dev</A>&quot;&gt;<A HREF="https://lists.berlios.de/mailman/listinfo/elua-dev&lt;/a">https://lists.berlios.de/mailman/listinfo/elua-dev&lt;/a</A>&gt;&lt;/li&gt;
 &lt;/ul&gt;
  ... and the constant help and support from:&lt;br /&gt;

Modified: trunk/doc/pt/comunity.html
===================================================================
--- trunk/doc/pt/comunity.html	2009-10-25 20:29:49 UTC (rev 492)
+++ trunk/doc/pt/comunity.html	2009-10-25 23:51:06 UTC (rev 493)
@@ -29,7 +29,6 @@
  &lt;li&gt;Fr&#233;deric Thomas - Site hosting, melhorias para LM3S&lt;/li&gt;
  &lt;li&gt;James Snyder - M&#243;dulos ADC, CAN, LuaRPC (&lt;a href=&quot;<A HREF="http://q12.org/lua/index.html">http://q12.org/lua/index.html</A>&quot;&gt;originalmente por Russell Smith&lt;/a&gt;), testes&lt;/li&gt;
  &lt;li&gt;Mike Panetta - Portabiliza&#231;&#227;o para STM32&lt;/li&gt;
- &lt;li&gt;Mike Thompson - Protocolo ZModem para o shell&lt;/li&gt;
  &lt;li&gt;Pedro Bittencourt - M&#243;dulo para display RIT OLED para LM3S, &lt;a href=&quot;<A HREF="http://code.google.com/p/vhews/">http://code.google.com/p/vhews/</A>&quot;&gt;VHeHS&lt;/a&gt;, Testes&lt;/li&gt;
  &lt;li&gt;Raul Nunes - Sustentabilidade e o apoio fundamental da &lt;a href=&quot;<A HREF="http://www.puc-rio.br">http://www.puc-rio.br</A>&quot;&gt;PUC-Rio&lt;/a&gt;.&lt;/li&gt;
  &lt;li&gt;Roberto Ierusalimschy, Luiz Henrique Figueiredo e Waldemar Celles - por &lt;a href=&quot;<A HREF="http://www.lua.org">http://www.lua.org</A>&quot;&gt;Lua&lt;/a&gt; (!!! :)&lt;/li&gt;

Modified: trunk/doc/pt/overview.html
===================================================================
--- trunk/doc/pt/overview.html	2009-10-25 20:29:49 UTC (rev 492)
+++ trunk/doc/pt/overview.html	2009-10-25 23:51:06 UTC (rev 493)
@@ -5,59 +5,63 @@
 funcionalidade completa da linguagem de programa&#231;&#227;o &lt;a href=&quot;<A HREF="http://www.lua.org">http://www.lua.org</A>&quot;&gt;Lua&lt;/a&gt; para o mundo
 do desenvolvimento de software embedded.&lt;/p&gt;
 &lt;p&gt;A implementa&#231;&#227;o busca oferecer isto de uma forma
-simples, para que n&#227;o s&#243; desenvolvedores experi&#234;ntes mas tamb&#233;m iniciantes no mundo embarcado e at&#233;
-mesmo usu&#225;rios finais dos sistemas, possam desenvolver e alterar o comportamento dos c&#243;digos de seus produtos.&lt;/p&gt;
+simples, para que n&#227;o s&#243; desenvolvedores experientes mas tamb&#233;m iniciantes no mundo embarcado e at&#233;
+mesmo usu&#225;rios finais dos sistemas, possam desenvolver e alterar os
+programas dos seus produtos.&lt;/p&gt;
 
 &lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; n&#227;o &#233; uma vers&#227;o reduzida de Lua, muito pelo contr&#225;rio, ela
 oferece os recursos completos da vers&#227;o desktop de Lua, complementando-a
 ainda com caracter&#237;sticas espec&#237;ficas para o uso embedded. 
 Oferece tamb&#233;m a mesma possibilidade de escolha no uso de implementa&#231;&#245;es diferentes
-de Lua (ex: Lua Inteiro x Lua Ponto-Flutuante etc...). Muito trabalho foi e ainda ser&#225; feito no sentido de tornar Lua mais &quot;amig&#225;vel&quot; no mundo embedded, 
+de Lua (ex: Lua Inteiro x Lua Ponto-Flutuante). Muito trabalho foi e ainda ser&#225; feito no sentido de tornar Lua mais &quot;amig&#225;vel&quot; no mundo embedded, 
 como as caracter&#237;sticas j&#225; adicionadas que permitem a redu&#231;&#227;o dos requisitos de mem&#243;ria.&lt;/p&gt;
 &lt;p&gt;Lua &#233; o exemplo perfeito de uma linguagem m&#237;nima e, ainda assim, totalmente funcional. Embora geralmente anunciada como uma linguagem de &quot;scripting&quot; (e utilizada
-fortemente como tal na ind&#250;stria de jogos e em tantas outras &#225;reas), Lua &#233; capaz de executar programas como qualquer outra linguagem tradicional
-e grandes sistemas e aplica&#231;&#245;es (desktop ou web) s&#227;o desenvolvidos hoje utilizando
+fortemente como tal na ind&#250;stria de jogos e em tantas outras &#225;reas), Lua &#233; capaz de executar programas como qualquer outra linguagem
+tradicional.
+Grandes sistemas e aplica&#231;&#245;es (desktop ou web) hoje, s&#227;o desenvolvidos utilizando
 seu poder e sua performance (ex: Adobe Lightroom, World of Warcraft, ...).
-Suas necessidades em recursos limitados, a tornam especialmente adequada para um grande n&#250;mero de fam&#237;lias de microcontroladores. 
+Suas reduzidas necessidades de recursos de hardware, a tornam especialmente adequada para um grande n&#250;mero de fam&#237;lias de microcontroladores. 
 A alta portabilidade intr&#237;nseca do c&#243;digo Lua original (que &#233; ANSI C e funciona praticamente em todas as plataformas
 que se conhece hoje), combinada com a arquitetura do software de &lt;b&gt;eLua&lt;/b&gt;, altamente port&#225;til, 
 permite a migra&#231;&#227;o f&#225;cil para uma grande variedade e arquiteturas de
 microcontroladores. 
-As bibliotecas de acesso a perif&#233;ricos exportadas por &lt;b&gt;eLua&lt;/b&gt; tamb&#233;m s&#227;o port&#225;teis por
+As bibliotecas de acesso a perif&#233;ricos disponibilizadas por &lt;b&gt;eLua&lt;/b&gt; tamb&#233;m s&#227;o port&#225;teis por
 defini&#231;&#227;o, podendo-se assim executar um mesmo programa em Lua, sem ou com poucas
-modifica&#231;&#245;es, em cada plataforma suportada por &lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; (o &lt;a href=&quot;status.html&quot;&gt;status do projeto &amp; roadmap&lt;/a&gt; 
-mostram uma lista sempre crescente de plataformas em que &lt;b&gt;eLua&lt;/b&gt; &#233; suportada). 
+modifica&#231;&#245;es, em qualquer hardware que &quot;rode&quot; &lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; (o &lt;a href=&quot;status.html&quot;&gt;status do projeto &amp; roadmap&lt;/a&gt; 
+mostram uma lista sempre crescente de plataformas com suporte &#224; &lt;b&gt;eLua&lt;/b&gt;). 
 &lt;b&gt;eLua&lt;/b&gt; herdou o design minimalista e funcional de Lua, mantendo a filosofia bem conhecida do &quot;&lt;b&gt;KISS&lt;/b&gt;&quot; - &quot;&lt;i&gt;Keep It Small and Simple&lt;/i&gt;&quot;, que significa &quot;Mantenha seu c&#243;digo
-e sua arquitetura simples e reduzidos&quot;.&lt;/p&gt;
+e sua arquitetura simples e sua complexidade reduzida&quot;.&lt;/p&gt;
 
 &lt;a name=&quot;features&quot;&gt;&lt;/a&gt;&lt;h3&gt;Recursos&lt;/h3&gt;
 &lt;p&gt;&lt;b&gt;eLua&lt;/b&gt; permite que voc&#234; execute Lua diretamente no seu microcontrolador. 
 Um grande conjunto de m&#243;dulos complementares j&#225; existe para a programa&#231;&#227;o de perif&#233;ricos &lt;strong&gt;eLua&lt;/strong&gt;
 e o desenvolvimento de novos tem um crescimento cada vez mais r&#225;pido.&lt;/p&gt;
-&lt;p&gt;Relacionamos a seguir as fun&#231;&#245;es que est&#227;o prontas ou sendo implementadas:&lt;/p&gt;
+&lt;p&gt;Relacionamos a seguir algumas fun&#231;&#245;es que est&#227;o prontas ou sendo implementadas:&lt;/p&gt;
 &lt;ul&gt;
-  &lt;li&gt;um sistema de configura&#231;&#227;o do build flex&#237;vel&lt;/li&gt;
-  &lt;li&gt;acesso ao interpretador Lua na sua MCU, atrav&#233;s de uma variedade de transportes f&#237;sicos
-  (RS-232, ethernet, ...)&lt;/li&gt;
+  &lt;li&gt;um sistema de configura&#231;&#227;o do build flex&#237;vel e um servi&#231;o de build
+  remoto via web&lt;/li&gt;
+  &lt;li&gt;acesso ao interpretador Lua diretamente na sua MCU, atrav&#233;s de uma variedade de
+  protocolos de transportes f&#237;sicos (RS-232, ethernet, ...)&lt;/li&gt;
   &lt;li&gt;uma biblioteca de perif&#233;ricos independentes de plataforma (PIO, UART, PWM, SPI, TMR, ADC, NET,
   I2C, CAN ...)&lt;/li&gt;
-  &lt;li&gt;um File System (ainda ROM), f&#225;cil de ser portado para diferentes tipos de chips de mem&#243;ria e outros dispositivos de armazenamento&lt;/li&gt;
+  &lt;li&gt;um File System (por enquanto apenas em ROM), f&#225;cil de ser portado para diferentes tipos de chips de mem&#243;ria e outros dispositivos de armazenamento&lt;/li&gt;
   &lt;li&gt;um pequeno Fyle System FAT R/W, para cart&#245;es MMC e SD&lt;/li&gt;
   &lt;li&gt;um shell pr&#243;prio m&#237;nimo (para opera&#231;&#245;es com arquivos, configura&#231;&#227;o do ambiente e outros recursos)&lt;/li&gt;
   &lt;li&gt;suporte a redes TCP/IP&lt;/li&gt;
-  &lt;li&gt;um servidor http embedded&lt;/li&gt;
-  &lt;li&gt;terminal/console usando Ethernet&lt;/li&gt;
+  &lt;li&gt;um servidor http embedded escrito em Lua&lt;/li&gt;
+  &lt;li&gt;terminal/console via serial ou Ethernet&lt;/li&gt;
   &lt;li&gt;depura&#231;&#227;o (diretamente no MCU ou remotamente com o PC)&lt;/li&gt;
   &lt;li&gt;execu&#231;&#227;o distribuida de c&#243;digo (LuaRPC)&lt;/li&gt;
 &lt;/ul&gt;
 
 &lt;p&gt;Para obter mais informa&#231;&#245;es sobre as funcionalidades (implementadas e previstas) em &lt;strong&gt;eLua&lt;/strong&gt; veja a &lt;a href=&quot;status.html&quot;&gt;p&#225;gina de status&lt;/a&gt;.&lt;/p&gt;
-&lt;p&gt;O projeto foi concebido de forma a que migrar &lt;strong&gt;eLua&lt;/strong&gt; para uma outra plataforma
+&lt;p&gt;O projeto foi concebido de forma que migrar &lt;strong&gt;eLua&lt;/strong&gt; para uma outra plataforma
 ou mesmo arquitetura, seja algo f&#225;cil de ser realizado. 
-Atualmente, esta migra&#231;&#227;o est&#225; restrita &#224;s plataformas para as quais gcc + newlib estejam dispon&#237;veis. 
-Esta restri&#231;&#227;o ir&#225; desaparecer em um futuro pr&#243;ximo, j&#225; que &lt;b&gt;eLua&lt;/b&gt; ter&#225; sua pr&#243;pria libc e, portanto, 
+Atualmente, esta migra&#231;&#227;o est&#225; restrita &#224;s plataformas para as quais gcc + newlib
+ou toolchains completos (ex:CodeSourcery) estejam dispon&#237;veis. 
+Esta restri&#231;&#227;o ir&#225; desaparecer em um futuro pr&#243;ximo, j&#225; que &lt;b&gt;eLua&lt;/b&gt; ter&#225; sua pr&#243;pria libc e portanto 
 estar&#225; dispon&#237;vel em um leque mais amplo de MCUs.&lt;/p&gt;
-&lt;p&gt;Lua est&#225; dispon&#237;vel em duas implementa&#231;&#245;es: &quot;Lua padr&#227;o&quot; (usando ponto flutuante) e &quot;Lua inteiro&quot; (usando inteiro). 
+&lt;p&gt;Assim como para os ambientes Desktop, Lua em &lt;strong&gt;eLua&lt;/strong&gt; est&#225; dispon&#237;vel em duas implementa&#231;&#245;es: &quot;Lua padr&#227;o&quot; (usando ponto flutuante) e &quot;Lua inteiro&quot; (usando inteiro). 
 &quot;Lua padr&#227;o&quot; realiza opera&#231;&#245;es de ponto flutuante (mais lentas devido a emula&#231;&#227;o via software no MCU), 
 enquanto &quot;Lua inteiro&quot; realiza opera&#231;&#245;es com n&#250;meros inteiros 
 (suporte para ponto fixo e ponto flutuante podem ser adicionados em m&#243;dulos separados) e assim ser&#225; mais r&#225;pido.&lt;/p&gt;
@@ -68,23 +72,26 @@
 desenvolvimento e produ&#231;&#227;o r&#225;pida de aplica&#231;&#245;es, como desenvolvedores altamente
 qualificados, que precisam expandir seus programas com recursos de
 bibliotecas de alto n&#237;vel com muita portabilidade.&lt;/p&gt;
-&lt;p&gt;&lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; permite que programadores do mundo embedded usem a simplicidade 
-e o poder da linguagem de programa&#231;&#227;o Lua e n&#227;o precisem se preocupar com as complexidades e 
-caracter&#237;sticas da plataforma/arquitetura-dependente do hardware. 
-Com &lt;b&gt;eLua&lt;/b&gt;, o programador pode concentrar-se na implementa&#231;&#227;o do seu programa, 
-sem ter que se preocupar com acesso &#224; registros e configura&#231;&#227;o de perif&#233;ricos, j&#225; que as bibliotecas da plataforma cuidam disso. 
+&lt;p&gt;&lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; permite que programadores
+com pouca experi&#234;ncia no mundo embedded utilizem a simplicidade 
+e o poder da linguagem de programa&#231;&#227;o Lua, sem precisarem se preocupar com as complexidades e 
+da arquitetura do hardware em uso. 
+Utilizando &lt;b&gt;eLua&lt;/b&gt;, o programador pode concentrar-se na implementa&#231;&#227;o do seu programa, 
+sem ter que se preocupar com detalhes de acessos &#224; registros, configura&#231;&#227;o de perif&#233;ricos e mesmo gerenciamento de mem&#243;ria.
 Com isso, aumentamos a produtividade e eliminamos tarefas muitas vezes frustrantes de lidar com drivers
-complexos de plataformas espec&#237;ficas.&lt;/p&gt;
+complexos de plataformas espec&#237;ficas. &lt;stront&gt;eLua&lt;/strong&gt; absorve a
+complexidade das diversas arquiteturas, sem afastar demais o usu&#225;rio do hardware.&lt;/p&gt;
 &lt;p&gt;A lista abaixo resume o p&#250;blico-alvo de &lt;b&gt;eLua&lt;/b&gt;:&lt;/p&gt;
 &lt;ul&gt;
   &lt;li&gt;Desenvolvedores de sistemas embarcados que est&#227;o procurando uma maneira r&#225;pida, f&#225;cil de usar e uma poderosa forma de codifica&#231;&#227;o.&lt;/li&gt;
   &lt;li&gt;Novos programadores de sistemas embarcados (ou simplesmente programadores) que est&#227;o procurando uma maneira f&#225;cil de &quot;mergulhar&quot; no mundo da programa&#231;&#227;o
   embedded. &lt;b&gt;eLua&lt;/b&gt; &#233; uma grande ferramenta de aprendizagem.&lt;/li&gt;
-  &lt;li&gt;Pessoas que n&#227;o s&#227;o realmente os desenvolvedores, mas ainda assim, querem ser capazes de projetar sistemas embarcados de forma r&#225;pida e sem muita dor-de-cabe&#231;a, sem ter para isso que aprenderem a linguagem C.
+  &lt;li&gt;Pessoas que n&#227;o s&#227;o realmente os desenvolvedores, mas ainda assim querem ser capazes de projetar
+  e prototipar sistemas embarcados de forma r&#225;pida e sem muita dor-de-cabe&#231;a, sem ter para isso que aprenderem a linguagem C.
   (Designers, artistas, ...)&lt;/li&gt;
-  &lt;li&gt;Desenvolvedores de sistemas embarcados que necessitam de mecanismos poderosos de
-  meta-linguagem, para codificar algoritmos complexos e descri&#231;&#227;o de dados.&lt;/li&gt;
-  &lt;li&gt;Engenheiros de campo que podem ir aos seus clientes e realizar depura&#231;&#227;o de m&#243;dulos de &lt;b&gt;eLua&lt;/b&gt; no local, sem para isso, necessitar de prepara&#231;&#227;o, j&#225; que o ambiente de desenvolvimento reside em um chip.&lt;/li&gt;
+  &lt;li&gt;Desenvolvedores de sistemas embarcados que necessitam de mecanismos poderosos de meta-linguagem, para codificar algoritmos complexos e descri&#231;&#227;o de dados.&lt;/li&gt;
+  &lt;li&gt;Engenheiros de campo que podem ir aos seus clientes realizar depura&#231;&#227;o de m&#243;dulos de &lt;b&gt;eLua&lt;/b&gt; no local
+  ou mesmo remotamente, sem para isso necessitar de prepara&#231;&#227;o, j&#225; que todo o ambiente de desenvolvimento reside em um chip.&lt;/li&gt;
 &lt;/ul&gt;
 
 &lt;a name=&quot;authors&quot; /&gt;&lt;h3&gt;Autores&lt;/h3&gt;


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000448.html">[Elua-svn] r492 - branches
</A></li>
	<LI>Next message: <A HREF="000450.html">[Elua-svn] r494 - tags/pre0.6/doc/pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#449">[ date ]</a>
              <a href="thread.html#449">[ thread ]</a>
              <a href="subject.html#449">[ subject ]</a>
              <a href="author.html#449">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/elua-svn">More information about the eLua-svn
mailing list</a><br>
</body></html>
