<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Elua-svn] r465 - tags/pre0.6/doc/pt
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/elua-svn/2009-October/index.html" >
   <LINK REL="made" HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r465%20-%20tags/pre0.6/doc/pt&In-Reply-To=%3C200910020409.n9249pUj024558%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000420.html">
   <LINK REL="Next"  HREF="000422.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Elua-svn] r465 - tags/pre0.6/doc/pt</H1>
    <B>dadosutter at BerliOS</B> 
    <A HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r465%20-%20tags/pre0.6/doc/pt&In-Reply-To=%3C200910020409.n9249pUj024558%40sheep.berlios.de%3E"
       TITLE="[Elua-svn] r465 - tags/pre0.6/doc/pt">dadosutter at mail.berlios.de
       </A><BR>
    <I>Fri Oct  2 06:09:51 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000420.html">[Elua-svn] r464 - in tags/pre0.6: . romfs
</A></li>
        <LI>Next message: <A HREF="000422.html">[Elua-svn] r466 - in tags/pre0.6/doc: . pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#421">[ date ]</a>
              <a href="thread.html#421">[ thread ]</a>
              <a href="subject.html#421">[ subject ]</a>
              <a href="author.html#421">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: dadosutter
Date: 2009-10-02 06:09:50 +0200 (Fri, 02 Oct 2009)
New Revision: 465

Modified:
   tags/pre0.6/doc/pt/arch.html
   tags/pre0.6/doc/pt/dl_binaries.html
   tags/pre0.6/doc/pt/dl_old.html
   tags/pre0.6/doc/pt/faq.html
   tags/pre0.6/doc/pt/news.html
Log:
PT content translation revisions



Modified: tags/pre0.6/doc/pt/arch.html
===================================================================
--- tags/pre0.6/doc/pt/arch.html	2009-10-02 04:01:00 UTC (rev 464)
+++ tags/pre0.6/doc/pt/arch.html	2009-10-02 04:09:50 UTC (rev 465)
@@ -1,9 +1,9 @@
 &lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.0 Strict//EN&quot;&gt;
 &lt;html&gt;&lt;head&gt;
-&lt;h3&gt;A arquitetura Elua&lt;/h3&gt;
+&lt;h3&gt;A arquitetura eLua&lt;/h3&gt;
 &lt;p&gt;Esta se&ccedil;&atilde;o apresenta em detalhes, a concep&ccedil;&atilde;o e implementa&ccedil;&atilde;o de &lt;b&gt;eLua&lt;/b&gt;. Foi concebida como um guia, principalmente para os desenvolvedores &lt;b&gt;eLua&lt;/b&gt;,
   mas cont&eacute;m informa&ccedil;&atilde;o que pode ser tamb&eacute;m &uacute;til tamb&eacute;m para usu&aacute;rios de &lt;b&gt;eLua&lt;/b&gt;. Um exemplo &eacute; o cap&iacute;tulo sobre o &lt;a href=&quot;arch_romfs.html&quot;&gt;sistema de arquivos ROM&lt;/a&gt;.
-  Al&eacute;m disso, ao ler a &lt;a href=&quot;arch_overview.html&quot;&gt;vis&atilde;o geral da arquitetura Elua&lt;/a&gt; voc&ecirc; vai ter uma boa vis&atilde;o da estrutura geral de &lt;b&gt;eLua&lt;/b&gt;,
+  Al&eacute;m disso, ao ler a &lt;a href=&quot;arch_overview.html&quot;&gt;vis&atilde;o geral da arquitetura eLua&lt;/a&gt; voc&ecirc; vai ter uma boa vis&atilde;o da estrutura geral de &lt;b&gt;eLua&lt;/b&gt;,
   que ir&aacute; ajudar, n&atilde;o importa se voc&ecirc; &eacute; um desenvolvedor ou n&atilde;o.&lt;/p&gt;
-&lt;p&gt;Antes de nos aprofundarmos nisso, v&aacute; para a &lt;a href=&quot;downloads.html&quot;&gt;se&ccedil;&atilde;o de downloads&lt;/a&gt; e baixe o c&oacute;digo fonte do &lt;b&gt;Elua&lt;/b&gt;, &eacute; muito mais f&aacute;cil seguir esta se&ccedil;&atilde;o acompanhando pelo c&oacute;digo-fonte.&lt;/p&gt;
+&lt;p&gt;Antes de nos aprofundarmos nisso, v&aacute; para a &lt;a href=&quot;downloads.html&quot;&gt;se&ccedil;&atilde;o de downloads&lt;/a&gt; e baixe o c&oacute;digo fonte do &lt;b&gt;eLua&lt;/b&gt;, &eacute; muito mais f&aacute;cil seguir esta se&ccedil;&atilde;o acompanhando pelo c&oacute;digo-fonte.&lt;/p&gt;
 &lt;/body&gt;&lt;/html&gt;

Modified: tags/pre0.6/doc/pt/dl_binaries.html
===================================================================
--- tags/pre0.6/doc/pt/dl_binaries.html	2009-10-02 04:01:00 UTC (rev 464)
+++ tags/pre0.6/doc/pt/dl_binaries.html	2009-10-02 04:09:50 UTC (rev 465)
@@ -4,13 +4,13 @@
 &lt;/head&gt;
 &lt;body style=&quot;background-color: rgb(255, 255, 255);&quot;&gt;
 &lt;br&gt;
-&lt;h3&gt;&lt;span class=&quot;info&quot;&gt;&lt;a name=&quot;sources&quot;&gt;&lt;/a&gt;Baixando imagens bin&#225;rias pr&#233;-constru&#237;das de Elua&lt;/span&gt;&lt;/h3&gt;
-Se voc&#234; tiver um hardware compat&#237;vel com Elua, voc&#234; n&#227;o precisa ser um desenvolvedor profissional do mundo os sistemas embutidos
-e de entender os detalhes do processo de constru&#231;&#227;o de Elua, para poder ter Elua em seus melhores kits. &lt;br&gt;
+&lt;h3&gt;&lt;span class=&quot;info&quot;&gt;&lt;a name=&quot;sources&quot;&gt;&lt;/a&gt;Baixando imagens bin&#225;rias pr&#233;-constru&#237;das de eLua&lt;/span&gt;&lt;/h3&gt;
+Se voc&#234; tiver um hardware compat&#237;vel com eLua, voc&#234; n&#227;o precisa ser um desenvolvedor profissional do mundo os sistemas embutidos
+e de entender os detalhes do processo de constru&#231;&#227;o de eLua, para poder ter eLua em seus melhores kits. &lt;br&gt;
 &lt;br&gt;
 O projeto eLua permite gerar imagens bin&#225;rias pr&#233;-constru&#237;das para todas as plataformas suportadas.&lt;br&gt;
 &lt;br&gt;
-Tudo que voc&#234; tem a fazer &#233; escolher o arquivo de imagem correspondente da tabela abaixo, grave-o em sua placa, conecte um terminal serial (ou Ethernet se sua placa suportar) e desfrute de Elua.&lt;br&gt;
+Tudo que voc&#234; tem a fazer &#233; escolher o arquivo de imagem correspondente da tabela abaixo, grave-o em sua placa, conecte um terminal serial (ou Ethernet se sua placa suportar) e desfrute de eLua.&lt;br&gt;
 &lt;br&gt;
 Os arquivos bin&#225;rios de eLua, tal como as &lt;a href=&quot;dl_sources.html&quot;&gt;distribui&#231;&#245;es de c&#243;digo-fonte&lt;/a&gt;,
 incluem alguns programas de exemplo em seu sistema de arquivos, assim voc&#234; poder&#225; executar e jog&#225;-los (sim, voc&#234; tem jogos tamb&#233;m!:), seguindo as instru&#231;&#245;es na nossa p&#225;gina &lt;a href=&quot;using.html&quot;&gt;Usando eLua&lt;/a&gt;. Os programas de exemplo dispon&#237;veis, est&#227;o descritos na nossa &lt;a href=&quot;examples.html&quot; target=&quot;_top&quot;&gt;p&#225;gina de exemplos&lt;/a&gt;

Modified: tags/pre0.6/doc/pt/dl_old.html
===================================================================
--- tags/pre0.6/doc/pt/dl_old.html	2009-10-02 04:01:00 UTC (rev 464)
+++ tags/pre0.6/doc/pt/dl_old.html	2009-10-02 04:09:50 UTC (rev 465)
@@ -1,5 +1,5 @@
 $$HEADER$$
-&lt;h3&gt;Download de vers&#245;es antigas de Elua&lt;/h3&gt;
+&lt;h3&gt;Download de vers&#245;es antigas de eLua&lt;/h3&gt;
 &lt;p&gt;As tabelas abaixo possuem links para as vers&#245;es oficiais anteriores de &lt;b&gt;eLua&lt;/b&gt; (c&#243;digo-fonte e os bin&#225;rios).&lt;/p&gt;
 &lt;a name=&quot;v041&quot; /&gt;&lt;h2&gt;0.4.1&lt;/h2&gt;
 &lt;table class=&quot;table_center&quot;&gt;

Modified: tags/pre0.6/doc/pt/faq.html
===================================================================
--- tags/pre0.6/doc/pt/faq.html	2009-10-02 04:01:00 UTC (rev 464)
+++ tags/pre0.6/doc/pt/faq.html	2009-10-02 04:09:50 UTC (rev 465)
@@ -4,15 +4,15 @@
 
 &lt;ul&gt;
   &lt;li&gt;&lt;a href=&quot;#learnlua&quot;&gt;Como posso aprender Lua? &#201; dif&#237;cil?&lt;/a&gt;&lt;/li&gt;
-  &lt;li&gt;&lt;a href=&quot;#helpelua&quot;&gt;Como posso ajudar Elua?&lt;/a&gt;&lt;/li&gt;
-  &lt;li&gt;&lt;a href=&quot;#comercial&quot;&gt;Posso usar Elua no meu projeto comercial de c&#243;digo fechado?&lt;/a&gt;&lt;/li&gt;
-  &lt;li&gt;&lt;a href=&quot;#fast&quot;&gt;Elua &#233; r&#225;pida o bastante para minha aplica&#231;&#227;o?&lt;/a&gt;&lt;/li&gt;
-  &lt;li&gt;&lt;a href=&quot;#minimum&quot;&gt;Quais s&#227;o os pr&#233;-requisitos m&#237;nimos para Elua?&lt;/a&gt;&lt;/li&gt;
+  &lt;li&gt;&lt;a href=&quot;#helpelua&quot;&gt;Como posso ajudar eLua?&lt;/a&gt;&lt;/li&gt;
+  &lt;li&gt;&lt;a href=&quot;#comercial&quot;&gt;Posso usar eLua no meu projeto comercial de c&#243;digo fechado?&lt;/a&gt;&lt;/li&gt;
+  &lt;li&gt;&lt;a href=&quot;#fast&quot;&gt;eLua &#233; r&#225;pida o bastante para minha aplica&#231;&#227;o?&lt;/a&gt;&lt;/li&gt;
+  &lt;li&gt;&lt;a href=&quot;#minimum&quot;&gt;Quais s&#227;o os pr&#233;-requisitos m&#237;nimos para eLua?&lt;/a&gt;&lt;/li&gt;
   &lt;li&gt;&lt;a href=&quot;#portability&quot;&gt;Tenho usado os m&#243;dulos da plataforma Lua (uart, spi, pwm, tmr...), posso realmente usar o mesmo c&#243;digo em todas as minhas diferentes plataformas?&lt;/a&gt;&lt;/li&gt;
   &lt;li&gt;&lt;a href=&quot;#luaversions&quot;&gt;Qual a diferen&#231;a entre Lua Ponto-Flutuante e Lua Inteiro?&lt;/a&gt;&lt;/li&gt;
-  &lt;li&gt;&lt;a href=&quot;#windows&quot;&gt;Todos os seus tutoriais fornecem instru&#231;&#245;es sobre como compilar Elua sob o Linux, mas parece que voc&#234; usa muitas ferramentas do Windows. Como pode isso?&lt;/a&gt;&lt;/li&gt;
+  &lt;li&gt;&lt;a href=&quot;#windows&quot;&gt;Todos os seus tutoriais fornecem instru&#231;&#245;es sobre como compilar eLua sob o Linux, mas parece que voc&#234; usa muitas ferramentas do Windows. Como pode isso?&lt;/a&gt;&lt;/li&gt;
   &lt;li&gt;&lt;a href=&quot;#cygwin&quot;&gt;Voces ir&#227;o fornecer intru&#231;&#245;es sobre como montar toolchains sob Cygwin no Windows?&lt;/a&gt;&lt;/li&gt;
-  &lt;li&gt;&lt;a href=&quot;#bytecode&quot;&gt;Sei que um programa Lua pode ser compilado para bytecode, ent&#227;o fiz a compila&#231;&#227;o de um dos exemplos Elua com o luac e tentei execut&#225;-lo em minha placa Elua, mas n&#227;o funcionou. Isso &#233; um bug no Elua?&lt;/a&gt;&lt;/li&gt;
+  &lt;li&gt;&lt;a href=&quot;#bytecode&quot;&gt;Sei que um programa Lua pode ser compilado para bytecode, ent&#227;o fiz a compila&#231;&#227;o de um dos exemplos eLua com o luac e tentei execut&#225;-lo em minha placa eLua, mas n&#227;o funcionou. Isso &#233; um bug no eLua?&lt;/a&gt;&lt;/li&gt;
   &lt;li&gt;&lt;a href=&quot;#outofmemory&quot;&gt;Quando tento executar meus programas em Lua, recebo a mensagem de erro &quot;falta de mem&#243;ria&quot;, o que devo fazer?&lt;/a&gt;&lt;/li&gt;
   &lt;li&gt;&lt;a href=&quot;#rotables&quot;&gt;Instalei o patch LTR, mas agora todas as tabelas dos meus m&#243;dulos (math, io, string, spi e assim por diante) est&#227;o como somente para leitura. Terei que desinstalar o patch LTR, se quiser ter permiss&#227;o de grava&#231;&#227;o nesses m&#243;dulos?&lt;/a&gt;&lt;/li&gt;
 &lt;/ul&gt;
@@ -20,18 +20,28 @@
 &lt;hr /&gt;
 
 &lt;a name=&quot;learnlua&quot; /&gt;&lt;h2&gt;Como posso aprender Lua? &#201; dif&#237;cil?&lt;/h2&gt;
-&lt;p&gt;Lua &#233; uma linguagem minimal&#237;stica (e mesmo assim muito poderosa) e muito f&#225;cil de se aprender. Uma v&#234;z entendido os conceitos b&#225;sicos, voc&#234; come&#231;ar&#225; a programar em Lua imediatamente. A &lt;a href=&quot;<A HREF="http://www.lua.org/">http://www.lua.org/</A>&quot;&gt;p&#225;gina de Lua na internet&lt;/a&gt; &#233; sua principal fonte de informa&#231;&#227;o. 
+&lt;p&gt;Lua &#233; uma linguagem minimalista (e mesmo assim muito poderosa) e muito f&#225;cil de se aprender. Uma v&#234;z
+entendidos os conceitos b&#225;sicos, voc&#234; come&#231;ar&#225; a programar em Lua imediatamente. A &lt;a href=&quot;<A HREF="http://www.lua.org/">http://www.lua.org/</A>&quot;&gt;p&#225;gina de Lua na internet&lt;/a&gt; &#233; sua principal fonte de informa&#231;&#227;o. 
 
-Na &lt;a href=&quot;<A HREF="http://www.lua.org/docs.html">http://www.lua.org/docs.html</A>&quot;&gt;p&#225;gina de documenta&#231;&#227;o&lt;/a&gt; do site, voc&#234; vai encontrar o manual de refer&#234;ncia e a primeira edi&#231;&#227;o do excelente livro vers&#227;o &quot;Programando em Lua&quot;. Recomendo que voc&#234; adquira a segunda edi&#231;&#227;o deste livro, j&#225; que voc&#234; ir&#225; encontrar tudo que voc&#234; realmente precisa aprender de Lua. Outra fonte muito interessante &#233; o &lt;a href=&quot;<A HREF="http://lua-users.org/wiki/">http://lua-users.org/wiki/</A>&quot;&gt;wiki Lua&lt;/a&gt;. Se voc&#234; precisar de mais ajuda, consulte a &lt;a href=&quot;<A HREF="http://www.lua.org/community.html">http://www.lua.org/community.html</A>&quot;&gt;p&#225;gina da comunidade&lt;/a&gt;. Lua tem uma comunidade muito amig&#225;vel e bastante ativa.
+Na &lt;a href=&quot;<A HREF="http://www.lua.org/docs.html">http://www.lua.org/docs.html</A>&quot;&gt;p&#225;gina de documenta&#231;&#227;o&lt;/a&gt; do site, voc&#234; vai encontrar o manual de refer&#234;ncia e a primeira edi&#231;&#227;o do excelente livro vers&#227;o &quot;Programando em Lua&quot;. Recomendamos que voc&#234; adquira a segunda edi&#231;&#227;o deste livro, j&#225; que voc&#234; ir&#225; encontrar tudo que voc&#234; realmente precisa aprender de Lua. Outra fonte muito interessante &#233;
+a &lt;a href=&quot;<A HREF="http://lua-users.org/wiki/">http://lua-users.org/wiki/</A>&quot;&gt;wiki Lua&lt;/a&gt;. Se voc&#234; precisar de mais ajuda, consulte a &lt;a href=&quot;<A HREF="http://www.lua.org/community.html">http://www.lua.org/community.html</A>&quot;&gt;p&#225;gina da comunidade&lt;/a&gt;. Lua tem uma comunidade muito amig&#225;vel e bastante ativa.
 
-&lt;a name=&quot;helpelua&quot; /&gt;&lt;h2&gt;Como posso ajudar Elua?&lt;/h2&gt;
-&lt;p&gt;&lt;b&gt;eLua&lt;/b&gt; tem muitas metas ambiciosas, por isso seria &#243;timo ter mais pessoas trabalhando com ela. D&#234; uma olhada na &lt;a href=&quot;status.html#roadmap&quot;&gt;p&#225;gina roadmap&lt;/a&gt;, e se existir algo que voc&#234; gostasse de participar, n&#227;o hesite em &lt;a href=&quot;overview.html#contacts&quot;&gt;contactar-nos&lt;/a&gt;. Al&#233;m disso, se voc&#234; quiser fazer uma doa&#231;&#227;o para o projeto (dinheiro, ou talvez uma placa para desenvolvimento) esteja certo que n&#227;o iremos dizer n&#227;o:) Tamb&#233;m ajuda muito, caso voc&#234; teste &lt;b&gt;eLua&lt;/b&gt; em sua pr&#7765;ria placa e encontre algum bug ou algum recurso inacabado. Ou se voc&#234; apenas pensou em um recurso legal que voc&#234; gostaria de ver no &lt;b&gt;eLua&lt;/b&gt;. Se assim for, n&#227;o hesite em &lt;a href=&quot;overview.html#contacts&quot;&gt;contactar-nos&lt;/a&gt;.
+&lt;a name=&quot;helpelua&quot; /&gt;&lt;h2&gt;Como posso ajudar eLua?&lt;/h2&gt;
+&lt;p&gt;&lt;b&gt;eLua&lt;/b&gt; tem muitas metas ambiciosas, por isso seria &#243;timo ter mais pessoas trabalhando
+conosco. D&#234; uma olhada na &lt;a href=&quot;status.html#roadmap&quot;&gt;p&#225;gina roadmap&lt;/a&gt;
+e, se houver interesse em colaborar, n&#227;o hesite em &lt;a href=&quot;overview.html#contacts&quot;&gt;contactar-nos&lt;/a&gt;. Al&#233;m disso, se voc&#234; quiser fazer uma doa&#231;&#227;o para o projeto (dinheiro, ou talvez uma placa para desenvolvimento) esteja certo que n&#227;o iremos
+recusar :) Seus reports de bugs encontrados em testes de &lt;b&gt;eLua&lt;/b&gt; em suas
+placas e suas id&#233;ias sobre recursos legais s&#227;o t&#227;o valiosos quanto. Se assim for, n&#227;o hesite em &lt;a
+href=&quot;overview.html#contacts&quot;&gt;nos contactar&lt;/a&gt;.
 
-&lt;a name=&quot;comercial&quot; /&gt;&lt;h2&gt;Posso usar Elua no meu projeto comercial de c&#243;digo fechado?&lt;/h2&gt;
-&lt;p&gt;A partir da vers&#227;o 0.6, &lt;b&gt;eLua&lt;/b&gt; &#233; distribu&#237;da sob a licen&#231;a MIT, assim voc&#234; pode us&#225;-la em seus projetos. Antes disso, foi distribu&#237;da sob a GPL, o que restringia seu uso para aplica&#231;&#245;es open source. Tenha cuidado, pois &lt;b&gt;eLua&lt;/b&gt; contem alguns (poucos) bibliotecas de terceiros, cada uma com seus pr&#243;prios termos de licen&#231;a que podem ser mais restritos que do MIT. Veja a &lt;a href=&quot;overview.html#license&quot;&gt;licen&#231;a eLua&lt;/a&gt; para mais detalhes.&lt;/p&gt; 
+&lt;a name=&quot;comercial&quot; /&gt;&lt;h2&gt;Posso usar eLua no meu projeto comercial de c&#243;digo fechado?&lt;/h2&gt;
+&lt;p&gt;A partir da vers&#227;o 0.6, &lt;b&gt;eLua&lt;/b&gt; &#233; distribu&#237;da sob a licen&#231;a MIT e
+isto permite que seja usada em projetos comerciais e de c&#243;digo propriet&#225;rio. 
+Antes disso, foi distribu&#237;da sob a GPL, o que restringia seu a aplica&#231;&#245;es open source. 
+Fique atento entretando, porque &lt;b&gt;eLua&lt;/b&gt; atualmente cont&#233;m algumas (poucas) bibliotecas de terceiros, cada uma com seus pr&#243;prios termos de licen&#231;a que podem ser mais restritos que do MIT. Veja a &lt;a href=&quot;overview.html#license&quot;&gt;licen&#231;a eLua&lt;/a&gt; para mais detalhes.&lt;/p&gt; 
 
-&lt;a name=&quot;fast&quot; /&gt;&lt;h2&gt;Elua &#233; r&#225;pida o bastante para minha aplica&#231;&#227;o?&lt;/h2&gt;
-&lt;p&gt;Isso depende muito de suas expectativas. Se voc&#234; espera que o seu c&#243;digo de Lua rode t&#227;o r&#225;pido quanto o seu c&#243;digo C compilado, isso n&#227;o ir&#225; acontecer, simplesmente porque C &#233; uma linguagem compilada, enquanto a Lua &#233; uma linguagem interpretada. Dito isso, voc&#234; vai ficar feliz em saber que a Lua &#233; uma das linguagens interpretadas mais r&#225;pidas que existem por a&#237;. Se voc&#234; realmente precisa de muita velocidade e de Lua, voc&#234; pode (muito f&#225;cil em Elua) escrever o seu c&#243;digo cr&#237;tica em se&#231;&#245;es de c&#243;digo C e export&#225;-los como um m&#243;dulo Lua. Desta forma, voc&#234; ter&#225; o melhor de dois mundos.&lt;br /&gt;
+&lt;a name=&quot;fast&quot; /&gt;&lt;h2&gt;eLua &#233; r&#225;pida o bastante para minha aplica&#231;&#227;o?&lt;/h2&gt;
+&lt;p&gt;Isso depende muito de suas expectativas. Se voc&#234; espera que o seu c&#243;digo de Lua rode t&#227;o r&#225;pido quanto o seu c&#243;digo C compilado, isso n&#227;o ir&#225; acontecer, simplesmente porque C &#233; uma linguagem compilada, enquanto a Lua &#233; uma linguagem interpretada. Dito isso, voc&#234; vai ficar feliz em saber que a Lua &#233; uma das linguagens interpretadas mais r&#225;pidas que existem por a&#237;. Se voc&#234; realmente precisa de muita velocidade e de Lua, voc&#234; pode (muito f&#225;cil em eLua) escrever o seu c&#243;digo cr&#237;tica em se&#231;&#245;es de c&#243;digo C e export&#225;-los como um m&#243;dulo Lua. Desta forma, voc&#234; ter&#225; o melhor de dois mundos.&lt;br /&gt;
 
 
    Atualmente n&#227;o temos nenhuma refer&#234;ncia oficial sobre a velocidade de Lua em dispositivos embarcados, mas voc&#234; dar uma olhada no exemplo TV-B-Gone na p&#225;gina &lt;a href=&quot;examples.html&quot;&gt;examplos&lt;/a&gt;. TV-B-Gone &#233; uma aplica&#231;&#227;o de controle remoto escrita em &lt;b&gt;eLua&lt;/b&gt;. 

Modified: tags/pre0.6/doc/pt/news.html
===================================================================
--- tags/pre0.6/doc/pt/news.html	2009-10-02 04:01:00 UTC (rev 464)
+++ tags/pre0.6/doc/pt/news.html	2009-10-02 04:09:50 UTC (rev 465)
@@ -39,7 +39,7 @@
 &lt;p&gt;Desfrute dessa nova atualiza&#231;&#227;o. A pr&#243;xima vers&#227;o ser&#225; focada na redu&#231;&#227;o das mem&#243;rias Flash e RAM de &lt;strong&gt;eLua&lt;/strong&gt;, al&#233;m de muitas outras surpresas :)&lt;/p&gt;
 
 &lt;h2&gt;16 de Outubro de 2008&lt;/h2&gt;
-&lt;p&gt;O &lt;a href=&quot;<A HREF="http://www.eluaproject.net/?p=Using_OpenOCD">http://www.eluaproject.net/?p=Using_OpenOCD</A>&quot;&gt;tutorial OpenOCD&lt;/a&gt; foi atualizado com uma nova se&#231;&#227;o sobre como usar o OpenOCD com CPU's STR7 da ST. Al&#233;m disso, a &lt;a href=&quot;<A HREF="http://www.eluaproject.net/?p=Overview">http://www.eluaproject.net/?p=Overview</A>&quot;&gt;p&#225;gina sobre&lt;/a&gt; foi atualizada com mais informa&#231;&#245;es sobre os autores de eLua. &#201; esperada uma nova vers&#227;o de Elua para at&#233; o fim de Outubro.&lt;/p&gt;
+&lt;p&gt;O &lt;a href=&quot;<A HREF="http://www.eluaproject.net/?p=Using_OpenOCD">http://www.eluaproject.net/?p=Using_OpenOCD</A>&quot;&gt;tutorial OpenOCD&lt;/a&gt; foi atualizado com uma nova se&#231;&#227;o sobre como usar o OpenOCD com CPU's STR7 da ST. Al&#233;m disso, a &lt;a href=&quot;<A HREF="http://www.eluaproject.net/?p=Overview">http://www.eluaproject.net/?p=Overview</A>&quot;&gt;p&#225;gina sobre&lt;/a&gt; foi atualizada com mais informa&#231;&#245;es sobre os autores de eLua. &#201; esperada uma nova vers&#227;o de eLua para at&#233; o fim de Outubro.&lt;/p&gt;
 
 &lt;h2&gt;10 de Setembro de 2008&lt;/h2&gt;
 &lt;p&gt;Foi liberada a vers&#227;o 0.4.1! &#201; uma atualiza&#231;&#227;o de pouca import&#226;ncia, pois seu prop&#243;sito principal &#233; se manter atualizada com Lua,


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000420.html">[Elua-svn] r464 - in tags/pre0.6: . romfs
</A></li>
	<LI>Next message: <A HREF="000422.html">[Elua-svn] r466 - in tags/pre0.6/doc: . pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#421">[ date ]</a>
              <a href="thread.html#421">[ thread ]</a>
              <a href="subject.html#421">[ subject ]</a>
              <a href="author.html#421">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/elua-svn">More information about the eLua-svn
mailing list</a><br>
</body></html>
