<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Elua-svn] r439 - tags/pre0.6/doc/pt
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/elua-svn/2009-September/index.html" >
   <LINK REL="made" HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r439%20-%20tags/pre0.6/doc/pt&In-Reply-To=%3C200909141633.n8EGXfTM008846%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000394.html">
   <LINK REL="Next"  HREF="000396.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Elua-svn] r439 - tags/pre0.6/doc/pt</H1>
    <B>dadosutter at BerliOS</B> 
    <A HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r439%20-%20tags/pre0.6/doc/pt&In-Reply-To=%3C200909141633.n8EGXfTM008846%40sheep.berlios.de%3E"
       TITLE="[Elua-svn] r439 - tags/pre0.6/doc/pt">dadosutter at mail.berlios.de
       </A><BR>
    <I>Mon Sep 14 18:33:41 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000394.html">[Elua-svn] r438 - in tags/pre0.6/doc: en pt
</A></li>
        <LI>Next message: <A HREF="000396.html">[Elua-svn] r440 - in tags/pre0.6/doc: . pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#395">[ date ]</a>
              <a href="thread.html#395">[ thread ]</a>
              <a href="subject.html#395">[ subject ]</a>
              <a href="author.html#395">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: dadosutter
Date: 2009-09-14 18:33:30 +0200 (Mon, 14 Sep 2009)
New Revision: 439

Modified:
   tags/pre0.6/doc/pt/overview.html
Log:
The main description page, now in portuguese too.



Modified: tags/pre0.6/doc/pt/overview.html
===================================================================
--- tags/pre0.6/doc/pt/overview.html	2009-09-13 14:19:40 UTC (rev 438)
+++ tags/pre0.6/doc/pt/overview.html	2009-09-14 16:33:30 UTC (rev 439)
@@ -1,125 +1,105 @@
 $$HEADER$$
-&lt;a name=&quot;whatis&quot; /&gt;&lt;h3&gt;What is eLua ?&lt;/h3&gt;
+&lt;a name=&quot;whatis&quot; /&gt;&lt;h3&gt;O que &#233; eLua ?&lt;/h3&gt;
 &lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt;
-stands for &lt;strong&gt;Embedded Lua&lt;/strong&gt; and the project
-aims to offer the full set of features of the &lt;a href=&quot;<A HREF="http://www.lua.org">http://www.lua.org</A>&quot;&gt;Lua Programming Language&lt;/a&gt; to the embedded world. &lt;/p&gt;&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt;
-is not a stripped down set of Lua; much on the contrary, it strives to
-offer the same features as the desktop version of Lua, but complementing them with 
-specific features for embedded use.
-Besides offering different flavors of the full Lua implementation
-(like the possiblity of choosing between an integer-only and a floating
-point numbers implementation),
-a lot of work was and will be done in the direction of making Lua
-more &quot;embedded-friendly&quot; by augmenting the core language with features
-that allow lower memory requirements.&lt;/p&gt;
-&lt;p&gt;Lua is the perfect example of a
-minimal, yet fully
-functional language. Although generally advertised as a &quot;scripting
-language&quot; (and used accordingly especially in the game industry), it is
-also fully capable of running stand-alone programs. Its limited
-resource requirements make it suitable to a lot of microcontroller
-families. The intrinsic high portability of the original Lua code
-(which is ANSI C and runs virtually on every platform for which an ANSI
-C compiler is available) combined with the highly portable software
-architecture of &lt;b&gt;eLua&lt;/b&gt; allow for easy porting of the project to a large variety or architectures. The peripheral access libraries exported by &lt;b&gt;eLua&lt;/b&gt; are also portable by design, so one could run a Lua program (without or with very few modifications) on every &lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; supported platform (the &lt;a href=&quot;status.html&quot;&gt;project status &amp; roadmap&lt;/a&gt; shows a constantly growing list of platforms on which &lt;b&gt;eLua&lt;/b&gt; is supported). &lt;b&gt;eLua&lt;/b&gt; inherits the minimalistic and functional design of Lua, staying in line with the well known &lt;b&gt;KISS&lt;/b&gt;, &lt;i&gt;Keep It Small and Simple&lt;/i&gt; philosophy.&lt;/p&gt;
-&lt;p&gt;The aim of the project is to have a fully functional Lua development
-environment &lt;strong&gt;on the microcontroller itself&lt;/strong&gt;,
-without the need to install a specific development environment&nbsp;on
-the PC side. This includes the ability to both edit and debug programs
-directly on target.
-Initially, a PC will still be needed in order to edit the Lua programs
-for the microcontroller. But as the project evolves this requirement
-will be relaxed, as a basic editor (also residing on the
-microcontroller) will be usable with a variety of input/output devices.&lt;/p&gt;
-&lt;p&gt;We can't end this short presentation without presenting our project motto: No matter what you do with &lt;b&gt;eLua&lt;/b&gt;, always remember to have fun with it :)&lt;/p&gt;
-&lt;br /&gt;
-&lt;br /&gt;
-&lt;a name=&quot;features&quot;&gt;&lt;/a&gt;&lt;h3&gt;Features&lt;/h3&gt;
-&lt;p&gt;As already stated, &lt;b&gt;eLua&lt;/b&gt; allows you to run Lua completely on
-the
-target microcontroller. A fast-growing set of complementary modules is also
-provided, for programming &lt;strong&gt;eLua&lt;/strong&gt;'s peripherals. &lt;/p&gt;
-&lt;p&gt;The following important features are ready or being implemented:&lt;/p&gt;
+significa &lt;strong&gt;Embedded Lua&lt;/strong&gt; e o projeto projeto visa trazer a
+funcionalidade completa da linguagem de programa&#231;&#227;o &lt;a href=&quot;<A HREF="http://www.lua.org">http://www.lua.org</A>&quot;&gt;Lua&lt;/a&gt; para o mundo
+do desenvolvimento de software embedded.&lt;/p&gt;
+&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; n&#227;o &#233; uma vers&#227;o reduzida de Lua, muito pelo contr&#225;rio, ela
+oferece os recursos completos da vers&#227;o desktop de Lua, complementando-a
+ainda com caracter&#237;sticas espec&#237;ficas para o uso embedded. 
+Al&#233;m disso, oferece a possibilidade de escolha no uso de implementa&#231;&#245;es diferentes para a execu&#231;&#227;o de Lua
+(ex: Lua Inteiro x Lua Ponto-Flutuante etc...). Muito trabalho foi e ainda ser&#225; feito no sentido de tornar Lua mais &quot;amig&#225;vel&quot; no mundo embedded, 
+como as caracter&#237;sticas j&#225; adicionadas que permitem a redu&#231;&#227;o dos requisitos de mem&#243;ria.&lt;/p&gt;
+&lt;p&gt;Lua &#233; o exemplo perfeito de uma linguagem m&#237;nima e, ainda assim, totalmente funcional. Embora geralmente anunciada como uma linguagem de &quot;scripting&quot; (e utilizada
+fortemente como tal na ind&#250;stria de jogos e em tantas outras &#225;reas), Lua &#233; capaz de executar programas como qualquer outra linguagem tradicional
+e grandes sistemas e aplica&#231;&#245;es (desktop ou web) s&#227;o desenvolvidos hoje utilizando
+seu poder e sua performance (ex: Adobe Lightroom).
+Suas necessidades em recursos limitados, a tornam especialmente adequada para um grande n&#250;mero de fam&#237;lias de microcontroladores. 
+A alta portabilidade intr&#237;nseca do c&#243;digo Lua original (que &#233; ANSI C e funciona praticamente em todas as plataformas
+que se conhece hoje), combinada com a arquitetura do software de &lt;b&gt;eLua&lt;/b&gt;, altamente port&#225;til, 
+permite a migra&#231;&#227;o f&#225;cil para uma grande variedade e arquiteturas de
+microcontroladores. 
+As bibliotecas de acesso a perif&#233;ricos exportadas por &lt;b&gt;eLua&lt;/b&gt; tamb&#233;m s&#227;o port&#225;teis por
+defini&#231;&#227;o, podendo-se assim executar um mesmo programa em Lua, sem ou com poucas
+modifica&#231;&#245;es, em cada plataforma suportada por &lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; (o &lt;a href=&quot;status.html&quot;&gt;status do projeto &amp; roadmap&lt;/a&gt; 
+mostram uma lista sempre crescente de plataformas em que &lt;b&gt;eLua&lt;/b&gt; &#233; suportada). 
+&lt;b&gt;eLua&lt;/b&gt; herdou o design minimalista e funcional de Lua, mantendo a filosofia bem conhecida do &quot;&lt;b&gt;KISS&lt;/b&gt;&quot; - &quot;&lt;i&gt;Keep It Small and Simple&lt;/i&gt;&quot;, que significa &quot;Mantenha seu c&#243;digo
+e sua arquitetura simples e reduzidos&quot;.&lt;/p&gt;
+
+&lt;a name=&quot;features&quot;&gt;&lt;/a&gt;&lt;h3&gt;Recursos&lt;/h3&gt;
+&lt;p&gt;Como j&#225; foi dito, &lt;b&gt;eLua&lt;/b&gt; permite que voc&#234; execute Lua diretamente no seu microcontrolador. 
+Um grande conjunto de m&#243;dulos complementares j&#225; existe para a programa&#231;&#227;o de perif&#233;ricos &lt;strong&gt;eLua&lt;/strong&gt;
+e o desenvolvimento de novos tem um crescimento cada vez mais r&#225;pido.&lt;/p&gt;
+&lt;p&gt;Relacionamos a seguir as fun&#231;&#245;es que est&#227;o prontas ou sendo implementadas:&lt;/p&gt;
 &lt;ul&gt;
-  &lt;li&gt;a flexible, configurable build system.&lt;/li&gt;
-  &lt;li&gt;access to the Lua interpreter on the target MCU via a variety of physical transports (RS-232 being the most popular).&lt;/li&gt;
-  &lt;li&gt;a (mostly) platform independent peripheral library (PIO,
-  UART, PWM, SPI, TMR, ADC, NET, I2C...)&lt;/li&gt;
-  &lt;li&gt;a very low footprint embedded ROM file system, easy to port to different types of memory chips and other storage devices&lt;/li&gt;
-  &lt;li&gt;a small FAT R/W file system layer for SD cards&lt;/li&gt;
-  &lt;li&gt;a minimal &quot;shell&quot; (for file operations, environment configuration and other facilities)&lt;/li&gt;
-  &lt;li&gt;network support&lt;/li&gt;
-  &lt;li&gt;an embedded http server&lt;/li&gt;
-  &lt;li&gt;Terminal / Console over Ethernet&lt;/li&gt;
-  &lt;li&gt;debugging (directly on the MCU or remotely with the PC).&lt;/li&gt;
+  &lt;li&gt;um sistema de configura&#231;&#227;o do build flex&#237;vel&lt;/li&gt;
+  &lt;li&gt;acesso ao interpretador Lua na sua MCU, atrav&#233;s de uma variedade de transportes f&#237;sicos
+  (RS-232, ethernet, ...)&lt;/li&gt;
+  &lt;li&gt;uma biblioteca de perif&#233;ricos independentes de plataforma (PIO, UART, PWM, SPI, TMR, ADC, NET,
+  I2C, CAN ...)&lt;/li&gt;
+  &lt;li&gt;um File System (ainda ROM), f&#225;cil de ser portado para diferentes tipos de chips de mem&#243;ria e outros dispositivos de armazenamento&lt;/li&gt;
+  &lt;li&gt;um pequeno Fyle System FAT R/W, para cart&#245;es MMC e SD&lt;/li&gt;
+  &lt;li&gt;um shell pr&#243;prio m&#237;nimo (para opera&#231;&#245;es com arquivos, configura&#231;&#227;o do ambiente e outros recursos)&lt;/li&gt;
+  &lt;li&gt;suporte a redes TCP/IP&lt;/li&gt;
+  &lt;li&gt;um servidor http embedded&lt;/li&gt;
+  &lt;li&gt;terminal/console usando Ethernet&lt;/li&gt;
+  &lt;li&gt;depura&#231;&#227;o (diretamente no MCU ou remotamente com o PC)&lt;/li&gt;
+  &lt;li&gt;execu&#231;&#227;o distribuida de c&#243;digo (LuaRPC)&lt;/li&gt;
 &lt;/ul&gt;
-&lt;p&gt;For more information about the functionality (implemented and planned) in &lt;strong&gt;eLua&lt;/strong&gt; check &lt;a href=&quot;status.html&quot;&gt;the status page&lt;/a&gt;.&lt;/p&gt;
-&lt;p&gt;Porting &lt;strong&gt;eLua&lt;/strong&gt; to another compatible platform should be as easy
-and
-painless as possible. Currently this is restricted to platforms for
-which the gcc+newlib combo is available. This restriction will disappear in the near future, as &lt;b&gt;eLua&lt;/b&gt; will have its own libc and thus it will be available on a much
-broader range of MCUs.&lt;/p&gt;
-&lt;p&gt;The Lua implementation comes in two flavors: &quot;regular Lua&quot;
-(using
-floating point as the number type) and &quot;integer Lua&quot; (using integers).
-&quot;Regular Lua&quot; will be able
-to perform floating point operations (but will be slower because the
-floating point operations will be emulated in software on the MCU),
-while &quot;integer Lua&quot; will only be able to perform operations with
-integer numbers (but support for fixed and even floating point can be
-added with separate modules) and thus will be faster.&lt;/p&gt;
-&lt;br /&gt;
-&lt;br /&gt;
-&lt;a name=&quot;audience&quot;&gt;&lt;/a&gt;&lt;h3&gt;Audience&lt;/h3&gt;
-&lt;p&gt;&lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; has a wide and varied audience, starting from newcomers to the embedded world who want an
-easy and powerful environment for prototyping, rapid application
-development and quick production, and ranging towards highly skilled developers
-that want to extend their programs with the Lua library facilities and
-portable features.&lt;/p&gt;&lt;p&gt;&lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt;
-allows embedded-oriented programmers to use the simplicity and
-power of the Lua programming language and to hide the low-level
-complexities and platform/architecture-dependent features. With &lt;b&gt;eLua&lt;/b&gt;,
-the programmer can focus on the actual implementation of his program,
-without having to worry about accessing the low-level peripheral
-configuration and data registers, as the platform libraries already
-take care of this. This increases productivity and eliminates the often
-frustrating task of dealing with platform-specific drivers. &lt;/p&gt;
-&lt;p&gt;The list below summarizes &lt;b&gt;eLua&lt;/b&gt;'s target audience:&lt;/p&gt;
+
+&lt;p&gt;Para obter mais informa&#231;&#245;es sobre as funcionalidades (implementadas e previstas) em &lt;strong&gt;eLua&lt;/strong&gt; veja a &lt;a href=&quot;status.html&quot;&gt;p&#225;gina de status&lt;/a&gt;.&lt;/p&gt;
+&lt;p&gt;O projeto foi concebido de forma a que migrar &lt;strong&gt;eLua&lt;/strong&gt; para uma outra plataforma
+ou mesmo arquitetura, seja algo f&#225;cil de ser realizado. 
+Atualmente, esta migra&#231;&#227;o est&#225; restrita &#224;s plataformas para as quais gcc + newlib estejam dispon&#237;veis. 
+Esta restri&#231;&#227;o ir&#225; desaparecer em um futuro pr&#243;ximo, j&#225; que &lt;b&gt;eLua&lt;/b&gt; ter&#225; sua pr&#243;pria libc e, portanto, 
+estar&#225; dispon&#237;vel em um leque mais amplo de MCUs.&lt;/p&gt;
+&lt;p&gt;Lua est&#225; dispon&#237;vel em duas implementa&#231;&#245;es: &quot;Lua padr&#227;o&quot; (usando ponto flutuante) e &quot;Lua inteiro&quot; (usando inteiro). 
+&quot;Lua padr&#227;o&quot; realiza opera&#231;&#245;es de ponto flutuante (mais lentas devido a emula&#231;&#227;o via software no MCU), 
+enquanto &quot;Lua inteiro&quot; realiza opera&#231;&#245;es com n&#250;meros inteiros 
+(suporte para ponto fixo e ponto flutuante podem ser adicionados em m&#243;dulos separados) e assim ser&#225; mais r&#225;pido.&lt;/p&gt;
+
+&lt;a name=&quot;audience&quot;&gt;&lt;/a&gt;&lt;h3&gt;P&#250;blico Alvo&lt;/h3&gt;
+&lt;p&gt;&lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; tem um audi&#234;ncia ampla e
+variada, desde rec&#233;m-chegados ao mundo embedded que desejam um f&#225;cil e poderoso ambiente para prototipa&#231;&#227;o, 
+desenvolvimento e produ&#231;&#227;o r&#225;pida de aplica&#231;&#245;es, como desenvolvedores altamente
+qualificados, que precisam expandir seus programas com recursos de
+bibliotecas de alto n&#237;vel com muita portabilidade.&lt;/p&gt;
+&lt;p&gt;&lt;span style=&quot;font-weight: bold;&quot;&gt;eLua&lt;/span&gt; permite que programadores do mundo embedded usem a simplicidade 
+e o poder da linguagem de programa&#231;&#227;o Lua e n&#227;o precisem se preocupar com as complexidades e 
+caracter&#237;sticas da plataforma/arquitetura-dependente do hardware. 
+Com &lt;b&gt;eLua&lt;/b&gt;, o programador pode concentrar-se na implementa&#231;&#227;o do seu programa, 
+sem ter que se preocupar com acesso &#224; registros e configura&#231;&#227;o de perif&#233;ricos, j&#225; que as bibliotecas da plataforma cuidam disso. 
+Com isso, aumentamos a produtividade e eliminamos tarefas muitas vezes frustrantes de lidar com drivers
+complexos de plataformas espec&#237;ficas.&lt;/p&gt;
+&lt;p&gt;A lista abaixo resume o p&#250;blico-alvo de &lt;b&gt;eLua&lt;/b&gt;:&lt;/p&gt;
 &lt;ul&gt;
-  &lt;li&gt;Embedded developers that are looking for a fast, easy to use and powerful way of coding.&lt;/li&gt;
-  &lt;li&gt;First-time
-embedded programmers (or simply first time programmers) who are
-looking for an easy way to &quot;dive&quot; into the embedded programming world.
-eLua is a great learning tool.&lt;/li&gt;
-  &lt;li&gt;People that aren't really
-developers, but still want to be able to prototype an embedded system
-fast and painless, without having to learn C for that.&lt;/li&gt;
-  &lt;li&gt;Embedded
-developers who need powerful meta-language mechanisms for complex code
-algorithms and data description.&lt;/li&gt;
-  &lt;li&gt;Field
-engineers that can go to their customer site and debug an eLua module on
-site, without any preparation at all, since the whole development
-environment resides on chip already.&lt;/li&gt;
+  &lt;li&gt;Desenvolvedores de sistemas embarcados que est&#227;o procurando uma maneira r&#225;pida, f&#225;cil de usar e uma poderosa forma de codifica&#231;&#227;o.&lt;/li&gt;
+  &lt;li&gt;Novos programadores de sistemas embarcados (ou simplesmente programadores) que est&#227;o procurando uma maneira f&#225;cil de &quot;mergulhar&quot; no mundo da programa&#231;&#227;o
+  embedded. &lt;b&gt;eLua&lt;/b&gt; &#233; uma grande ferramenta de aprendizagem.&lt;/li&gt;
+  &lt;li&gt;Pessoas que n&#227;o s&#227;o realmente os desenvolvedores, mas ainda assim, querem ser capazes de projetar sistemas embarcados de forma r&#225;pida e sem muita dor-de-cabe&#231;a, sem ter para isso que aprenderem a linguagem C.
+  (Designers, artistas, ...)&lt;/li&gt;
+  &lt;li&gt;Desenvolvedores de sistemas embarcados que necessitam de mecanismos poderosos de
+  meta-linguagem, para codificar algoritmos complexos e descri&#231;&#227;o de dados.&lt;/li&gt;
+  &lt;li&gt;Engenheiros de campo que podem ir aos seus clientes e realizar depura&#231;&#227;o de m&#243;dulos de &lt;b&gt;eLua&lt;/b&gt; no local, sem para isso, necessitar de prepara&#231;&#227;o, j&#225; que o ambiente de desenvolvimento reside em um chip.&lt;/li&gt;
 &lt;/ul&gt;
+
+&lt;a name=&quot;authors&quot; /&gt;&lt;h3&gt;Autores&lt;/h3&gt;
+&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; &#233; um projeto conjunto de &lt;strong&gt;&lt;a href=&quot;#contacts&quot;&gt;Bogdan Marinescu&lt;/a&gt;&lt;/strong&gt;, um desenvolvedor de software de Bucarest, 
+na Rom&#234;nia e &lt;strong&gt;&lt;a href=&quot;#contacts&quot;&gt;Dado Sutter&lt;/a&gt;&lt;/strong&gt;, que
+dirige o Laborat&#243;rio LED Lab na &lt;a href=&quot;<A HREF="http://www.puc-rio.br/">http://www.puc-rio.br/</A>&quot;&gt;Pontif&#237;cia Universidade Cat&#243;lica, PUC-Rio&lt;/a&gt;, no Rio de
+Janeiro, Brasil.&lt;/p&gt;
+&lt;p&gt;Suas origens v&#234;m dos projetos &lt;a
+href=&quot;<A HREF="http://www.circuitcellar.com/renesas2005m16c/winners/1685.htm">http://www.circuitcellar.com/renesas2005m16c/winners/1685.htm</A>&quot;&gt;ReVaLuaTe&lt;/a&gt;, 
+tamb&#233;m desenvolvido pelo Bogdan Marinescu (como participante do concurso Renesas M16C Design de 2005) e do Projeto Volta,
+desenvolvido por Dado Sutter na PUC-Rio entre 2005 e 2007.&lt;/p&gt;
+&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; &#233; um projeto Open Source e uma lista crescente de colaboradores pode ser encontrada na nossa &lt;a
+href=&quot;en_comunity.html#credits&quot;&gt;p&#225;gina de cr&#233;ditos&lt;/a&gt;&lt;/p&gt;
 &lt;br /&gt;
-&lt;br /&gt;
-&lt;a name=&quot;authors&quot; /&gt;&lt;h3&gt;Authors&lt;/h3&gt;
-&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; is a joint project of &lt;strong&gt;&lt;a href=&quot;#contacts&quot;&gt;Bogdan Marinescu&lt;/a&gt;&lt;/strong&gt;,
-a software developer from Bucharest, Romania and &lt;strong&gt;&lt;a href=&quot;#contacts&quot;&gt;Dado Sutter&lt;/a&gt;&lt;/strong&gt;,
-head of the Led Lab at &lt;a href=&quot;<A HREF="http://www.puc-rio.br/">http://www.puc-rio.br/</A>&quot;&gt;PUC-Rio University&lt;/a&gt;, in Rio de Janeiro (Brazil). &lt;/p&gt;
-&lt;p&gt;Its origins come from the &lt;a href=&quot;<A HREF="http://www.circuitcellar.com/renesas2005m16c/winners/1685.htm">http://www.circuitcellar.com/renesas2005m16c/winners/1685.htm</A>&quot;&gt;ReVaLuaTe&lt;/a&gt;
-project also developed by Bogdan Marinescu (as a contest entry for the
-2005 Renesas M16CDesign Contest), and the Volta Project, managed by
-Dado Sutter at PUC-Rio from 2005 to 2007.&lt;/p&gt;
-&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; is Open Source and an always growing list of collaborators can be found in our &lt;a
-href=&quot;en_comunity.html#credits&quot;&gt;Credits Page&lt;/a&gt;&lt;/p&gt;
-&lt;br /&gt;
 &lt;table style=&quot;width: 578px; height: 256px; text-align: left; margin-left: auto; margin-right: auto;&quot; border=&quot;1&quot; cellpadding=&quot;2&quot; cellspacing=&quot;2&quot;&gt;
 &lt;tbody&gt;
 &lt;tr&gt;
-  &lt;td style=&quot;text-align: center; font-family: Verdana; font-weight: bold;&quot;&gt;&lt;big&gt;ReVaLuaTe Project&lt;/big&gt;&lt;/td&gt;
-  &lt;td style=&quot;text-align: center; font-family: Verdana; font-weight: bold;&quot;&gt;&lt;big&gt;Volta Project&lt;/big&gt;&lt;/td&gt;
+  &lt;td style=&quot;text-align: center; font-family: Verdana; font-weight: bold;&quot;&gt;&lt;big&gt;Projeto ReVaLuaTe&lt;/big&gt;&lt;/td&gt;
+  &lt;td style=&quot;text-align: center; font-family: Verdana; font-weight: bold;&quot;&gt;&lt;big&gt;Projeto Volta&lt;/big&gt;&lt;/td&gt;
 &lt;/tr&gt;
 &lt;tr&gt;
   &lt;td style=&quot;text-align: center;&quot;&gt;&lt;img style=&quot;width: 278px; height: 188px;&quot; alt=&quot;ReVaLuaTe project picture&quot; src=&quot;images/terminalreneseas.jpg&quot; /&gt;&lt;/td&gt;
@@ -130,15 +110,19 @@
 &lt;br /&gt;
 &lt;br /&gt;
 &lt;br /&gt;
-&lt;a name=&quot;contacts&quot; /&gt;&lt;h3&gt;Contacts&lt;/h3&gt;
-&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; authors can be contacted at:&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Bogdan Marinescu:&lt;/strong&gt; bogdan.marinescu -at- gmail.com&lt;/p&gt;
-&lt;p&gt;&lt;strong&gt;Dado Sutter:&lt;/strong&gt; dadosutter -at- gmail.com&lt;/p&gt;&lt;p&gt;You are also welcomed to share your questions and suggestions on our &lt;a href=&quot;comunity.html#lists&quot;&gt;Mail Discussion List&lt;/a&gt;&lt;/p&gt;
+&lt;a name=&quot;contacts&quot; /&gt;&lt;h3&gt;Contatos&lt;/h3&gt;
+&lt;p&gt;Os autores de &lt;strong&gt;eLua&lt;/strong&gt; podem ser contactados em:&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Bogdan Marinescu:&lt;/strong&gt; bogdan.marinescu -at- gmail.com&lt;/p&gt;
+&lt;p&gt;&lt;strong&gt;Dado Sutter:&lt;/strong&gt; dadosutter -at- gmail.com&lt;/p&gt;
+&lt;p&gt;Sejam bem-vindos e compartilhem suas d&#250;vidas e sugest&#245;es em nossa &lt;a href=&quot;comunity.html#lists&quot;&gt;Lista de Discuss&#227;o&lt;/a&gt;&lt;/p&gt;
 &lt;br /&gt;
 &lt;br /&gt;
-&lt;a name=&quot;license&quot; /&gt;&lt;h3&gt;License&lt;/h3&gt;
-&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; is Open Source and is freely
-distributed under the MIT licence.&lt;/p&gt;
-&lt;p&gt;The Lua code (with all the &lt;strong&gt;eLua&lt;/strong&gt; specific changes) is included in the source tree and is, of course, licensed under the same &lt;a href=&quot;<A HREF="http://en.wikipedia.org/wiki/MIT_License">http://en.wikipedia.org/wiki/MIT_License</A>&quot;&gt;MIT license that Lua uses.&lt;/a&gt;&lt;/p&gt;
-&lt;p&gt;There may be other components with different licenses in &lt;strong&gt;eLua&lt;/strong&gt;, see &lt;strong&gt;COPYING&lt;/strong&gt; in the source distribution for details.&lt;/p&gt;
+&lt;a name=&quot;license&quot; /&gt;&lt;h3&gt;Licen&#231;a&lt;/h3&gt;
+&lt;p&gt;&lt;strong&gt;eLua&lt;/strong&gt; &#233; Open Source e &#233; distribu&#237;da gratuitamente sob a licen&#231;a MIT.&lt;/p&gt;
+&lt;p&gt;A licen&#231;a MIT, diferentemente de outras licen&#231;as de c&#243;digo aberto (ex:
+GPL), permite que produtos de c&#243;digo propriet&#225;rio sejam desenvolvidos
+utilizando &lt;b&gt;eLua&lt;/b&gt;.&lt;/p&gt;
+&lt;p&gt;O c&#243;digo Lua (com todas as mudan&#231;as espec&#237;ficas de &lt;strong&gt;eLua&lt;/strong&gt;) est&#225; inclu&#237;do na &#225;rvore de origem e
+&#233;, naturalmente, licenciado sob a mesma &lt;a href=&quot;<A HREF="http://en.wikipedia.org/wiki/MIT_License">http://en.wikipedia.org/wiki/MIT_License</A>&quot;&gt;licen&#231;a MIT de Lua.&lt;/a&gt;&lt;/p&gt;
+&lt;p&gt;H&#225; ainda outros (poucos) componentes com diferentes licen&#231;as hoje, em uso no c&#243;digo de &lt;strong&gt;eLua&lt;/strong&gt;. 
+Consulte o arquivo &lt;strong&gt;COPYING&lt;/strong&gt; na distribui&#231;&#227;o fonte para maiores detalhes.&lt;/p&gt;
 $$FOOTER$$
-


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000394.html">[Elua-svn] r438 - in tags/pre0.6/doc: en pt
</A></li>
	<LI>Next message: <A HREF="000396.html">[Elua-svn] r440 - in tags/pre0.6/doc: . pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#395">[ date ]</a>
              <a href="thread.html#395">[ thread ]</a>
              <a href="subject.html#395">[ subject ]</a>
              <a href="author.html#395">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/elua-svn">More information about the eLua-svn
mailing list</a><br>
</body></html>
