<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Elua-svn] r450 - tags/pre0.6/doc/pt
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/elua-svn/2009-September/index.html" >
   <LINK REL="made" HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r450%20-%20tags/pre0.6/doc/pt&In-Reply-To=%3C200909170321.n8H3LB6m023588%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000405.html">
   <LINK REL="Next"  HREF="000407.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Elua-svn] r450 - tags/pre0.6/doc/pt</H1>
    <B>dadosutter at BerliOS</B> 
    <A HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r450%20-%20tags/pre0.6/doc/pt&In-Reply-To=%3C200909170321.n8H3LB6m023588%40sheep.berlios.de%3E"
       TITLE="[Elua-svn] r450 - tags/pre0.6/doc/pt">dadosutter at mail.berlios.de
       </A><BR>
    <I>Thu Sep 17 05:21:11 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000405.html">[Elua-svn] r449 - in tags/pre0.6/doc: en pt
</A></li>
        <LI>Next message: <A HREF="000407.html">[Elua-svn] r451 - in tags/pre0.6/doc: . pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#406">[ date ]</a>
              <a href="thread.html#406">[ thread ]</a>
              <a href="subject.html#406">[ subject ]</a>
              <a href="author.html#406">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: dadosutter
Date: 2009-09-17 05:21:09 +0200 (Thu, 17 Sep 2009)
New Revision: 450

Modified:
   tags/pre0.6/doc/pt/installing_at91sam7x.html
   tags/pre0.6/doc/pt/installing_lpc2888.html
   tags/pre0.6/doc/pt/installing_str7.html
   tags/pre0.6/doc/pt/installing_str9.html
Log:
PT_BR revisions
v0.6 approaching fast now :)



Modified: tags/pre0.6/doc/pt/installing_at91sam7x.html
===================================================================
--- tags/pre0.6/doc/pt/installing_at91sam7x.html	2009-09-16 05:13:59 UTC (rev 449)
+++ tags/pre0.6/doc/pt/installing_at91sam7x.html	2009-09-17 03:21:09 UTC (rev 450)
@@ -12,7 +12,8 @@
 da &lt;a href=&quot;<A HREF="http://www.olimex.com">http://www.olimex.com</A>&quot;&gt;Olimex&lt;/a&gt;. 
 Em nossa opini&#227;o, est&#225; &#233; realmente uma boa placa, com um pre&#231;o razo&#225;vel, mas que carece de um pacote de documenta&#231;&#227;o
 adequada. 
-&#201; equipada com uma CPU AT91SAM7X256. Gostaria muito de colocar as m&#227;os numa placa com a CPU AT91SAM7X512, como isso ainda n&#227;o aconteceu, vou ficar com a AT91SAM7X256
+&#201; equipada com uma CPU AT91SAM7X256. Gostariamos de colocar as m&#227;os numa placa com a CPU
+AT91SAM7X512 mas, como n&#227;o produziram uma ainda, vamos ficar com a AT91SAM7X256
 por enquanto :)
 Certamente voc&#234; ainda poder&#225; usar este tutorial com uma placa diferente da AT91SAM7X256. 
 Al&#233;m disso, as instru&#231;&#245;es devem ser bastante semelhantes para CPUs AT91SAM7X512.&lt;/p&gt;
@@ -41,6 +42,7 @@
   &lt;li&gt;Abaixo de (&quot;Scripts&quot;), selecione o &quot;Boot from Flash (GPNVM2)&quot; e pressione &quot;Execute&quot;.&lt;/li&gt;
   &lt;li&gt;Saia da aplica&#231;&#227;o.&lt;/li&gt;
  &lt;/ul&gt;
- &lt;p&gt;Pronto! Um pouco complicado, mas &lt;b&gt;eLua&lt;/b&gt; est&#225; agora programada na CPU, agora voc&#234; pode iniciar o seu emulador de terminal e se divertir, conforme descrito em &lt;a href=&quot;using.html&quot;&gt;usandp eLua&lt;/a&gt;.&lt;/p&gt;
+ &lt;p&gt;Pronto! Um pouco complicado, mas &lt;b&gt;eLua&lt;/b&gt; est&#225; agora programada na
+ CPU. Agora voc&#234; pode iniciar o seu emulador de terminal e se divertir, conforme descrito em &lt;a href=&quot;using.html&quot;&gt;usandp eLua&lt;/a&gt;.&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_lpc2888.html
===================================================================
--- tags/pre0.6/doc/pt/installing_lpc2888.html	2009-09-16 05:13:59 UTC (rev 449)
+++ tags/pre0.6/doc/pt/installing_lpc2888.html	2009-09-17 03:21:09 UTC (rev 450)
@@ -1,6 +1,28 @@
 $$HEADER$$
 &lt;h3&gt;Instalando &lt;b&gt;eLua&lt;/b&gt; com o processador LPC2888 da NXP&lt;/h3&gt;
-&lt;p&gt;O processador &lt;a href=&quot;<A HREF="http://www.standardics.nxp.com/products/lpc2000/all/~LPC2888/">http://www.standardics.nxp.com/products/lpc2000/all/~LPC2888/</A>&quot;&gt;LPC2888&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.nxp.com">http://www.nxp.com</A>&quot;&gt;NXP&lt;/a&gt; possui algumas caracter&#237;sticas interessantes: uma enorme mem&#243;ria flash interna de 1Mbyte, USB 2.0 on-chip de alta velocidade e o mais complexo (de longe) clock de rede que eu j&#225; vi em um chip ATM7TDMI. Al&#233;m disso, implementa o USB DFU (Device Firmware Update) atrav&#233;s de sua interface USB, por isso fica bastante f&#225;cil de program&#225;-lo direto no hardware. Estou usando a placa de desenvolvimento &lt;a href=&quot;<A HREF="http://www.olimex.com/dev/lpc-h2888.html">http://www.olimex.com/dev/lpc-h2888.html</A>&quot;&gt;Olimex LPC-H2888&lt;/a&gt; baseada nesse processaor, que vem com 32MBytes de SDRAM externo e tamb&#233;m 2Mbytes de flash externo, o que &#233; mais que suficiente para minhas necessidades. No entanto, existem algumas desvantagens. Para come&#231;ar, seu aplicativo de suporte (da Panasonic) &#233; muito fraco quando comparado a outros concorrentes que aceitam &lt;b&gt;eLua&lt;/b&gt;. N&#227;o possui nem mesmo todos os drivers, so!
 mente uns poucos, e bastante imcompletos, exemplos. O esquema do processador poderia ser mais detalhado, especialmente quando se refere a clock (que &#233; bastante complicado). Na minha placa, a atualiza&#231;&#227;o do firmware via USB (DFU download mode) parou de funcionar de repente, sem qualquer raz&#227;o aparente, e n&#227;o consegui usar mais a DFU no chip, desde ent&#227;o, tive que recorrer ao uso do OpenOCD (e preparar um arquivo de configura&#231;&#227;o, j&#225; que era imposs&#237;vel encontrar um para LPC2888). A CPU em si tem uma limita&#231;&#227;o muito interessante: por causa de um erro estrutural, &#233; imposs&#237;vel executar c&#243;digo Thumb da mem&#243;ria flash on-chip, s&#243; &#233; poss&#237;vel executar c&#243;digo ARM comum (?!). Al&#233;m disso, a placa que tenho da Olimex ignora completamente o fato de que, esse chip &#233; capaz de rodar no modo DFU (a placa n&#227;o inclui nenhum tipo de jumper e/ou switch para habilitar este modo), logo, tive que construir uma placa complementar. Era algo que j&#225; tinha que fazer mesmo, pois a m!
 inha placa tamb&#233;m n&#227;o possui uma interface RS232, que constr!
 ui basea
da no chip MAX232. Depois de tudo isso, concluo que minha experi&#234;ncia com este chip (e com a placa Olimex) n&#227;o foi t&#227;o agrad&#225;vel assim, mas isso n&#227;o muda o fato de que o LPC-H2888 &#233; uma das mais poderosas placas em que &lt;b&gt;eLua&lt;/b&gt; pode ser executada.&lt;/p&gt;
+&lt;p&gt;O processador &lt;a href=&quot;<A HREF="http://www.standardics.nxp.com/products/lpc2000/all/~LPC2888/">http://www.standardics.nxp.com/products/lpc2000/all/~LPC2888/</A>&quot;&gt;LPC2888&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.nxp.com">http://www.nxp.com</A>&quot;&gt;NXP&lt;/a&gt; 
+possui algumas caracter&#237;sticas interessantes: uma enorme mem&#243;ria flash interna de 1Mbyte, USB 2.0 on-chip de alta velocidade 
+e o mais complexo (de longe) clock de rede que j&#225; vimos em um chip ATM7TDMI. 
+Al&#233;m disso, implementa o USB DFU (Device Firmware Update) atrav&#233;s de sua interface USB
+e por isso fica bastante f&#225;cil de program&#225;-lo direto no hardware. Estamos usando a placa de desenvolvimento 
+&lt;a href=&quot;<A HREF="http://www.olimex.com/dev/lpc-h2888.html">http://www.olimex.com/dev/lpc-h2888.html</A>&quot;&gt;Olimex LPC-H2888&lt;/a&gt; baseada nesse
+processador, que vem com 32M Bytes de SDRAM externo e tamb&#233;m 2M Bytes de flash externo, 
+o que &#233; mais que suficiente para nossas necessidades. 
+No entanto, existem algumas desvantagens. Para come&#231;ar, seu aplicativo de suporte (da Panasonic) &#233; muito
+fraco, quando comparado a outros concorrentes que aceitam &lt;b&gt;eLua&lt;/b&gt;. 
+N&#227;o possui nem mesmo todos os drivers, somente uns poucos e bastante imcompletos. O esquema do processador poderia ser mais detalhado, 
+especialmente quando se refere a clock (que &#233; bastante complicado). Em nossa placa, a atualiza&#231;&#227;o do firmware via USB (DFU download mode) 
+parou de funcionar de repente, sem qualquer raz&#227;o aparente e n&#227;o conseguimos
+mais usar a DFU no chip, desde ent&#227;o, tivemos que recorrer ao uso do OpenOCD (e preparar um arquivo de configura&#231;&#227;o, j&#225; que era imposs&#237;vel encontrar um para LPC2888). 
+A CPU em si tem uma limita&#231;&#227;o muito interessante: por causa de um erro estrutural &#233; imposs&#237;vel executar c&#243;digo 
+Thumb da mem&#243;ria flash on-chip, s&#243; &#233; poss&#237;vel executar c&#243;digo ARM comum (?!). 
+Al&#233;m disso, a placa que temos da Olimex ignora completamente o fato de que esse chip &#233; capaz de rodar no modo DFU 
+(a placa n&#227;o inclui nenhum tipo de jumper e/ou switch para habilitar este modo), logo,
+tivemos que construir uma placa complementar. Era algo que j&#225; precisaria ser
+feito mesmo, pois a placa tamb&#233;m n&#227;o possui uma interface RS232, que foi
+constru&#237;da baseada no chip MAX232. Depois de tudo isso, concluimos que nossa
+que nossa experi&#234;ncia com este chip (e com a placa Olimex) n&#227;o foi t&#227;o agrad&#225;vel assim mas isso n&#227;o muda o fato de que o LPC-H2888 
+&#233; uma das mais poderosas placas em que &lt;b&gt;eLua&lt;/b&gt; pode ser executada.&lt;/p&gt;
  &lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
  &lt;p&gt;Antes de utilizar &lt;b&gt;eLua&lt;/b&gt; na CPU LPC2888, certifique-se de que:&lt;/p&gt;
  &lt;ul&gt;
@@ -15,6 +37,6 @@
 &lt;div class=&quot;code&quot;&gt;&lt;pre&gt;C:&gt; hostcryptv2 elua_lua_lpc2888.bin elua.ebn -K0 -F0&lt;/pre&gt;&lt;/div&gt;
 &lt;p&gt;Como resultado, voc&#234; ter&#225; um novo arquivo (&lt;i&gt;elua.ebn&lt;/i&gt;). Agora, inicialize seu chip no modo DFU (veja acima) e use o utilit&#225;rio DFU (&lt;i&gt;MassDFUApplication.exe&lt;/i&gt;) para carregar &lt;i&gt;elua.ebn&lt;/i&gt; em seu chip (as instru&#231;&#245;es sobre como usar o MassDFUApplication est&#227;o em um arquivo PDF que est&#225; inclu&#237;do no pacote de LPC2888 DFU). Reinicie a placa e divirta-se.&lt;/p&gt;
  &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; no LPC2888 usando o OpenOCD&lt;/h3&gt;
-&lt;p&gt;Se a sua sorte est&#225; como a minha, e sua placa se recusa a funcionar no modo DFU, siga este &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial do OpenOCD&lt;/a&gt; para gravar sua imagem usando OpenOCD.&lt;/p&gt;
+&lt;p&gt;Se voc&#234; tiver tanta sorte quanto n&#243;s, e sua placa se recusa a funcionar no modo DFU, siga este &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial do OpenOCD&lt;/a&gt; para gravar sua imagem usando OpenOCD.&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_str7.html
===================================================================
--- tags/pre0.6/doc/pt/installing_str7.html	2009-09-16 05:13:59 UTC (rev 449)
+++ tags/pre0.6/doc/pt/installing_str7.html	2009-09-17 03:21:09 UTC (rev 450)
@@ -1,14 +1,30 @@
 $$HEADER$$
 &lt;h3&gt;Instalando &lt;b&gt;eLua&lt;/b&gt; na fam&#237;lia de CPUs STR7 da ST&lt;/h3&gt;
- &lt;p&gt;&lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-str7.html">http://www.st.com/mcu/inchtml-pages-str7.html</A>&quot;&gt;STR7&lt;/a&gt; &#233; uma fam&#237;lia de processadores baseados no ATM7TDMI da &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt;. Eles s&#227;o pequenos, MCUs de baixa pot&#234;ncia, com um conjunto equilibrado de perif&#233;ricos embutidos no chip. Estou usando a placa &lt;a href=&quot;<A HREF="http://www.sctec.com.br/content/view/101/30/">http://www.sctec.com.br/content/view/101/30/</A>&quot;&gt;MOD711&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.sctec.com.br">http://www.sctec.com.br</A>&quot;&gt;ScTec&lt;/a&gt;. A placa est&#225; baseada na variante STR711FR2 da fam&#237;lia STR7. Uma vez que esta placa ainda est&#225; em desenvolvimento, fui obrigado a adicionar algumas coisas: um conversor MAX3232 RS232 para TTL para a interface serial, um par de LEDs e um bot&#227;o de reset. Depois disso, a placa estava pronta para &lt;b&gt;eLua&lt;/b&gt;:)&lt;/p&gt;
- &lt;h3&gt;Pr&#225;-requisitos&lt;/h3&gt; 
+ &lt;p&gt;&lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-str7.html">http://www.st.com/mcu/inchtml-pages-str7.html</A>&quot;&gt;STR7&lt;/a&gt; &#233; uma fam&#237;lia de processadores baseados no ATM7TDMI da &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt;. 
+ Eles s&#227;o pequenos, MCUs de baixa pot&#234;ncia, com um conjunto equilibrado de perif&#233;ricos embutidos no chip. 
+ Para este tutorial, estamos usando a placa &lt;a href=&quot;<A HREF="http://www.sctec.com.br/content/view/101/30/">http://www.sctec.com.br/content/view/101/30/</A>&quot;&gt;MOD711&lt;/a&gt; da
+ empresa brasileira &lt;a href=&quot;<A HREF="http://www.sctec.com.br">http://www.sctec.com.br</A>&quot;&gt;ScTec Automa&#231;&#227;o e
+ Projetos Especiais&lt;/a&gt;. A placa est&#225; baseada na variante STR711FR2 da fam&#237;lia STR7. 
+ Fomos preciso adicionar algumas coisas &#224; este kit:
+ &lt;ul&gt;
+ &lt;li&gt;um conversor MAX3232 RS232 para TTL para a interface serial&lt;/li&gt;
+ &lt;li&gt;um par de LEDs&lt;/li&gt;
+&lt;li&gt; um bot&#227;o de reset&lt;/li&gt;
+&lt;/ul&gt;
+Depois disso, a placa estava pronta para &lt;b&gt;eLua&lt;/b&gt;:)&lt;/p&gt;
+ &lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
  &lt;p&gt;Antes de come&#231;ar a usar &lt;b&gt;eLua&lt;/b&gt; na CPU STR711FR2, certifique-se de que:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;voc&#234; est&#225; usando Linux, Windows, ou qualquer outro sistema operacional que tenha suporte para &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt;. Voc&#234; pode dar uma olhada no meu &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial do OpenOCD&lt;/a&gt; antes de continuar.&lt;/li&gt;
+ &lt;li&gt;voc&#234; est&#225; usando Linux, Windows, ou qualquer outro sistema operacional que tenha suporte para &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt;. Voc&#234; pode dar uma olhada no
+ nosso &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial do OpenOCD&lt;/a&gt; antes de continuar.&lt;/li&gt;
  &lt;li&gt;voc&#234; j&#225; tem o seu arquivo com a imagem de &lt;b&gt;eLua&lt;/b&gt; para a CPU STR711FR2 (&lt;a href=&quot;building.html&quot;&gt;gerado&lt;/a&gt; ou &lt;a href=&quot;downloads.html&quot;&gt;baixado&lt;/a&gt;).&lt;/li&gt;
  &lt;/ul&gt;
- &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; na placa MOD711&lt;/h3&gt;
- &lt;p&gt;Voc&#234; precisa do OpenOCD para fazer isso. Basta seguir as instru&#231;&#245;es do meu &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial OpenOCD&lt;/a&gt;. Na p&#225;gina do tutorial, voc&#234; tamb&#233;m encontrar&#225; links para os arquivos de configura&#231;&#227;o do OpenOCD que estou usando para gravar &lt;b&gt;eLua&lt;/b&gt; na placa MOD711. E &#233; isso a&#237;! &lt;b&gt;eLua&lt;/b&gt; est&#225; gravado na CPU, agora &#233; s&#243; iniciar o emulador de terminal e se divertir, conforme descrito em &lt;a href=&quot;using.html&quot;&gt;using eLua&lt;/a&gt;.&lt;/p&gt;
-&lt;p&gt;&lt;b&gt;NOTA IMPORTANTE:&lt;/b&gt; para esta placa, voc&#234; precisa configurar a velocidade de sua porta serial para 38400 (ao contr&#225;rio de 115.200 baud para as outras placas). Todos os outros par&#226;metros continuam os mesmos (8 bits de dados, sem paridade, um stop bit).&lt;/p&gt;
+ &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; na placa MOD711:&lt;/h3&gt;
+ &lt;p&gt;Voc&#234; precisa do OpenOCD para fazer isso. Basta seguir as instru&#231;&#245;es do
+ nosso &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial OpenOCD&lt;/a&gt;. Na p&#225;gina do tutorial, voc&#234; tamb&#233;m encontrar&#225; links para os arquivos de configura&#231;&#227;o do OpenOCD que
+ estamos usando para gravar &lt;b&gt;eLua&lt;/b&gt; na placa MOD711. 
+ E &#233; isto ! &lt;b&gt;eLua&lt;/b&gt; est&#225; gravado na CPU. Agora &#233; s&#243; iniciar o emulador de terminal e se divertir, conforme descrito em &lt;a href=&quot;using.html&quot;&gt;using eLua&lt;/a&gt;.&lt;/p&gt;
+&lt;p&gt;&lt;b&gt;NOTA IMPORTANTE:&lt;/b&gt; Para esta placa, voc&#234; precisa configurar a velocidade de sua porta serial para 38400 (ao contr&#225;rio de 115.200 baud para a
+ maioria das outras placas). Todos os outros par&#226;metros continuam os mesmos (8 bits de dados, sem paridade, um stop bit).&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_str9.html
===================================================================
--- tags/pre0.6/doc/pt/installing_str9.html	2009-09-16 05:13:59 UTC (rev 449)
+++ tags/pre0.6/doc/pt/installing_str9.html	2009-09-17 03:21:09 UTC (rev 450)
@@ -1,6 +1,16 @@
 $$HEADER$$
 &lt;h3&gt;Instalando &lt;b&gt;eLua&lt;/b&gt; na fam&#237;lia de CPUs STR9 da ST&lt;/h3&gt;
- &lt;p&gt;Entre os MCUs baseados em ARM dispon&#237;veis atualmente, as CPUs &lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-str9.html">http://www.st.com/mcu/inchtml-pages-str9.html</A>&quot;&gt;STR9&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt; continua em alta devido a algumas caracter&#237;sticas &#250;nicas. Primeiro, seu n&#250;cleo &#233; um ARM966-E, e n&#227;o o popular n&#250;cleo ARM7TDMI. Isto, juntamente com alguns blocos de hardware habilmente escolhidos e embutidos no chip, permitem que a CPU rode a 96MHz, o que &#233; muito r&#225;pido para um MCU de prop&#243;sito geral. A CPU que estou usando (uma STR912FAW44) tamb&#233;m tem 512K de flash (e um outro banco de 32K de flash) e 96k de mem&#243;ria RAM interna, assim voc&#234; n&#227;o vai ficar sem mem&#243;ria t&#227;o cedo. &#201; acompanhada de uma biblioteca de apoio muito boa, e a ST fornece uma s&#233;rie de boas ferramentas para a STR9, incluindo uma ferramenta gr&#225;fica que voc&#234; pode usar para configurar o chip, exatamente como voc&#234; deseja. Quando eu escrevi para a ST sobre a &lt;b&gt;eLua&lt;/b&gt;, eles concordaram em me enviar uma &lt;a href=&quot;<A HREF="http://www!">http://www!</A>
 .hitex.com/str9-comstick/&quot;&gt;STR9-comStick&lt;/a&gt; para rodar &lt;b&gt;eLua&lt;/b&gt; nela. Muito obrigado pela ajuda de voces, mais uma vez. Esta &#233; a placa que eu vou usar neste tutorial.&lt;/p&gt;
+ &lt;p&gt;Entre os MCUs baseados em ARM dispon&#237;veis atualmente, as CPUs &lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-str9.html">http://www.st.com/mcu/inchtml-pages-str9.html</A>&quot;&gt;STR9&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt; continua em
+ alta, devido &#224; algumas caracter&#237;sticas &#250;nicas. 
+ Primeiro, seu n&#250;cleo &#233; um ARM966-E e n&#227;o o popular n&#250;cleo ARM7TDMI. 
+ Isto, juntamente com alguns blocos de hardware habilmente escolhidos e embutidos no chip, permite que a CPU rode a 96MHz, 
+ o que &#233; muito r&#225;pido para uma MCU de prop&#243;sito geral. 
+ A CPU que estamos usando (uma STR912FAW44) tamb&#233;m tem 512K de flash (e um outro banco de 32K de flash) e 96k de mem&#243;ria RAM
+ interna. Assim voc&#234; n&#227;o vai ficar sem mem&#243;ria t&#227;o cedo. A placa &#233; acompanhada de uma biblioteca de apoio muito boa e a 
+ ST fornece uma s&#233;rie de boas ferramentas para o STR9, incluindo uma ferramenta gr&#225;fica que voc&#234; pode usar para configurar o chip, 
+ exatamente como voc&#234; deseja. Gostar&#237;amos de agradecer especialmente &#224; ST, que nos enviou um 
+ &lt;a href=&quot;<A HREF="http://www.hitex.com/str9-comstick/">http://www.hitex.com/str9-comstick/</A>&quot;&gt;STR9-comStick&lt;/a&gt; para rodar &lt;b&gt;eLua&lt;/b&gt; nela. Muito obrigado pela ajuda de voces, mais uma vez. 
+ Esta &#233; a placa que vamos usar neste tutorial.&lt;/p&gt;
  &lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
  &lt;p&gt;Antes de voc&#234; come&#231;ar a usar &lt;b&gt;eLua&lt;/b&gt; na CPU STR912FAW44, certifique-se
  de que:&lt;/p&gt;
@@ -9,10 +19,17 @@
  &lt;li&gt;se voc&#234; estiver usando Windows, instalou o pacote de apoio STR9-comStick a partir do CD que acompanha a placa..&lt;/li&gt;
  &lt;li&gt;voc&#234; j&#225; tem o arquivo com a imagem de &lt;b&gt;eLua&lt;/b&gt; para a CPU STR912FAW44 (&lt;a href=&quot;building.html&quot;&gt;gerado&lt;/a&gt; ou &lt;a href=&quot;downloads.html&quot;&gt;baixado&lt;/a&gt;).&lt;/li&gt;
  &lt;/ul&gt;
- &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; na STR9-comStick&lt;/h3&gt;
- &lt;p&gt;Voc&#234; precisa OpenOCD para fazer isso. Basta seguir as instru&#231;&#245;es do meu &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial OpenOCD&lt;/a&gt;. Na p&#225;gina do tutorial voc&#234; tamb&#233;m encontrar&#225; links para os arquivos de configura&#231;&#227;o do OpenOCD que estou usando para gravar &lt;b&gt;eLua&lt;/b&gt; no comStick.&lt;/p&gt;
- &lt;p&gt;&lt;b&gt;NOTA IMPORTANTE:&lt;/b&gt; devido a algumas raz&#245;es desconhecidas (talvez relacionados com o conversor USB/JTAG on-board) meu comStick n&#227;o inicia a execu&#231;&#227;o do c&#243;digo da mem&#243;ria flash interna, depois de ter sido ligado via cabo USB (sequ&#234;ncia de reset com defeito?). Para superarmos isso, acesse um arquivo de configura&#231;&#227;o especial do OpenOCD na minha &lt;a href=&quot;tut_openocd.html&quot;&gt;p&#225;gina do tutorial&lt;/a&gt;. Chama-se comrst.cfg, e voc&#234; poder&#225; us&#225;-lo para reiniciar a sua comStick depois que ela for ligada.&lt;/p&gt;
- &lt;p&gt;&#201; isso! &lt;b&gt;eLua&lt;/b&gt; est&#225; gravado na CPU, inicie agora o seu emulador de terminal e divirta-se, como descrito em &lt;a href=&quot;using.html&quot;&gt;usando eLua&lt;/a&gt;.
+ &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; na STR9-comStick:&lt;/h3&gt;
+ &lt;p&gt;Voc&#234; precisa OpenOCD para fazer isso. Basta seguir as instru&#231;&#245;es do
+ nosso &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial OpenOCD&lt;/a&gt;. 
+ Na p&#225;gina do tutorial voc&#234; tamb&#233;m encontrar&#225; links para os arquivos de configura&#231;&#227;o do OpenOCD que
+ estamos usando para gravar &lt;b&gt;eLua&lt;/b&gt; no comStick.&lt;/p&gt;
+ &lt;p&gt;&lt;b&gt;NOTA IMPORTANTE:&lt;/b&gt; devido &#224; algumas raz&#245;es desconhecidas (talvez relacionados com o conversor USB/JTAG
+ on-board), nosso comStick n&#227;o inicia a execu&#231;&#227;o do c&#243;digo da mem&#243;ria flash
+ interna. Depois de ter sido ligado via cabo USB (sequ&#234;ncia de reset com defeito?). Para superarmos isso, acesse um arquivo de 
+ configura&#231;&#227;o especial do OpenOCD na nossa &lt;a href=&quot;tut_openocd.html&quot;&gt;p&#225;gina do tutorial&lt;/a&gt;. 
+ Chama-se comrst.cfg e voc&#234; poder&#225; us&#225;-lo para reiniciar a sua comStick depois que ela for ligada.&lt;/p&gt;
+ &lt;p&gt;&#201; isso! &lt;b&gt;eLua&lt;/b&gt; est&#225; gravado na CPU. Inicie agora o seu emulador de terminal e divirta-se, como descrito em &lt;a href=&quot;using.html&quot;&gt;usando eLua&lt;/a&gt;.
 &lt;/p&gt;
 $$FOOTER$$
 


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000405.html">[Elua-svn] r449 - in tags/pre0.6/doc: en pt
</A></li>
	<LI>Next message: <A HREF="000407.html">[Elua-svn] r451 - in tags/pre0.6/doc: . pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#406">[ date ]</a>
              <a href="thread.html#406">[ thread ]</a>
              <a href="subject.html#406">[ subject ]</a>
              <a href="author.html#406">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/elua-svn">More information about the eLua-svn
mailing list</a><br>
</body></html>
