<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Elua-svn] r449 - in tags/pre0.6/doc: en pt
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/elua-svn/2009-September/index.html" >
   <LINK REL="made" HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r449%20-%20in%20tags/pre0.6/doc%3A%20en%20pt&In-Reply-To=%3C200909160514.n8G5E81b012508%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000404.html">
   <LINK REL="Next"  HREF="000406.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Elua-svn] r449 - in tags/pre0.6/doc: en pt</H1>
    <B>dadosutter at BerliOS</B> 
    <A HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r449%20-%20in%20tags/pre0.6/doc%3A%20en%20pt&In-Reply-To=%3C200909160514.n8G5E81b012508%40sheep.berlios.de%3E"
       TITLE="[Elua-svn] r449 - in tags/pre0.6/doc: en pt">dadosutter at mail.berlios.de
       </A><BR>
    <I>Wed Sep 16 07:14:08 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000404.html">[Elua-svn] r448 - trunk/src/modules
</A></li>
        <LI>Next message: <A HREF="000406.html">[Elua-svn] r450 - tags/pre0.6/doc/pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#405">[ date ]</a>
              <a href="thread.html#405">[ thread ]</a>
              <a href="subject.html#405">[ subject ]</a>
              <a href="author.html#405">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: dadosutter
Date: 2009-09-16 07:13:59 +0200 (Wed, 16 Sep 2009)
New Revision: 449

Modified:
   tags/pre0.6/doc/en/comunity.html
   tags/pre0.6/doc/pt/comunity.html
   tags/pre0.6/doc/pt/installing_at91sam7x.html
   tags/pre0.6/doc/pt/installing_lpc2888.html
   tags/pre0.6/doc/pt/installing_stm32.html
   tags/pre0.6/doc/pt/installing_str7.html
   tags/pre0.6/doc/pt/installing_str9.html
Log:
More portuguese content
These files still need to be revised (help is welcome :)
Other minor fixes



Modified: tags/pre0.6/doc/en/comunity.html
===================================================================
--- tags/pre0.6/doc/en/comunity.html	2009-09-15 17:45:45 UTC (rev 448)
+++ tags/pre0.6/doc/en/comunity.html	2009-09-16 05:13:59 UTC (rev 449)
@@ -31,7 +31,7 @@
  &lt;li&gt;Raul Nunes - The fundamental support from PUC-Rio.&lt;/li&gt;
  &lt;li&gt;Roberto Ierusalimschy, Luiz Henrique Figueiredo, Waldemar Celles - for
  &lt;a href=&quot;<A HREF="http://www.lua.org">http://www.lua.org</A>&quot;&gt;Lua&lt;/a&gt; (!!! :)&lt;/li&gt;
- &lt;li&gt;T&#233;o Benjamin, Ives Cunha, Rafael Barmak - &lt;a href=&quot;<A HREF="http://www.giga.puc-rio.br/site/embedded/manfredo">http://www.giga.puc-rio.br/site/embedded/manfredo</A>&quot;&gt;Manfredo&lt;/a&gt;, a GPS guided robot, powered by eLua.&lt;/li&gt;
+ &lt;li&gt;T&#233;o Benjamin, Ives Cunha, Rafael Barmak - Pong, TetrIves, SpaceShip and &lt;a href=&quot;<A HREF="http://www.giga.puc-rio.br/site/embedded/manfredo">http://www.giga.puc-rio.br/site/embedded/manfredo</A>&quot;&gt;Manfredo&lt;/a&gt;, a GPS guided robot, powered by eLua.&lt;/li&gt;
  &lt;li&gt;Yuri Takhteyev and Ricardo Lourival Rosa - &lt;a href=&quot;<A HREF="http://sputnik.freewisdom.org/">http://sputnik.freewisdom.org/</A>&quot;&gt;Sputnik&lt;/a&gt; and site support&lt;/li&gt;
  &lt;li&gt;The whole comunity of users on our eLua list at &lt;a
  href=&quot;<A HREF="https://lists.berlios.de/mailman/listinfo/elua-dev">https://lists.berlios.de/mailman/listinfo/elua-dev</A>&quot;&gt;<A HREF="https://lists.berlios.de/mailman/listinfo/elua-dev&lt;/a">https://lists.berlios.de/mailman/listinfo/elua-dev&lt;/a</A>&gt;&lt;/li&gt;

Modified: tags/pre0.6/doc/pt/comunity.html
===================================================================
--- tags/pre0.6/doc/pt/comunity.html	2009-09-15 17:45:45 UTC (rev 448)
+++ tags/pre0.6/doc/pt/comunity.html	2009-09-16 05:13:59 UTC (rev 449)
@@ -34,7 +34,7 @@
  &lt;li&gt;Pedro Bittencourt - M&#243;dulo para display RIT OLED para LM3S, &lt;a href=&quot;<A HREF="http://code.google.com/p/vhews/">http://code.google.com/p/vhews/</A>&quot;&gt;VHeHS&lt;/a&gt;, Testes&lt;/li&gt;
  &lt;li&gt;Raul Nunes - Sustentabilidade e o apoio fundamental da PUC-Rio.&lt;/li&gt;
  &lt;li&gt;Roberto Ierusalimschy, Luiz Henrique Figueiredo e Waldemar Celles - por &lt;a href=&quot;<A HREF="http://www.lua.org">http://www.lua.org</A>&quot;&gt;Lua&lt;/a&gt; (!!! :)&lt;/li&gt;
- &lt;li&gt;T&#233;o Benjamin, Ives Cunha, Rafael Barmak - &lt;a href=&quot;<A HREF="http://www.giga.puc-rio.br/site/embedded/manfredo">http://www.giga.puc-rio.br/site/embedded/manfredo</A>&quot;&gt;Manfredo&lt;/a&gt;,
+ &lt;li&gt;T&#233;o Benjamin, Ives Cunha, Rafael Barmak - Pong, TetrIves, SpaceShip e &lt;a href=&quot;<A HREF="http://www.giga.puc-rio.br/site/embedded/manfredo">http://www.giga.puc-rio.br/site/embedded/manfredo</A>&quot;&gt;Manfredo&lt;/a&gt;,
  um rob&#244; aut&#244;nomo, com navega&#231;&#227;o baseada em GPS, controlado por
  &lt;strong&gt;eLua&lt;/strong&gt;.&lt;/li&gt;
  &lt;li&gt;Yuri Takhteyev and Ricardo Lourival Rosa - &lt;a href=&quot;<A HREF="http://sputnik.freewisdom.org/">http://sputnik.freewisdom.org/</A>&quot;&gt;Sputnik&lt;/a&gt;

Modified: tags/pre0.6/doc/pt/installing_at91sam7x.html
===================================================================
--- tags/pre0.6/doc/pt/installing_at91sam7x.html	2009-09-15 17:45:45 UTC (rev 448)
+++ tags/pre0.6/doc/pt/installing_at91sam7x.html	2009-09-16 05:13:59 UTC (rev 449)
@@ -1,47 +1,46 @@
 $$HEADER$$
-&lt;h3&gt;Using &lt;b&gt;eLua&lt;/b&gt; with the AT91SAM7X CPUs from Atmel&lt;/h3&gt;
- &lt;p&gt;&lt;a href=&quot;<A HREF="http://www.atmel.com">http://www.atmel.com</A>&quot;&gt;Atmel&lt;/a&gt; is a company that doesn't need any kind of introduction :) Their huge product range include some quite nice ARM7TDMI core implementations.
- Among them are the &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/Product_card.asp?part_id=3755">http://www.atmel.com/dyn/products/Product_card.asp?part_id=3755</A>&quot;&gt;AT91SAM7X256&lt;/a&gt; and
- &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/Product_card.asp?part_id=4104">http://www.atmel.com/dyn/products/Product_card.asp?part_id=4104</A>&quot;&gt;AT91SAM7X512&lt;/a&gt; CPUs. The only difference between them is the ammount of internal memory (256k Flash+64k RAM for
- AT91SAM7X256 vs. 512k Flash+128k RAM for AT91SAM7X512). Loaded with peripherals, and accompanied by a good support package, they make a perfect host for &lt;b&gt;eLua&lt;/b&gt;. For this tutorial
- I'm going to use the &lt;a href=&quot;<A HREF="http://www.olimex.com/dev/sam7-ex256.html">http://www.olimex.com/dev/sam7-ex256.html</A>&quot;&gt;SAM7-EX256&lt;/a&gt; development board from &lt;a href=&quot;<A HREF="http://www.olimex.com">http://www.olimex.com</A>&quot;&gt;Olimex&lt;/a&gt;. It's quite a 
- decent board, and also reasonably priced, although it lacks a proper documentation package in my oppinion. It is equipped with an AT91SAM7X256 CPU. As much as I'd like to get
- my hands on a board with a AT91SAM7X512 CPU, this didn't happen so far, so I'm going to stick with AT91SAM7X256. Of course, you can still try this tutorial if you have
- a different AT91SAM7X256 development board. Plus, the instructions should be quite similar for AT91SAM7X512 CPUs.
- &lt;/p&gt;
- &lt;h3&gt; Prerequisites&lt;/h3&gt; 
- &lt;p&gt;Before you'll be able to use &lt;b&gt;eLua&lt;/b&gt; on the AT91SAM7X256 CPU, make sure that:&lt;/p&gt;
+&lt;h3&gt;Usando &lt;b&gt;eLua&lt;/b&gt; com as CPUs AT91SAM7X da Atmel&lt;/h3&gt;
+
+&lt;p&gt;A &lt;a href=&quot;<A HREF="http://www.atmel.com">http://www.atmel.com</A>&quot;&gt;Atmel&lt;/a&gt; &#233; uma empresa que n&#227;o precisa de nenhum tipo de apresenta&#231;&#227;o:) 
+Sua enorme variedade de produtos, inclui algumas implementa&#231;&#245;es do n&#250;cleo do ARM7TDMI. 
+Entre elas est&#227;o as CPUs &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/Product_card.asp?part_id=3755">http://www.atmel.com/dyn/products/Product_card.asp?part_id=3755</A>&quot;&gt;AT91SAM7X256&lt;/a&gt; 
+e &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/Product_card.asp?part_id=4104">http://www.atmel.com/dyn/products/Product_card.asp?part_id=4104</A>&quot;&gt;AT91SAM7X512&lt;/a&gt;. 
+A &#250;nica diferen&#231;a entre elas &#233; a quantidade de mem&#243;ria interna (256k Flash RAM + 64k para a AT91SAM7X256 e 512k Flash RAM + 128k para a AT91SAM7X512). 
+Com muitos perif&#233;ricos e acompanhada por um aplicativo de apoio ao
+desenvolvimento, elas oferecem um &#243;timo hardware para &lt;b&gt;eLua&lt;/b&gt;. 
+Para este tutorial, vamos usar a placa de desenvolvimento &lt;a href=&quot;<A HREF="http://www.olimex.com/dev/sam7-ex256.html">http://www.olimex.com/dev/sam7-ex256.html</A>&quot;&gt;SAM7-EX256&lt;/a&gt; 
+da &lt;a href=&quot;<A HREF="http://www.olimex.com">http://www.olimex.com</A>&quot;&gt;Olimex&lt;/a&gt;. 
+Em nossa opini&#227;o, est&#225; &#233; realmente uma boa placa, com um pre&#231;o razo&#225;vel, mas que carece de um pacote de documenta&#231;&#227;o
+adequada. 
+&#201; equipada com uma CPU AT91SAM7X256. Gostaria muito de colocar as m&#227;os numa placa com a CPU AT91SAM7X512, como isso ainda n&#227;o aconteceu, vou ficar com a AT91SAM7X256
+por enquanto :)
+Certamente voc&#234; ainda poder&#225; usar este tutorial com uma placa diferente da AT91SAM7X256. 
+Al&#233;m disso, as instru&#231;&#245;es devem ser bastante semelhantes para CPUs AT91SAM7X512.&lt;/p&gt;
+ &lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
+ &lt;p&gt;Antes de voc&#234; usar &lt;b&gt;eLua&lt;/b&gt; com a CPU AT91SAM7X256, certifique-se que:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;you're using Windows. This isn't actually a strict requirement, it just makes life a bit easier. As the Atmel CPU is supported by the &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt; package, programming it from Linux is definitely possible, as OpenOCD runs equally well on Windows and Linux. However, since I'm forced to use Windows anyway because of the restrictions of
- some of my other development boards, I'm going to take advantage of this and cover the Atmel programming tool instead of OpenOCD. The advantage is that you don't need a JTAG &quot;dongle&quot;
- to program your board (which would be the case if you were using OpenOCD). The disadvantage, of course, is that the Atmel tool runs only on Windows. Plus, I personally find OpenOCD 
- tedious to use. If you still want to use it though, you might want to check the forementioned &lt;a href=&quot;<A HREF="http://www.olimex.com/dev/sam7-ex256.html">http://www.olimex.com/dev/sam7-ex256.html</A>&quot;&gt;Olimex page&lt;/a&gt;, they have some OpenOCD related links there.
- That said, from now on I'm going to assume that you use Windows. I'm using XP, Vista should work too.&lt;/li&gt;
- &lt;li&gt;you have installed the &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3883">http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3883</A>&quot;&gt;AT91 In-system Programmer (ISP)&lt;/a&gt; package from Atmel.&lt;/li&gt;
- &lt;li&gt;you already have your &lt;b&gt;eLua&lt;/b&gt; image for the AT91SAM7X256 CPU (&lt;a href=&quot;building.html&quot;&gt;built&lt;/a&gt; or &lt;a href=&quot;downloads.html&quot;&gt;downloaded&lt;/a&gt;).&lt;/li&gt;
+ &lt;li&gt;esteja usando Linux ou Windows. Na realidade n&#227;o &#233; um pr&#233;-requisito, s&#243; faz com que a vida fique mais f&#225;cil. J&#225; que a CPU &#233; suportada pelo aplicativo &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt;, program&#225;-la com o Linux &#233; perfeitamente poss&#237;vel, j&#225; que o OpenOCD roda tanto no Windows quanto no Linux. No entanto, devido a restri&#231;&#245;es de algumas das minhas placas de desenvolvimento, aproveito a situa&#231;&#227;o e fico com a ferramenta de programa&#231;&#227;o da Atmel, ao inv&#233;s do OpenOCD. A vantagem &#233; que voc&#234; n&#227;o precisa de um JTAG &quot;dongle&quot; para programar sua placa (que seria o caso se voc&#234; estivesse usando o OpenOCD). A desvantagem, claro, &#233; que a ferramenta Atmel &#233; executada apenas no Windows. Al&#233;m disso, eu pessoalmente acho o OpenOCD tedioso. Mesmo assim, se voc&#234; ainda quiser us&#225;-lo, veja a &lt;a href=&quot;<A HREF="http://www.olimex.com/dev/sam7-ex256.html">http://www.olimex.com/dev/sam7-ex256.html</A>&quot;&gt;p&#225;gina da Olimex&lt;/a&gt;, existem alguns links relacionados ao OpenOCD. Dito isto, a partir de agora assumo que !
 voc&#234; est&#225; usando o Windows. Uso o XP, o Vista deve funcionar tamb&#233;m.&lt;/li&gt;
+ &lt;li&gt;o aplicativo &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3883">http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3883</A>&quot;&gt;AT91 In-system Programmer (ISP)&lt;/a&gt; da Atmel.&lt;/li&gt;
+ &lt;li&gt;voc&#234; j&#225; tem sua imagem de &lt;b&gt;eLua&lt;/b&gt; para a CPU AT91SAM7X256 CPU (&lt;a href=&quot;building.html&quot;&gt;gerada&lt;/a&gt; ou &lt;a href=&quot;downloads.html&quot;&gt;baixada&lt;/a&gt;).&lt;/li&gt;
  &lt;/ul&gt;
- &lt;h3&gt;Programming eLua on the SAM7-EX256 board&lt;/h3&gt;
- &lt;p&gt;This involves some jumper tricks, but it's still easy enough to do. We'll need to play with four jumpers: the &quot;USB/EXT&quot; jumper (located to the right of the USB connector 
- from the bottom left part of the board in its close proximity), the &quot;ERASE&quot; jumper (located at the right of the &quot;UEXT&quot; header connector in the top-left 
- part of the board, right ahead the quartz), and the block of two jumpers located right under the &quot;RS232&quot; connector on the board (the one that is adjacent to the Ethernet connector on its right side,
- &lt;b&gt;NOT&lt;/b&gt; the one labeled &quot;CAN&quot; that is closer to the right edge of the board). &lt;/p&gt;
+ &lt;h3&gt;Programando eLua na placa SAM7-EX256&lt;/h3&gt;
+&lt;p&gt;Isto envolve alguns truques com jumpers, mas ainda assim, &#233; muito f&#225;cil de fazer. Usaremos quatro jumpers: o jumper &quot;USB/EXT&quot; (localizado &#224; direita do conector USB na parte inferior esquerda da placa), o jumper &quot;ERASE&quot; (localizado no lado direito do conector &quot;cabe&#231;alho Uext&quot; na parte superior esquerda da mesa, em frente a quartzo), e uma dupla de jumpers &quot;RS232&quot; (localizados ao lado do conector Ethernet em seu lado direito, e &lt;b&gt;N&#195;O&lt;/b&gt; a um chamado &quot;CAN&quot;, que est&#225; mais pr&#243;ximo da borda direita da placa).&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;connect your board to your PC using a suitable USB cable.&lt;/li&gt; 
- &lt;li&gt;if you have a terminal emulation program connected to the board, close it (or at least disconnect it from its port).&lt;/li&gt;
- &lt;li&gt;make sure that the the block of two jumpers mentioned before is set to positions &quot;RXD0&quot; and &quot;TXD0&quot; respectively, &lt;b&gt;NOT&lt;/b&gt; &quot;DRXD&quot; and &quot;DTXD&quot;.&lt;/li&gt;
- &lt;li&gt;make sure that the &quot;USB/EXT&quot; connector is set to &quot;USB&quot; (position 1-2) and that the &quot;ERASE&quot; jumper is disconnected.&lt;/li&gt;
- &lt;li&gt;connect the &quot;ERASE&quot; jumper and wait one second or more.&lt;/li&gt;
- &lt;li&gt;disconnect the &quot;USB/EXT&quot; jumper completely, then disconnect the &quot;ERASE&quot; jumper too.&lt;/li&gt;
- &lt;li&gt;connect the &quot;USB/EXT&quot; jumper back in the &quot;USB&quot; position (1-2).&lt;/li&gt;
- &lt;li&gt;fire up the Atmel programming tool. If you haven't installed your board yet, you'll be asked to do so at this point.&lt;/li&gt;
- &lt;li&gt;select &quot;\usb\ARMx&quot; as the connection (for me it's \usb\ARM0) and &quot;AT91SAM7X256-EK&quot; as the board.&lt;/li&gt;
- &lt;li&gt;select the &quot;Flash&quot; tab from the middle tab of the window.&lt;/li&gt;
- &lt;li&gt;in the &quot;Send file name&quot; box select your &lt;b&gt;eLua&lt;/b&gt; bin file that you got from the compilation step and then press &quot;Send File&quot;.&lt;/li&gt;
- &lt;li&gt;wait for the file to be sent and answer &quot;No&quot; to the &quot;Lock region(s)&quot; dialog.&lt;/li&gt;
- &lt;li&gt;in the window section below (&quot;Scripts&quot;) select &quot;Boot from Flash (GPNVM2)&quot; then press &quot;Execute&quot;.&lt;/li&gt;
- &lt;li&gt;exit the application.&lt;/li&gt;
+  &lt;li&gt;Ligue sua placa a um PC usando um cabo USB.&lt;/li&gt;
+  &lt;li&gt;Se voc&#234; tem um programa de emula&#231;&#227;o de terminal conectado &#224; placa, feche-o (ou, pelo menos, desconecte-o da porta).&lt;/li&gt;
+  &lt;li&gt;Certifique-se que o conjumto de dois jumpers mencionados antes est&#227;o configurados nas  posi&#231;&#245;es &quot;RXD0&quot; e &quot;TXD0&quot;, respectivamente, n&#227;o &quot;DRXD&quot; e &quot;DTXD&quot;.&lt;/li&gt;
+  &lt;li&gt;Certifique-se que o conector &quot;USB/EXT&quot; esteja configurado como &quot;USB&quot; (posi&#231;&#227;o 1-2) e que o jumper &quot;ERASE&quot; est&#225; desconectado.&lt;/li&gt;
+  &lt;li&gt;Ligue o jumper &quot;ERASE&quot; e esperar um segundo ou mais.&lt;/li&gt;
+  &lt;li&gt;Desligue o jumper &quot;USB/EXT&quot; completamente, em seguida, desligue o jumper &quot;ERASE&quot; tamb&#233;m.&lt;/li&gt;
+  &lt;li&gt;Ligue o jumper &quot;USB/EXT&quot; novamente na posi&#231;&#227;o &quot;USB&quot; (1-2).&lt;/li&gt;
+  &lt;li&gt;Inicie a aplica&#231;&#227;o da Atmel. Caso, voc&#234; n&#227;o tinha instalado a sua placa ainda, voc&#234; ser&#225; solicitado a faz&#234;-lo neste momento.&lt;/li&gt;
+  &lt;li&gt;Selecione &quot;\usb\ARMx&quot;, como sua conex&#227;o (para mim &#233; \usb\ARM0) e &quot;AT91SAM7X256-EK&quot;, como a placa.&lt;/li&gt;
+  &lt;li&gt;Selecione a guia &quot;Flash&quot; do meio da janela.&lt;/li&gt;
+  &lt;li&gt;No campo &quot;Send File Name&quot; selecione o arquivo bin&#225;rio de &lt;b&gt;eLua&lt;/b&gt; (.bin), que voc&#234; gerou a partir da compila&#231;&#227;o e clique no bot&#227;o &quot;Send File&quot;.&lt;/li&gt;
+  &lt;li&gt;Aguarde o arquivo ser enviado e responda &quot;No&quot; para a solicita&#231;&#227;o de &quot;Lock region(s)&quot;.&lt;/li&gt;
+  &lt;li&gt;Abaixo de (&quot;Scripts&quot;), selecione o &quot;Boot from Flash (GPNVM2)&quot; e pressione &quot;Execute&quot;.&lt;/li&gt;
+  &lt;li&gt;Saia da aplica&#231;&#227;o.&lt;/li&gt;
  &lt;/ul&gt;
- &lt;p&gt;That's it! A bit tricky, but &lt;b&gt;eLua&lt;/b&gt; is now programmed in the CPU, so you can start your terminal emulator and enjoy it, as described in &lt;a href=&quot;using.html&quot;&gt;using eLua&lt;/a&gt;. 
- &lt;/p&gt;
+ &lt;p&gt;Pronto! Um pouco complicado, mas &lt;b&gt;eLua&lt;/b&gt; est&#225; agora programada na CPU, agora voc&#234; pode iniciar o seu emulador de terminal e se divertir, conforme descrito em &lt;a href=&quot;using.html&quot;&gt;usandp eLua&lt;/a&gt;.&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_lpc2888.html
===================================================================
--- tags/pre0.6/doc/pt/installing_lpc2888.html	2009-09-15 17:45:45 UTC (rev 448)
+++ tags/pre0.6/doc/pt/installing_lpc2888.html	2009-09-16 05:13:59 UTC (rev 449)
@@ -1,36 +1,20 @@
 $$HEADER$$
-&lt;h3&gt;Installing &lt;b&gt;eLua&lt;/b&gt; with the LPC2888 CPU from NXP&lt;/h3&gt;
-&lt;p&gt;The &lt;a href=&quot;<A HREF="http://www.standardics.nxp.com/products/lpc2000/all/~LPC2888/">http://www.standardics.nxp.com/products/lpc2000/all/~LPC2888/</A>&quot;&gt;LPC2888 CPU&lt;/a&gt; from &lt;a href=&quot;<A HREF="http://www.nxp.com">http://www.nxp.com</A>&quot;&gt;NXP&lt;/a&gt; packs some interesting features: huge internal 1Mbyte flash memory,
-  on-chip USB 2.0 high speed interface, and the most complex (by far) clocking network that I've ever seen on an ATM7TDMI chip. Also, it implements the USB DFU (Device Firmware Update) profile over
-  its USB interface, so it's quite easy to program it in-circuit. I'm using the &lt;a href=&quot;<A HREF="http://www.olimex.com/dev/lpc-h2888.html">http://www.olimex.com/dev/lpc-h2888.html</A>&quot;&gt;Olimex LPC-H2888&lt;/a&gt; development board built around this chip, which packs
-  32MBytes of external SDRAM and also 2MBytes of external flash, which is more than enough for my needs. However, it does have its fair share of downsides. For starters, its support package (from NXP) is very poot when
-  compared to other targets on which &lt;b&gt;eLua&lt;/b&gt; runs. You don't even get drivers for all your peripherals, just a a few (quite incomplete) examples. Its datasheet could be much more explit at times, especially when
-  referring to the clocking section (which is quite complicated). On my board, the DFU download mode (firmware upgrade via USB) stopped working out of the blue, without any apparent reasons, and I was unable to
-  use DFU on the chip since then, I had to resort to using OpenOCD (and come up with a configuration file, since it was impossible to find one for LPC2888). The CPU itself has a very interesting limitation: because of a sillicon 
-  error, it's impossible to run Thumb code from the on-chip flash, you can only run regular ARM code (?!). Also, the board that I got from Olimex completely ignores the fact that this chip can run in DFU mode (it doesn't include 
-  any kind of jumper and/or switch to enable this mode), so I had to build a support board for it. Which is something I had to do also because the board doesn't export a RS232 interface, I had to build one around a MAX232 chip. 
-  All in all, my experience with this chip (and with the Olimex board) wasn't that pleasant, but this doesn't change the fact that the LPC-H2888 is one of the most powerful (resource-wise) boards on which &lt;b&gt;eLua&lt;/b&gt; runs.    
- &lt;/p&gt;
- &lt;h3&gt;Prerequisites&lt;/h3&gt; 
- &lt;p&gt;Before you'll be able to use &lt;b&gt;eLua&lt;/b&gt; on the LPC2888 CPU, make sure that:&lt;/p&gt;
+&lt;h3&gt;Instalando &lt;b&gt;eLua&lt;/b&gt; com o processador LPC2888 da NXP&lt;/h3&gt;
+&lt;p&gt;O processador &lt;a href=&quot;<A HREF="http://www.standardics.nxp.com/products/lpc2000/all/~LPC2888/">http://www.standardics.nxp.com/products/lpc2000/all/~LPC2888/</A>&quot;&gt;LPC2888&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.nxp.com">http://www.nxp.com</A>&quot;&gt;NXP&lt;/a&gt; possui algumas caracter&#237;sticas interessantes: uma enorme mem&#243;ria flash interna de 1Mbyte, USB 2.0 on-chip de alta velocidade e o mais complexo (de longe) clock de rede que eu j&#225; vi em um chip ATM7TDMI. Al&#233;m disso, implementa o USB DFU (Device Firmware Update) atrav&#233;s de sua interface USB, por isso fica bastante f&#225;cil de program&#225;-lo direto no hardware. Estou usando a placa de desenvolvimento &lt;a href=&quot;<A HREF="http://www.olimex.com/dev/lpc-h2888.html">http://www.olimex.com/dev/lpc-h2888.html</A>&quot;&gt;Olimex LPC-H2888&lt;/a&gt; baseada nesse processaor, que vem com 32MBytes de SDRAM externo e tamb&#233;m 2Mbytes de flash externo, o que &#233; mais que suficiente para minhas necessidades. No entanto, existem algumas desvantagens. Para come&#231;ar, seu aplicativo de suporte (da Panasonic) &#233; muito fraco quando comparado a outros concorrentes que aceitam &lt;b&gt;eLua&lt;/b&gt;. N&#227;o possui nem mesmo todos os drivers, so!
 mente uns poucos, e bastante imcompletos, exemplos. O esquema do processador poderia ser mais detalhado, especialmente quando se refere a clock (que &#233; bastante complicado). Na minha placa, a atualiza&#231;&#227;o do firmware via USB (DFU download mode) parou de funcionar de repente, sem qualquer raz&#227;o aparente, e n&#227;o consegui usar mais a DFU no chip, desde ent&#227;o, tive que recorrer ao uso do OpenOCD (e preparar um arquivo de configura&#231;&#227;o, j&#225; que era imposs&#237;vel encontrar um para LPC2888). A CPU em si tem uma limita&#231;&#227;o muito interessante: por causa de um erro estrutural, &#233; imposs&#237;vel executar c&#243;digo Thumb da mem&#243;ria flash on-chip, s&#243; &#233; poss&#237;vel executar c&#243;digo ARM comum (?!). Al&#233;m disso, a placa que tenho da Olimex ignora completamente o fato de que, esse chip &#233; capaz de rodar no modo DFU (a placa n&#227;o inclui nenhum tipo de jumper e/ou switch para habilitar este modo), logo, tive que construir uma placa complementar. Era algo que j&#225; tinha que fazer mesmo, pois a m!
 inha placa tamb&#233;m n&#227;o possui uma interface RS232, que constr!
 ui basea
da no chip MAX232. Depois de tudo isso, concluo que minha experi&#234;ncia com este chip (e com a placa Olimex) n&#227;o foi t&#227;o agrad&#225;vel assim, mas isso n&#227;o muda o fato de que o LPC-H2888 &#233; uma das mais poderosas placas em que &lt;b&gt;eLua&lt;/b&gt; pode ser executada.&lt;/p&gt;
+ &lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
+ &lt;p&gt;Antes de utilizar &lt;b&gt;eLua&lt;/b&gt; na CPU LPC2888, certifique-se de que:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;if you're going to use DFU for firmware programming, you'll need Windows (although I heard reports of Linux programs that can program this chip in DFU mode, but I won't cover them here). If you're going to use OpenOCD, Linux, Windows, 
- or any other OS that has support for &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt; will do. In this case, you might want to have a look at my &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD tutorial&lt;/a&gt; before continuing.&lt;/li&gt;
- &lt;li&gt;also, if you're going to use DFU, you'll need a way to boot the chip in DFU firmware upgrade mode. This is done by pulling up (tie to VCC) the P2.3 pin at startup. On my board I included a switch for this. Press the switch, press RESET
- while holding the switch pressed, then release the switch. You chip is now in DFU mode.&lt;/li&gt;
- &lt;li&gt;if you're using DFU, you have installed the LPC2888 flash programming utility from &lt;a href=&quot;<A HREF="http://www.standardics.nxp.com/support/documents/microcontrollers/zip/flash.utility.mass.dfu.lpc2888.zip">http://www.standardics.nxp.com/support/documents/microcontrollers/zip/flash.utility.mass.dfu.lpc2888.zip</A>&quot;&gt;here&lt;/a&gt; (the package also
- contains the Windows DFU drivers).&lt;/li&gt;
- &lt;li&gt;if you're using OpenOCD, you have followed the instructions from my &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD&lt;/a&gt; tutorial.&lt;/li&gt;
- &lt;li&gt;you already have your &lt;b&gt;eLua&lt;/b&gt; image for the LPC2888 CPU (&lt;a href=&quot;building.html&quot;&gt;built&lt;/a&gt; or &lt;a href=&quot;downloads.html&quot;&gt;downloaded&lt;/a&gt;).&lt;/li&gt;
+  &lt;li&gt;se voc&#234; vai usar DFU para a programa&#231;&#227;o do firmware, voc&#234; precisa do Windows (embora eu tenha ouvido relatos de programas Linux que podem programar o chip no modo DFU, n&#227;o vou coment&#225;-los aqui). Se voc&#234; pretende utilizar OpenOCD no Linux, Windows, ou qualquer outro sistema operacional que tem suporte para &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt;, talvez queira dar uma olhada no &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial do OpenOCD&lt;/a&gt; antes de continuar.&lt;/li&gt;
+  &lt;li&gt;se voc&#234; vai usar DFU, precisar&#225; de uma forma de inicializar o chip no modo DFU para atualiza&#231;&#227;o do firmware. Isso &#233; feito, puxando para cima o pino P2.3 (ligado ao VCC) na inicializa&#231;&#227;o. Na minha placa, inclu&#237; um switch para isso. Pressione o switch, pressione RESET enquanto mant&#233;m o switch pressionado, solte o switch. Voc&#234; chip est&#225; agora em modo DFU.&lt;/li&gt;
+  &lt;li&gt;Se voc&#234; estiver usando DFU, instale o utilit&#225;rio de programa&#231;&#227;o de flash do LPC2888, que pode ser encontrado &lt;a href=&quot;<A HREF="http://www.standardics.nxp.com/support/documents/microcontrollers/zip/flash.utility.mass.dfu.lpc2888.zip">http://www.standardics.nxp.com/support/documents/microcontrollers/zip/flash.utility.mass.dfu.lpc2888.zip</A>&quot;&gt;aqui&lt;/a&gt; (o pacote cont&#233;m os drivers DFU para Windows).&lt;/li&gt;
+  &lt;li&gt;se voc&#234; estiver usando OpenOCD, siga as instru&#231;&#245;es do meu tutorial OpenOCD.&lt;/li&gt;
+  &lt;li&gt;voc&#234; j&#225; tem o arquivo com a imagem &lt;b&gt;eLua&lt;/b&gt; para a CPU LPC2888 (&lt;a href=&quot;building.html&quot;&gt;gerada&lt;/a&gt; or &lt;a href=&quot;downloads.html&quot;&gt;baixada&lt;/a&gt;)..&lt;/li&gt;
  &lt;/ul&gt;
- &lt;h3&gt;Burning &lt;b&gt;eLua&lt;/b&gt; to the LPC2888 using the DFU tool from NXP&lt;/h3&gt;
- &lt;p&gt;The DFU flashing application doesn't work directly on the .bin files you get after building &lt;b&gt;eLua&lt;/b&gt;, you need to run them though NXP's &quot;hostcrypt&quot; program (which is part of the LPC2888 DFU package). After you have your &lt;b&gt;eLua&lt;/b&gt; .bin file,
- do this from a Windows command prompt (make sure that hostcryptv2.exe is in the path):&lt;/p&gt;
- &lt;div class=&quot;code&quot;&gt;&lt;pre&gt;C:&gt; hostcryptv2 elua_lua_lpc2888.bin elua.ebn -K0 -F0&lt;/pre&gt;&lt;/div&gt;
- &lt;p&gt;As a result, you'll have a new file (&lt;i&gt;elua.ebn&lt;/i&gt;). Now boot your chip in DFU firmware upgrade mode (see above) and use the DFU utility (&lt;i&gt;MassDFUApplication.exe&lt;/i&gt;) to load &lt;i&gt;elua.ebn&lt;/i&gt; into your chip (the instructions on
- using MassDFUApplication are in a PDF file that's included in the LPC2888 DFU package). Reset the board and enjoy.
- &lt;/p&gt;
- &lt;h3&gt;Burning &lt;b&gt;eLua&lt;/b&gt; to the LPC2888 using OpenOCD&lt;/h3&gt;
- &lt;p&gt;If you're as lucky as me and your board refuses to use DFU anymore, follow my &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD tutorial&lt;/a&gt; to burn your image using OpenOCD.&lt;/p&gt;
+ &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; no LPC2888 usando a ferramenta DFU da NXP&lt;/h3&gt;
+ &lt;p&gt;O software DFU para grava&#231;&#227;o em mem&#243;ria Flash n&#227;o trabalha diretamente nos arquivos bin&#225;rios que voc&#234; obteve ap&#243;s ter gerado &lt;b&gt;eLua&lt;/b&gt;, &#233; preciso execut&#225;-los atrav&#233;s do programa &quot;hostcrypt&quot; da NXP (que faz parte do pacote LPC2888 DFU). Depois de j&#225; ter gerado o seu arquivo bin&#225;rio de &lt;b&gt;eLua&lt;/b&gt;, execute os seguintes comandos a partir do prompt do Windows (certifique-se que hostcryptv2.exe est&#225; definido no path):&lt;/p&gt;
+&lt;div class=&quot;code&quot;&gt;&lt;pre&gt;C:&gt; hostcryptv2 elua_lua_lpc2888.bin elua.ebn -K0 -F0&lt;/pre&gt;&lt;/div&gt;
+&lt;p&gt;Como resultado, voc&#234; ter&#225; um novo arquivo (&lt;i&gt;elua.ebn&lt;/i&gt;). Agora, inicialize seu chip no modo DFU (veja acima) e use o utilit&#225;rio DFU (&lt;i&gt;MassDFUApplication.exe&lt;/i&gt;) para carregar &lt;i&gt;elua.ebn&lt;/i&gt; em seu chip (as instru&#231;&#245;es sobre como usar o MassDFUApplication est&#227;o em um arquivo PDF que est&#225; inclu&#237;do no pacote de LPC2888 DFU). Reinicie a placa e divirta-se.&lt;/p&gt;
+ &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; no LPC2888 usando o OpenOCD&lt;/h3&gt;
+&lt;p&gt;Se a sua sorte est&#225; como a minha, e sua placa se recusa a funcionar no modo DFU, siga este &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial do OpenOCD&lt;/a&gt; para gravar sua imagem usando OpenOCD.&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_stm32.html
===================================================================
--- tags/pre0.6/doc/pt/installing_stm32.html	2009-09-15 17:45:45 UTC (rev 448)
+++ tags/pre0.6/doc/pt/installing_stm32.html	2009-09-16 05:13:59 UTC (rev 449)
@@ -1,41 +1,36 @@
 $$HEADER$$
-&lt;h3&gt;Using &lt;b&gt;eLua&lt;/b&gt; with the STM32 CPUs from ST&lt;/h3&gt;
- &lt;p&gt;The &lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-stm32.html">http://www.st.com/mcu/inchtml-pages-stm32.html</A>&quot;&gt;STM32 family&lt;/a&gt; of MCUs from 
- &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt; is a line of Cortex-M3 based chips with a lot of neat features, including (but not limited to) high
- amounts of on-chip Flash/RAM (up to 512k Flash and 64k RAM), external memory controller that covers (P)SRAM, NAND Flash and NOR flash, integrated ADC and
- DACs, advanced timers and many others. They also feature an integrated serial boot loader, so it's extremely easy to program them from anything that has
- a serial port. ST provides a tool that can be used to download a program to the STM32 using this serial bootloader, but it only works in Windows. Their
- bootloader protocol is documented in a separate application note though, so one can easily write a programming application for any other OS.&lt;/p&gt;
- &lt;p&gt;&lt;b&gt;eLua&lt;/b&gt; currently works on two STM32F103 variants of the STM32 family, specifically on these boards:
- &lt;a href=&quot;<A HREF="http://www.st.com/mcu/contentid-100-110-STM3210E_EVAL.html">http://www.st.com/mcu/contentid-100-110-STM3210E_EVAL.html</A>&quot;&gt;the STM3210E-EVAL&lt;/a&gt; from 
- &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt; and the 
- &lt;a href=&quot;<A HREF="http://www.futurlec.com/ET-STM32_Stamp.shtml">http://www.futurlec.com/ET-STM32_Stamp.shtml</A>&quot;&gt;ETM-STM32 stamp&lt;/a&gt; 
- from &lt;a href=&quot;<A HREF="http://www.futurlec.com">http://www.futurlec.com</A>&quot;&gt;Futurlec&lt;/a&gt;. Instruction for installing &lt;b&gt;eLua&lt;/b&gt; on each of them are provided below.
- &lt;/p&gt;
- &lt;h3&gt; Prerequisites&lt;/h3&gt; 
- &lt;p&gt;Before you'll be able to use &lt;b&gt;eLua&lt;/b&gt; on the STM32F103 CPU, make sure that:&lt;/p&gt;
+&lt;h3&gt;Usando &lt;b&gt;eLua&lt;/b&gt; com as CPUs STM32 da ST&lt;/h3&gt;
+ &lt;p&gt;A &lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-stm32.html">http://www.st.com/mcu/inchtml-pages-stm32.html</A>&quot;&gt;fam&#237;lia STM32&lt;/a&gt; de MCUs da &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt; &#233; uma linha de Cortex-M3 baseada em chips com um monte de recursos, incluindo (mas n&#227;o limitado a) bastante mem&#243;ria Flash/RAM on-chip (at&#233; 512k Flash e 64k RAM), controlador de mem&#243;rias externas incluindo as (P)SRAM, NAND Flash e NOR Flash, ADC e DAC integrados, temporizadores avan&#231;ados e muitos outros. Eles tamb&#233;m possuem um carregador de boot serial integrado (um bootloader), por isso &#233; extremamente f&#225;cil de program&#225;-los a partir de um dispositivo que possua uma porta serial. A ST fornece uma ferramenta de suporte que pode ser usada para baixar um programa para o STM32 usando este bootloader, mas s&#243; funciona no Windows. O protocolo desse bootloader est&#225; documentado em uma nota separada, logo, qualquer um poder&#225; facilmente escrever um aplicativo para qualquer outro sistema operacional.&lt;/p&gt;
+  &lt;p&gt;&lt;b&gt;eLua&lt;/b&gt; funciona atualmente em duas variantes do STM32F103 da fam&#237;lia STM32, especificamente para essas placas:
+ &lt;a href=&quot;<A HREF="http://www.st.com/mcu/contentid-100-110-STM3210E_EVAL.html">http://www.st.com/mcu/contentid-100-110-STM3210E_EVAL.html</A>&quot;&gt;a STM3210E-EVAL&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt; e a 
+ &lt;a href=&quot;<A HREF="http://www.futurlec.com/ET-STM32_Stamp.shtml">http://www.futurlec.com/ET-STM32_Stamp.shtml</A>&quot;&gt;ETM-STM32 stamp&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.futurlec.com">http://www.futurlec.com</A>&quot;&gt;Futurlec&lt;/a&gt;. Instru&#231;&#245;es para a instala&#231;&#227;o de &lt;b&gt;eLua&lt;/b&gt; em cada uma dessas placas &#233; apresentado mais abaixo.&lt;/p&gt;
+ &lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
+ &lt;p&gt;Antes de come&#231;ar a usar &lt;b&gt;eLua&lt;/b&gt; com a CPU STM32F103, certifique-se
+ de que:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;you're using Windows. As already explained, the software provided by ST for serial firmware downloading works only under Windows. It's quite likely
- that similar tools for Linux and other operating systems already exist or will be available shortly.&lt;/li&gt;
- &lt;li&gt;you have installed the &quot;Flash loader demonstrator&quot; from &lt;a href=&quot;<A HREF="http://www.st.com/mcu/modules.php?name=mcu&amp;amp;file=familiesdocs&amp;amp;FAM=110">http://www.st.com/mcu/modules.php?name=mcu&amp;file=familiesdocs&amp;FAM=110</A>&quot;&gt;
-this page&lt;/a&gt; (look for it in the &quot;Software - PC&quot; section).&lt;/li&gt;
- &lt;li&gt;you already have your &lt;b&gt;eLua&lt;/b&gt; image for the STM32F103 CPU (&lt;a href=&quot;building.html&quot;&gt;built&lt;/a&gt; or &lt;a href=&quot;downloads.html&quot;&gt;downloaded&lt;/a&gt;).&lt;/li&gt;
+ &lt;li&gt;voc&#234; est&#225; usando Windows. Como j&#225; foi dito antes, o software fornecido pela ST para baixar o firmware via serial funciona apenas no Windows. &#201; prov&#225;vel que j&#225; existam ferramentas similares para a utiliza&#231;&#227;p com Linux e outros sistemas operacionais, ou que venham a ficar dispon&#237;veis brevemente.&lt;/li&gt;
+ &lt;li&gt;voc&#234; instalou o &quot;demonstrador Flash loader&quot; &lt;a href=&quot;<A HREF="http://www.st.com/mcu/modules.php?name=mcu&amp;amp;file=familiesdocs&amp;amp;FAM=110">http://www.st.com/mcu/modules.php?name=mcu&amp;file=familiesdocs&amp;FAM=110</A>&quot;&gt;
+desta p&#225;gina&lt;/a&gt; (procure-o na se&#231;&#227;o &quot;Software - PC&quot;).&lt;/li&gt;
+ &lt;li&gt;voc&#234; j&#225; tem o arquivo com a imagem de &lt;b&gt;eLua&lt;/b&gt; para a CPU STM32F103 (&lt;a href=&quot;building.html&quot;&gt;gerado&lt;/a&gt; ou &lt;a href=&quot;downloads.html&quot;&gt;baixado&lt;/a&gt;).&lt;/li&gt;
  &lt;/ul&gt;
- &lt;h3&gt;Programming eLUa on the STM3210E-EVAL board&lt;/h3&gt;
+
+ &lt;h3&gt;Gravando eLua na placa STM3210E-EVAL&lt;/h3&gt;
  &lt;p&gt;##TODO&lt;/p&gt;
- &lt;h3&gt;Programming eLua on the ET-STM32 stamp&lt;/h3&gt;
- &lt;p&gt;Follow the steps below to install &lt;b&gt;eLua&lt;/b&gt; on your ET-STM32 stamp:&lt;/p&gt;
+ &lt;h3&gt;Gravando eLua na placa ET-STM32 stamp&lt;/h3&gt;
+ &lt;p&gt;Siga os passos abaixo para instalar &lt;b&gt;eLua&lt;/b&gt; na sua ET-STM32 stamp:&lt;/p&gt;
+
  &lt;ul&gt;
- &lt;li&gt;connect the board to one of your PC serial ports using the provided serial cable.&lt;/li&gt;
- &lt;li&gt;put the BOOT1 jumper on your board in the ISP position (it should come like that from the factory, and must likely you won't need to change this).&lt;/li&gt; 
- &lt;li&gt;press on the BOOT0 switch. The green &quot;BOOT0=1&quot; LED should light up.&lt;/li&gt;
- &lt;li&gt;reset the board by pressing on the RESET button.&lt;/li&gt;
- &lt;li&gt;start the ST Flash loader demonstrator. Choose your serial port in the first screen, don't change the communication parameters (57600 8E1) and press &quot;Next&quot; 3 times.&lt;/li&gt;
- &lt;li&gt;select the &quot;Download to device&quot; radio button, then choose your &lt;b&gt;eLua&lt;/b&gt; image file and hit &quot;Next&quot;.&lt;/li&gt;
- &lt;li&gt;wait until programming is over and press &quot;Finish&quot;.&lt;/li&gt;
- &lt;li&gt;press on the BOOT0 switch again.&lt;/li&gt;
- &lt;li&gt;reset the board by pressing the RESET button again.&lt;/li&gt;
+ &lt;li&gt;conecte a placa em uma das portas seriais de seu computador com um cabo serial fornecido pelo fabricante.&lt;/li&gt;
+ &lt;li&gt;na placa, coloque o jumper BOOT1 para a posi&#231;&#227;o ISP (esta configura&#231;&#227;o j&#225; deve vir assim de f&#225;brica e provavelmente n&#227;o precisar&#225; ser alterada).&lt;/li&gt; 
+ &lt;li&gt;pressione o switch BOOT0. O LED verde &quot;BOOT0=1&quot; deve acender.&lt;/li&gt;
+ &lt;li&gt;reinicie a placa pressionando o bot&#227;o RESET.&lt;/li&gt;
+ &lt;li&gt;execute o programa ST Flash Loader. Selecione a sua porta serial na primeira tela, n&#227;o altere os par&#226;metros de comunica&#231;&#227;o (57600 8E1) e pressione &quot;Next&quot; 3 vezes.&lt;/li&gt;
+ &lt;li&gt;selecione o &quot;Download to device&quot;, escolha o arquivo imagem de &lt;b&gt;eLua&lt;/b&gt; e aperte &quot;Next&quot;.&lt;/li&gt;
+ &lt;li&gt;aguarde at&#233; a grava&#231;&#227;o terminar e ent&#227;o pressiona &quot;Finish&quot;.&lt;/li&gt;
+ &lt;li&gt;pressione novamente o switch BOOT0.&lt;/li&gt;
+ &lt;li&gt;reinicie novamente a placa pressionando o bot&#227;o RESET.&lt;/li&gt;
  &lt;/ul&gt;
- &lt;p&gt;Now you have &lt;b&gt;eLua&lt;/b&gt; installed on your board, and you can choose the same port you used for programming as a general purpose serial port for &lt;b&gt;eLua&lt;/b&gt;.&lt;/p&gt;
+
+ &lt;p&gt;A partir de agora voc&#234; est&#225; com &lt;b&gt;eLua&lt;/b&gt; instalada em sua placa, e pode escolher a mesma porta que utilizou para a grava&#231;&#227;o acima como uma porta comum para seu uso com  &lt;b&gt;eLua&lt;/b&gt;.&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_str7.html
===================================================================
--- tags/pre0.6/doc/pt/installing_str7.html	2009-09-15 17:45:45 UTC (rev 448)
+++ tags/pre0.6/doc/pt/installing_str7.html	2009-09-16 05:13:59 UTC (rev 449)
@@ -1,17 +1,14 @@
 $$HEADER$$
-&lt;h3&gt;Installing &lt;b&gt;eLua&lt;/b&gt; on the STR7 CPU family from ST&lt;/h3&gt;
- &lt;p&gt;&lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-str7.html">http://www.st.com/mcu/inchtml-pages-str7.html</A>&quot;&gt;STR7&lt;/a&gt; is a family of ATM7TDMI based CPUs from &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt;. They are small, low power MCUs, with a well balanced set of on-chip peripherals. I'm using the &lt;a href=&quot;<A HREF="http://www.sctec.com.br/content/view/101/30/">http://www.sctec.com.br/content/view/101/30/</A>&quot;&gt;MOD711&lt;/a&gt; header board from &lt;a href=&quot;<A HREF="http://www.sctec.com.br">http://www.sctec.com.br</A>&quot;&gt;ScTec&lt;/a&gt;. The board is 
-based on this STR711FR2 variant of the STR7 family. Since this is not a full-fledged development board, I had to add a few things around it: a MAX3232 RS232 to TTL converter for the serial interface, a couple of LEDs and a reset button. After that, the board was ready for some &lt;b&gt;eLua&lt;/b&gt; :) &lt;/p&gt;
- &lt;h3&gt;Prerequisites&lt;/h3&gt; 
- &lt;p&gt;Before you'll be able to use &lt;b&gt;eLua&lt;/b&gt; on the STR711FR2 CPU, make sure that:&lt;/p&gt;
+&lt;h3&gt;Instalando &lt;b&gt;eLua&lt;/b&gt; na fam&#237;lia de CPUs STR7 da ST&lt;/h3&gt;
+ &lt;p&gt;&lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-str7.html">http://www.st.com/mcu/inchtml-pages-str7.html</A>&quot;&gt;STR7&lt;/a&gt; &#233; uma fam&#237;lia de processadores baseados no ATM7TDMI da &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt;. Eles s&#227;o pequenos, MCUs de baixa pot&#234;ncia, com um conjunto equilibrado de perif&#233;ricos embutidos no chip. Estou usando a placa &lt;a href=&quot;<A HREF="http://www.sctec.com.br/content/view/101/30/">http://www.sctec.com.br/content/view/101/30/</A>&quot;&gt;MOD711&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.sctec.com.br">http://www.sctec.com.br</A>&quot;&gt;ScTec&lt;/a&gt;. A placa est&#225; baseada na variante STR711FR2 da fam&#237;lia STR7. Uma vez que esta placa ainda est&#225; em desenvolvimento, fui obrigado a adicionar algumas coisas: um conversor MAX3232 RS232 para TTL para a interface serial, um par de LEDs e um bot&#227;o de reset. Depois disso, a placa estava pronta para &lt;b&gt;eLua&lt;/b&gt;:)&lt;/p&gt;
+ &lt;h3&gt;Pr&#225;-requisitos&lt;/h3&gt; 
+ &lt;p&gt;Antes de come&#231;ar a usar &lt;b&gt;eLua&lt;/b&gt; na CPU STR711FR2, certifique-se de que:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;you're using Linux, Windows, or any other OS that has support for &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt;. You might have a look at my &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD tutorial&lt;/a&gt; before continuing.&lt;/li&gt;
- &lt;li&gt;you already have your &lt;b&gt;eLua&lt;/b&gt; image for the STR711FR2 CPU (&lt;a href=&quot;building.html&quot;&gt;built&lt;/a&gt; or &lt;a href=&quot;downloads.html&quot;&gt;downloaded&lt;/a&gt;).&lt;/li&gt;
+ &lt;li&gt;voc&#234; est&#225; usando Linux, Windows, ou qualquer outro sistema operacional que tenha suporte para &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt;. Voc&#234; pode dar uma olhada no meu &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial do OpenOCD&lt;/a&gt; antes de continuar.&lt;/li&gt;
+ &lt;li&gt;voc&#234; j&#225; tem o seu arquivo com a imagem de &lt;b&gt;eLua&lt;/b&gt; para a CPU STR711FR2 (&lt;a href=&quot;building.html&quot;&gt;gerado&lt;/a&gt; ou &lt;a href=&quot;downloads.html&quot;&gt;baixado&lt;/a&gt;).&lt;/li&gt;
  &lt;/ul&gt;
- &lt;h3&gt;Burning &lt;b&gt;eLua&lt;/b&gt; to the MOD711 board&lt;/h3&gt;
- &lt;p&gt;You need OpenOCD to do this. Just follow the instructions from my &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD tutorial &lt;/a&gt;. On the tutorial page you'll also find links to the OpenOCD
- configuration files that I'm using for burning &lt;b&gt;eLua&lt;/b&gt; to the MOD711 board. And that's it! &lt;b&gt;eLua&lt;/b&gt; is now programmed in the CPU, so you can start your terminal emulator and enjoy it, as described in &lt;a href=&quot;using.html&quot;&gt;using eLua&lt;/a&gt;.&lt;/p&gt;
-&lt;p&gt;&lt;b&gt;IMPORTANT NOTE&lt;/b&gt;: for this board you need to set your COM port speed to 38400 baud (as opposed to 115200 baud for the other boards). All the other parameters are the same (8 data bits,
- no parity, one stop bit).&lt;/p&gt;
+ &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; na placa MOD711&lt;/h3&gt;
+ &lt;p&gt;Voc&#234; precisa do OpenOCD para fazer isso. Basta seguir as instru&#231;&#245;es do meu &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial OpenOCD&lt;/a&gt;. Na p&#225;gina do tutorial, voc&#234; tamb&#233;m encontrar&#225; links para os arquivos de configura&#231;&#227;o do OpenOCD que estou usando para gravar &lt;b&gt;eLua&lt;/b&gt; na placa MOD711. E &#233; isso a&#237;! &lt;b&gt;eLua&lt;/b&gt; est&#225; gravado na CPU, agora &#233; s&#243; iniciar o emulador de terminal e se divertir, conforme descrito em &lt;a href=&quot;using.html&quot;&gt;using eLua&lt;/a&gt;.&lt;/p&gt;
+&lt;p&gt;&lt;b&gt;NOTA IMPORTANTE:&lt;/b&gt; para esta placa, voc&#234; precisa configurar a velocidade de sua porta serial para 38400 (ao contr&#225;rio de 115.200 baud para as outras placas). Todos os outros par&#226;metros continuam os mesmos (8 bits de dados, sem paridade, um stop bit).&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_str9.html
===================================================================
--- tags/pre0.6/doc/pt/installing_str9.html	2009-09-15 17:45:45 UTC (rev 448)
+++ tags/pre0.6/doc/pt/installing_str9.html	2009-09-16 05:13:59 UTC (rev 449)
@@ -1,25 +1,18 @@
 $$HEADER$$
-&lt;h3&gt;Installing &lt;b&gt;eLua&lt;/b&gt; on the STR9 CPU family from ST&lt;/h3&gt;
- &lt;p&gt;Among the ARM based MCUs available today, the &lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-str9.html">http://www.st.com/mcu/inchtml-pages-str9.html</A>&quot;&gt;STR9&lt;/a&gt; CPUs from &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt; stand up because of a few unique features.
- First, their core is an ARM966-E, as opposed to the very popular ARM7TDMI core. This, together with some cleverly chosen on-chip hardware blocks, allows the CPU to run at 96MHz, which is very fast for a 
- general purpose MCU. The particular CPU I'm using (STR912FAW44) ) also has 512k of flash (and another bank of 32k flash) and 96k of internal RAM, so you won't be running out of memory anytime soon. It is accompanied by a very good support library, 
- and ST provides a lot of nice tools for STR9, including a graphical tool that you can use to configure the chip exactly how you want. When I wrote to ST about &lt;b&gt;eLua&lt;/b&gt;, they
- agreed to send me a &lt;a href=&quot;<A HREF="http://www.hitex.com/str9-comstick/">http://www.hitex.com/str9-comstick/</A>&quot;&gt;STR9-comStick&lt;/a&gt; board to run &lt;b&gt;eLua&lt;/b&gt; on it. Thank you very much for your help, once again. This is the board that I'm going to
- use through this tutorial.&lt;/p&gt;
- &lt;h3&gt;Prerequisites&lt;/h3&gt; 
- &lt;p&gt;Before you'll be able to use &lt;b&gt;eLua&lt;/b&gt; on the STR912FAW44 CPU, make sure that:&lt;/p&gt;
+&lt;h3&gt;Instalando &lt;b&gt;eLua&lt;/b&gt; na fam&#237;lia de CPUs STR9 da ST&lt;/h3&gt;
+ &lt;p&gt;Entre os MCUs baseados em ARM dispon&#237;veis atualmente, as CPUs &lt;a href=&quot;<A HREF="http://www.st.com/mcu/inchtml-pages-str9.html">http://www.st.com/mcu/inchtml-pages-str9.html</A>&quot;&gt;STR9&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.st.com">http://www.st.com</A>&quot;&gt;ST&lt;/a&gt; continua em alta devido a algumas caracter&#237;sticas &#250;nicas. Primeiro, seu n&#250;cleo &#233; um ARM966-E, e n&#227;o o popular n&#250;cleo ARM7TDMI. Isto, juntamente com alguns blocos de hardware habilmente escolhidos e embutidos no chip, permitem que a CPU rode a 96MHz, o que &#233; muito r&#225;pido para um MCU de prop&#243;sito geral. A CPU que estou usando (uma STR912FAW44) tamb&#233;m tem 512K de flash (e um outro banco de 32K de flash) e 96k de mem&#243;ria RAM interna, assim voc&#234; n&#227;o vai ficar sem mem&#243;ria t&#227;o cedo. &#201; acompanhada de uma biblioteca de apoio muito boa, e a ST fornece uma s&#233;rie de boas ferramentas para a STR9, incluindo uma ferramenta gr&#225;fica que voc&#234; pode usar para configurar o chip, exatamente como voc&#234; deseja. Quando eu escrevi para a ST sobre a &lt;b&gt;eLua&lt;/b&gt;, eles concordaram em me enviar uma &lt;a href=&quot;<A HREF="http://www!">http://www!</A>
 .hitex.com/str9-comstick/&quot;&gt;STR9-comStick&lt;/a&gt; para rodar &lt;b&gt;eLua&lt;/b&gt; nela. Muito obrigado pela ajuda de voces, mais uma vez. Esta &#233; a placa que eu vou usar neste tutorial.&lt;/p&gt;
+ &lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
+ &lt;p&gt;Antes de voc&#234; come&#231;ar a usar &lt;b&gt;eLua&lt;/b&gt; na CPU STR912FAW44, certifique-se
+ de que:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;you're using Linux, Windows, or any other OS that has support for &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt;. You might have a look at my &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD tutorial&lt;/a&gt; before continuing.&lt;/li&gt;
- &lt;li&gt;if you're on Windows, you have installed the STR9-comStick support package from the accompanying CD.&lt;/li&gt;
- &lt;li&gt;you already have your &lt;b&gt;eLua&lt;/b&gt; image for the STR912FAW44 CPU (&lt;a href=&quot;building.html&quot;&gt;built&lt;/a&gt; or &lt;a href=&quot;downloads.html&quot;&gt;downloaded&lt;/a&gt;).&lt;/li&gt;
+ &lt;li&gt;voc&#234; est&#225; usando Linux, Windows, ou qualquer outro sistema operacional que tem suporte para &lt;a href=&quot;<A HREF="http://openocd.berlios.de/web/">http://openocd.berlios.de/web/</A>&quot;&gt;OpenOCD&lt;/a&gt;. Voc&#234; pode dar uma olhada no meu tutorial &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD tutorial&lt;/a&gt; antes de continuar.&lt;/li&gt;
+ &lt;li&gt;se voc&#234; estiver usando Windows, instalou o pacote de apoio STR9-comStick a partir do CD que acompanha a placa..&lt;/li&gt;
+ &lt;li&gt;voc&#234; j&#225; tem o arquivo com a imagem de &lt;b&gt;eLua&lt;/b&gt; para a CPU STR912FAW44 (&lt;a href=&quot;building.html&quot;&gt;gerado&lt;/a&gt; ou &lt;a href=&quot;downloads.html&quot;&gt;baixado&lt;/a&gt;).&lt;/li&gt;
  &lt;/ul&gt;
- &lt;h3&gt;Burning &lt;b&gt;eLua&lt;/b&gt; to the STR9-comStick&lt;/h3&gt;
- &lt;p&gt;You need OpenOCD to do this. Just follow the instructions from my &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD tutorial &lt;/a&gt;. On the tutorial page you'll also find links to the OpenOCD
- configuration files that I'm using for burning &lt;b&gt;eLua&lt;/b&gt; to the comstick.&lt;/p&gt;
- &lt;p&gt;&lt;b&gt;IMPORTANT NOTE&lt;/b&gt;: for some very strage reasons (probably related to the on-board USB to JTAG converter) my comstick does NOT start to execute the code from its internal flash after being
- powered up via the USB cable (faulty reset sequence?). To overcome this, you'll find a special OpenOCD configuration file on my &lt;a href=&quot;tut_openocd.html&quot;&gt;OpenOCD tutorial&lt;/a&gt; page. It is called &lt;i&gt;comrst.cfg&lt;/i&gt;,
- and you can use it to reset your comstick after it is powered up.&lt;/p&gt;
- &lt;p&gt;That's it! &lt;b&gt;eLua&lt;/b&gt; is now programmed in the CPU, so you can start your terminal emulator and enjoy it, as described in &lt;a href=&quot;using.html&quot;&gt;using eLua&lt;/a&gt;.
+ &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; na STR9-comStick&lt;/h3&gt;
+ &lt;p&gt;Voc&#234; precisa OpenOCD para fazer isso. Basta seguir as instru&#231;&#245;es do meu &lt;a href=&quot;tut_openocd.html&quot;&gt;tutorial OpenOCD&lt;/a&gt;. Na p&#225;gina do tutorial voc&#234; tamb&#233;m encontrar&#225; links para os arquivos de configura&#231;&#227;o do OpenOCD que estou usando para gravar &lt;b&gt;eLua&lt;/b&gt; no comStick.&lt;/p&gt;
+ &lt;p&gt;&lt;b&gt;NOTA IMPORTANTE:&lt;/b&gt; devido a algumas raz&#245;es desconhecidas (talvez relacionados com o conversor USB/JTAG on-board) meu comStick n&#227;o inicia a execu&#231;&#227;o do c&#243;digo da mem&#243;ria flash interna, depois de ter sido ligado via cabo USB (sequ&#234;ncia de reset com defeito?). Para superarmos isso, acesse um arquivo de configura&#231;&#227;o especial do OpenOCD na minha &lt;a href=&quot;tut_openocd.html&quot;&gt;p&#225;gina do tutorial&lt;/a&gt;. Chama-se comrst.cfg, e voc&#234; poder&#225; us&#225;-lo para reiniciar a sua comStick depois que ela for ligada.&lt;/p&gt;
+ &lt;p&gt;&#201; isso! &lt;b&gt;eLua&lt;/b&gt; est&#225; gravado na CPU, inicie agora o seu emulador de terminal e divirta-se, como descrito em &lt;a href=&quot;using.html&quot;&gt;usando eLua&lt;/a&gt;.
 &lt;/p&gt;
 $$FOOTER$$
 


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000404.html">[Elua-svn] r448 - trunk/src/modules
</A></li>
	<LI>Next message: <A HREF="000406.html">[Elua-svn] r450 - tags/pre0.6/doc/pt
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#405">[ date ]</a>
              <a href="thread.html#405">[ thread ]</a>
              <a href="subject.html#405">[ subject ]</a>
              <a href="author.html#405">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/elua-svn">More information about the eLua-svn
mailing list</a><br>
</body></html>
