<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Elua-svn] r453 - tags/pre0.6/doc/pt
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/elua-svn/2009-September/index.html" >
   <LINK REL="made" HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r453%20-%20tags/pre0.6/doc/pt&In-Reply-To=%3C200909180300.n8I30nj0003792%40sheep.berlios.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000408.html">
   <LINK REL="Next"  HREF="000410.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Elua-svn] r453 - tags/pre0.6/doc/pt</H1>
    <B>dadosutter at BerliOS</B> 
    <A HREF="mailto:elua-svn%40lists.berlios.de?Subject=Re%3A%20%5BElua-svn%5D%20r453%20-%20tags/pre0.6/doc/pt&In-Reply-To=%3C200909180300.n8I30nj0003792%40sheep.berlios.de%3E"
       TITLE="[Elua-svn] r453 - tags/pre0.6/doc/pt">dadosutter at mail.berlios.de
       </A><BR>
    <I>Fri Sep 18 05:00:50 CEST 2009</I>
    <P><UL>
        <LI>Previous message: <A HREF="000408.html">[Elua-svn] r452 - tags/pre0.6/doc/pt
</A></li>
        <LI>Next message: <A HREF="000410.html">[Elua-svn] r454 - trunk
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#409">[ date ]</a>
              <a href="thread.html#409">[ thread ]</a>
              <a href="subject.html#409">[ subject ]</a>
              <a href="author.html#409">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Author: dadosutter
Date: 2009-09-18 05:00:33 +0200 (Fri, 18 Sep 2009)
New Revision: 453

Modified:
   tags/pre0.6/doc/pt/installing_avr32.html
   tags/pre0.6/doc/pt/installing_i386.html
   tags/pre0.6/doc/pt/installing_lm3s.html
Log:
More PT_BR content
(still needs some revision)



Modified: tags/pre0.6/doc/pt/installing_avr32.html
===================================================================
--- tags/pre0.6/doc/pt/installing_avr32.html	2009-09-17 20:11:42 UTC (rev 452)
+++ tags/pre0.6/doc/pt/installing_avr32.html	2009-09-18 03:00:33 UTC (rev 453)
@@ -1,40 +1,29 @@
 $$HEADER$$
-&lt;h3&gt;Installing &lt;b&gt;eLua&lt;/b&gt; on the AVR32 CPUs from Atmel&lt;/h3&gt;
-&lt;p&gt;&lt;a href=&quot;<A HREF="http://www.atmel.com/products/AVR32/">http://www.atmel.com/products/AVR32/</A>&quot;&gt;AVR32&lt;/a&gt; is a family of high performance 32-bit CPUs from &lt;a 
-  href=&quot;<A HREF="http://www.atmel.com">http://www.atmel.com</A>&quot;&gt;Atmel&lt;/a&gt;. They were built as direct competitors for the various ARM core implementation of the market, and offer very good
-  performance (91 MIPS @ 66MHz) and power efficieny (1.3mW/MHz). Atmel claims that their AVR32 core outperforms ARMv5 (in ARM and Thumb mode) in terms of 
-  both performance and code size. It's a proprietary architecture (so it's only implemented by Atmel), yet it has a very good support package, and an
-  open source toolchain based on GCC, which made it an ideal candidate for the first non-ARM (and also the first big endian) &lt;b&gt;eLua&lt;/b&gt; target. Atmel
-  also sells a number of development boards based on their AVR23 CPUs. The one used for &lt;b&gt;eLua&lt;/b&gt; is the 
-  &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/Products/tools_card.asp?tool_id=4114">http://www.atmel.com/dyn/Products/tools_card.asp?tool_id=4114</A>&quot;&gt;ATEVK1100 board&lt;/a&gt;, built around the 
-  &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/product_card.asp?part_id=4117">http://www.atmel.com/dyn/products/product_card.asp?part_id=4117</A>&quot;&gt;AT32UC3A0512 AVR32 MCU&lt;/a&gt; (512k internal Flash/64k internal ARM).
-  It's a very powerful board, featuring (among other things) an external 32 MByte SDRAM memory, which is more than enough to run any &lt;b&gt;eLua&lt;/b&gt; 
-  program I can think of :).&lt;/p&gt;
-&lt;h3&gt;Prerequisites&lt;/h3&gt; 
- &lt;p&gt;Before you'll be able to use &lt;b&gt;eLua&lt;/b&gt; on the AT32UC3A0512 CPU, make sure that:&lt;/p&gt;
+&lt;h3&gt;Instalando &lt;b&gt;eLua&lt;/b&gt; nas CPUs AVR32 CPUs da Atmel&lt;/h3&gt;
+&lt;p&gt;&lt;a href=&quot;<A HREF="http://www.atmel.com/products/AVR32/">http://www.atmel.com/products/AVR32/</A>&quot;&gt;AVR32&lt;/a&gt; &#233; uma fam&#237;lia de CPUs de 32 bits de alta performance da &lt;a href=&quot;<A HREF="http://www.atmel.com">http://www.atmel.com</A>&quot;&gt;Atmel&lt;/a&gt;. Foram constru&#237;das visando a concorr&#234;ncia direta no mercado com a implementa&#231;&#227;o da ARM, e oferece uma performance muito boa (91 MIPS com 66MHz) e fonte de energia eficiente (1.3mW/MHz). A Atmel alega que o seu n&#250;cleo AVR32 supera o ARMv5 (tanto em modo ARM como em Thumb) em termos de desempenho e tamanho do c&#243;digo. &#201; uma arquitetura propriet&#225;ria (s&#243; implementada pela Atmel), mas tem um pacote de software de apoio muito bom, e um conjunto de ferramentas de c&#243;digo aberto baseado em GCC, o que a faz ser uma candidata ideal para se usar eLua com uma CPU n&#227;o-ARM. Atmel vende tamb&#233;m v&#225;rias placas de desenvolvimento com base em suas CPUs AVR23. A utilizada para eLua &#233; a placa &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/Products/tools_card.asp?tool_id=4114">http://www.atmel.com/dyn/Products/tools_card.asp?tool_id=4114</A>&quot;&gt;ATEVK1100&lt;/a&gt;, constru&#237;da em torno do &lt;a href=&quot;<A HREF="http://www.atmel.!">http://www.atmel.!</A>
 com/dyn/products/product_card.asp?part_id=4117&quot;&gt;MCU AT32UC3A0512 AVR32&lt;/a&gt; (512k Flash interno/64k RAM interno). &#201; uma placa muito poderosa, com (entre outras coisas) 32 MBytes de mem&#243;ria SDRAM externa, o que &#233; mais do que suficiente para rodar qualquer programa &lt;b&gt;eLua&lt;/b&gt; que eu possa imaginar:).&lt;/p&gt;
+
+
+&lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
+ &lt;p&gt;Antes de voc&#234; usar &lt;b&gt;eLua&lt;/b&gt; com a CPU AT32UC3A0512, certifique-se que:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;you're using Linux or Windows. It's easier to install and use Atmel's programming software on Windows, so use Windows version if you want to save
-   yourself from quite a bit of hassle.&lt;/li&gt;
- &lt;li&gt;you installed Atmel's &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3886">http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3886</A>&quot;&gt;FLIP programming software&lt;/a&gt;, which is what you need
-    in order to install your &lt;b&gt;eLua&lt;/b&gt; image. Installation in easy under Windows (you just need to run a setup paclage), but quite tricky under Linux. 
-    The next paragraph outlines the procedure for installing FLIP in Linux.&lt;/li&gt;
- &lt;li&gt;you already have your &lt;b&gt;eLua&lt;/b&gt; image for the AT32UC3A0512 CPU (&lt;a href=&quot;building.html&quot;&gt;built&lt;/a&gt; or &lt;a href=&quot;downloads.html&quot;&gt;downloaded&lt;/a&gt;). 
-    Note that unlike other platforms, the ATEVK1100 needs a .hex file for programming, not a .bin.&lt;/li&gt;
+ &lt;li&gt;usando Linux ou Windows. &#201; mais f&#225;cil instalar e usar o software de programa&#231;&#227;o da Atmel no Windows, portanto use o Windows caso voc&#234; n&#227;o queira ter muitas dificuldades durante a instala&#231;&#227;o.&lt;/li&gt;
+ &lt;li&gt;o programa &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3886">http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3886</A>&quot;&gt;FLIP da Atmel&lt;/a&gt; instalado, &#233; exatamente o que voc&#234; precisa para instalar seu arquivo de imagem de &lt;b&gt;eLua&lt;/b&gt;. De f&#225;cil instala&#231;&#227;o no Windows (&#233; s&#243; executar o pacote de instala&#231;&#227;o), mas bastante complicado no Linux. 
+    No par&#225;grafo abaixo, segue uma descri&#231;&#227;o dos procedimentos para instala&#231;&#227;o do FLIP em Linux..&lt;/li&gt;
+ &lt;li&gt;Voc&#234; j&#225; tem sua imagem de &lt;b&gt;eLua&lt;/b&gt; para a CPU AT32UC3A0512 (&lt;a href=&quot;building.html&quot;&gt;gerada&lt;/a&gt; ou &lt;a href=&quot;downloads.html&quot;&gt;baixada&lt;/a&gt;). Note que ao contr&#225;rio das outras plataformas, o ATEVK1100 precisa de um arquivo .hex para a programa&#231;&#227;o, e n&#227;o um .bin.&lt;/li&gt;
  &lt;/ul&gt;
-&lt;h2&gt;Installing FLIP in Ubuntu Linux&lt;/h2&gt;
-&lt;p&gt;Follow the steps below to install FLIP under Linux:&lt;/p&gt;
+
+&lt;h2&gt;Instalando FLIP no Linux Ubuntu&lt;/h2&gt;
+&lt;p&gt;Siga os passos abaixo para instalar o FLIP no Linux:&lt;/p&gt;
 &lt;ol&gt;
-  &lt;li&gt;download the Linux version of FLIP from &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3886">http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3886</A>&quot;&gt;the Atmel FLIP page&lt;/a&gt;. Save it 
-  (or move it later) to your &lt;i&gt;/usr/local/&lt;/i&gt; directory (you need to have superuser privileges to do that). At the moment of writing this tutorial, the
-  latest FLIP version is 3.2.1, so this is what we're going to use here.&lt;/li&gt;
-  &lt;li&gt;untar the FLIP archive:
+  &lt;li&gt;baixe a vers&#227;o do FLIP para Linux da &lt;a href=&quot;<A HREF="http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3886">http://www.atmel.com/dyn/products/tools_card.asp?tool_id=3886</A>&quot;&gt;p&#225;gina da Atmel&lt;/a&gt;. Salve-o (ou mova-o depois) para a pasta &lt;i&gt;/usr/local/&lt;/i&gt; (para isso &#233; necess&#225;rio privil&#233;gios de superusu&#225;rio). No momento da elabora&#231;&#227;o deste tutorial, a &#250;ltima vers&#227;o do FLIP &#233; a 3.2.1, portanto vamos utilizar aqui esta vers&#227;o.&lt;/li&gt;
+  &lt;li&gt;descompacte o arquivo FLIP:
   &lt;pre&gt;&lt;code&gt;$ cd /usr/local
 $ sudo tar xvzf flip_linux_3-2-1.tgz&lt;/code&gt;&lt;/pre&gt;
-  This will create the &lt;i&gt;/usr/local/flip.3.2.1&lt;/i&gt; directory.&lt;/li&gt;
-  &lt;li&gt;you need to install OpenJDK if it is not installed:
+  Isto criar&#225; o diret&#243;rio &lt;i&gt;/usr/local/flip.3.2.1&lt;/i&gt;.&lt;/li&gt;
+  &lt;li&gt;&#233; necess&#225;rio instalar o OpenJDK caso ele n&#227;o esteja instalado:
   &lt;pre&gt;&lt;code&gt;$ sudo apt-get install openjdk-6-jre&lt;/code&gt;&lt;/pre&gt;
   &lt;/li&gt;
-  &lt;li&gt;edit &lt;i&gt;/usr/local/flip.3.2.1/bin/batchisp3.sh&lt;/i&gt; and add the two bolded lines before at the beginning of the file:
+  &lt;li&gt;edite &lt;i&gt;/usr/local/flip.3.2.1/bin/batchisp3.sh&lt;/i&gt; e inclua as duas linhas em negrito no inicio do arquivo:
   &lt;pre&gt;&lt;code&gt;#!/bin/bash -f
 
 &lt;b&gt;export JAVA_HOME=/usr/lib/jvm/java-6-openjdk/jre/
@@ -42,35 +31,33 @@
 
 if [ &quot;$FLIP_HOME&quot; = &quot;&quot; ]; then&lt;/code&gt;&lt;/pre&gt;
   &lt;/li&gt;
-  &lt;li&gt;you need to edit a binary file this time (&lt;i&gt;/usr/local/flip.3.2.1/libatlibusbdfu.so&lt;/i&gt;). This happens because FLIP comes compiled for RedHat by
-  default, and Ubuntu some different system paths. See &lt;a href=&quot;<A HREF="http://www.avrfreaks.net/index.php?name=PNphpBB2&amp;amp;file=viewtopic&amp;amp;t=56562">http://www.avrfreaks.net/index.php?name=PNphpBB2&amp;file=viewtopic&amp;t=56562</A>&quot;&gt;this topic&lt;/a&gt; 
-  for full details. All you have to do is change all the &lt;b&gt;/sys/bus/usb&lt;/b&gt; strings inside &lt;i&gt;libatlibusbdfu.so&lt;/i&gt; to &lt;b&gt;/dev/bus/usb&lt;/b&gt;.&lt;/li&gt;
-  &lt;li&gt;add the FLIP directory to your PATH:
+  &lt;li&gt;edite o arquivo bin&#225;rio &lt;i&gt;/usr/local/flip.3.2.1/libatlibusbdfu.so&lt;/i&gt;. Isto &#233; necess&#225;rio, porque o programa FLIP vem compilado para o RedHat por default, e o Ubuntu possui algumas arquivos de sua instala&#231;&#227;o localizados em diret&#243;rios diferentes . Veja &lt;a href=&quot;<A HREF="http://www.avrfreaks.net/index.php?name=PNphpBB2&amp;amp;file=viewtopic&amp;amp;t=56562">http://www.avrfreaks.net/index.php?name=PNphpBB2&amp;file=viewtopic&amp;t=56562</A>&quot;&gt;este t&#243;pico&lt;/a&gt; para mais detalhes. Tudo que voc&#234; tem a fazer, &#233; alterar todas as refer&#234;ncias do string &lt;b&gt;/sys/bus/usb&lt;/b&gt; contidas no arquivo &lt;i&gt;libatlibusbdfu.so&lt;/i&gt; para &lt;b&gt;/dev/bus/usb&lt;/b&gt;.&lt;/li&gt;
+  &lt;li&gt;inclua o diret&#243;rio FLIP no seu PATH:
   &lt;pre&gt;&lt;code&gt;$ export PATH=/usr/local/flip.3.2.1/bin:$PATH&lt;/code&gt;&lt;/pre&gt;
   &lt;/li&gt;
-  &lt;li&gt;FLIP interferes with a program that comes pre-installed on Ubuntu system, called &lt;b&gt;brltty&lt;/b&gt;. It's meant to help the visually 
-  impaired, so if you're not one of them, simply remove it (as it seems to interfere with a lot of other USB devices too):
+  &lt;li&gt;FLIP interfere com um programa que vem pr&#233;-instalado no sistema Ubuntu, chamado &lt;b&gt;brltty&lt;/b&gt;. Este programa &#233; destinado a ajudar os deficientes visuais, por isso, se voc&#234; n&#227;o for um deles, basta remov&#234;-lo (como parece tamb&#233;m interferir com uma s&#233;rie de outros dispositivos USB):
+
   &lt;pre&gt;&lt;code&gt;$ sudo apt-get remove brltty&lt;/code&gt;&lt;/pre&gt;
   &lt;/li&gt;
 &lt;/ol&gt;
 
- &lt;h3&gt;Burning &lt;b&gt;eLua&lt;/b&gt; to the EVK1100 board&lt;/h3&gt;
-&lt;p&gt;After you installed FLIP and added it to your $PATH, burning the &lt;b&gt;eLua&lt;/b&gt; image should be quite easy:&lt;/p&gt;
+ &lt;h3&gt;Gravando &lt;b&gt;eLua&lt;/b&gt; na placa EVK1100&lt;/h3&gt;
+&lt;p&gt;Ap&#243;s a instala&#231;&#227;o do FLIP e de t&#234;-lo inclu&#237;do no seu PATH, gravar o arquivo imagem de &lt;b&gt;eLua&lt;/b&gt; deve ser bem f&#225;cil:&lt;/p&gt;
 &lt;ul&gt;
-  &lt;li&gt;connect your ATEVK1100 board with the PC using an USB cable&lt;/li&gt;
-  &lt;li&gt;put your board in DFU mode (this is required for FLIP interaction). To do this:
+  &lt;li&gt;conecte sua placa ATEVK1100 a um PC usando um cabo USB&lt;/li&gt;
+  &lt;li&gt;coloque a placa no modo DFU (isto &#233; necess&#225;rio para a utiliza&#231;&#227;o do FLIP). Para fazer isso:
     &lt;ol&gt;
-      &lt;li&gt;press &lt;b&gt;on&lt;/b&gt; the on-board joystick (and keep it pressed)&lt;/li&gt;
-      &lt;li&gt;press the RESET button on the board briefly&lt;/li&gt;
-      &lt;li&gt;release the RESET button&lt;/li&gt;
-      &lt;li&gt;release the joystick&lt;/li&gt;
+      &lt;li&gt;pressione o bot&#227;o &lt;b&gt;on&lt;/b&gt; do joystick (e mantenha-o pressionado)&lt;/li&gt;
+      &lt;li&gt;pressione o  bot&#227;o RESET da placa rapidamente&lt;/li&gt;
+      &lt;li&gt;solte o bot&#227;o RESET&lt;/li&gt;
+      &lt;li&gt;solte o joystick&lt;/li&gt;
     &lt;/ol&gt;
   &lt;/li&gt;
-  &lt;li&gt;if you're using Windows and it asks you for a driver, you should install it manually from &lt;i&gt;c:\Program Files\Atmel\Flip &lt;version&gt;\usb&lt;/i&gt;&lt;/li&gt;
-  &lt;li&gt;Execute this from the command line (the command is the same on Windows and Linux, with a single exception: the FLIP executable name is &lt;b&gt;batchisp3&lt;/b&gt; in Linux and &lt;b&gt;batchisp&lt;/b&gt; (without a 3) in Windows):
+  &lt;li&gt;Se voc&#234; estiver usando o Windows e este lhe pedir um driver, voc&#234; deve instal&#225;-lo manualmente a partir de &lt;i&gt;c:\Program Files\Atmel\Flip&lt;version&gt;\usb\&lt;/i&gt;&lt;/li&gt;
+  &lt;li&gt;chame o programa FLIP pela linha de comando (o comando &#233; o mesmo no Windows e no Linux, com uma &#250;nica exce&#231;&#227;o:, o nome do execut&#225;vel &#233; FLIP &lt;b&gt;batchisp3&lt;/b&gt; em Linux e &lt;b&gt;batchisp&lt;/b&gt; (sem a 3) no Windows) abaixo:
   &lt;pre&gt;&lt;code&gt;$ batchisp3 -hardware usb -device at32uc3a0512 -operation erase f memory flash blankcheck 
   loadbuffer &lt;image name&gt;.hex program verify start reset 0&lt;/code&gt;&lt;/pre&gt;&lt;/li&gt;
 &lt;/ul&gt;
-&lt;p&gt;That's all, your &lt;b&gt;eLua&lt;/b&gt; image is (finally) installed on your ATEVK1100 board.&lt;/p&gt;
+&lt;p&gt;Terminou, o arquivo imagem de &lt;b&gt;eLua&lt;/b&gt; est&#225; finalmente instalado na sua placa ATEVK1100.&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_i386.html
===================================================================
--- tags/pre0.6/doc/pt/installing_i386.html	2009-09-17 20:11:42 UTC (rev 452)
+++ tags/pre0.6/doc/pt/installing_i386.html	2009-09-18 03:00:33 UTC (rev 453)
@@ -1,15 +1,12 @@
 $$HEADER$$
-&lt;h3&gt;Using eLua with Intel i386 (or better) CPUs&lt;/h3&gt;
- &lt;p&gt;Since the i386 platform was implemented as a proof of concept only, the only things you can do with it are:&lt;/p&gt;
+&lt;h3&gt;Usando eLua com as CPUs Intel i386 (ou mais recentes)&lt;/h3&gt;
+ &lt;p&gt;Como a plataforma i386 foi implementada somente como uma prova de conceito, as &#250;nicas coisas que voc&#234; pode fazer com ela s&#227;o:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;&lt;a href=&quot;tut_boot_lua.html&quot;&gt;##Boot your PC in eLua&lt;/a&gt;&lt;/li&gt;
- &lt;li&gt;&lt;a href=&quot;tut_lua_usb.html&quot;&gt;##Boot eLua from a stick&lt;/a&gt;&lt;/li&gt;
+ &lt;li&gt;&lt;a href=&quot;tut_boot_lua.html&quot;&gt;##Inicializar seu PC com eLua&lt;/a&gt;&lt;/li&gt;
+ &lt;li&gt;&lt;a href=&quot;tut_lua_usb.html&quot;&gt;##Inicializar eLua de um pendrive&lt;/a&gt;&lt;/li&gt;
  &lt;/ul&gt;
- &lt;p&gt;If you want to do this, &lt;a href=&quot;building.html&quot;&gt;build your eLua image&lt;/a&gt; or download a precompiled image, as explained in the &lt;a href=&quot;downloads.html&quot;&gt;download page&lt;/a&gt;.&lt;/p&gt;
- &lt;p&gt;However, most of the features that you'd find on an embedded platform won't work. You won't be able to upload programs to your i386 &lt;b&gt;eLua&lt;/b&gt; box using the
- XMODEM protocol (not because it's impossible, but simply because this doesn't make sense at all on a desktop PC). Also, you won't be able to control the peripherals that you'd normally find in an
- embedded CPU (SPI, I2C, PIO and all the others), because they are not present on the i386 platform (they can be emulated via different means, but this is way beyond
- the scope of &lt;b&gt;eLua&lt;/b&gt;). So, until further notice, i386 will be nothing more than a spectacular demo platform for &lt;b&gt;eLua&lt;/b&gt;. If you think that you can make something
- more out of it, please feel free to &lt;a href=&quot;overview.html#contacts&quot;&gt;contact us&lt;/a&gt;. I'm actually very interested in this, but I lack the necessary resources to continue it.&lt;/p&gt;
+ &lt;p&gt;Se voc&#234; quiser fazer isso, &lt;a href=&quot;building.html&quot;&gt;construa sua imagem de eLua&lt;/a&gt; ou fa&#231;a o download de uma imagem pr&#233;-compilada, como explicado na &lt;a href=&quot;downloads.html&quot;&gt;p&#225;gina de download&lt;/a&gt;.&lt;/p&gt;
+ &lt;p&gt;No entanto, a maioria dos recursos que voc&#234; encontraria em uma plataforma embutida n&#227;o funciona aqui.
+Voc&#234; n&#227;o ser&#225; capaz de carregar programas para o seu hardware &lt;b&gt;eLua&lt;/b&gt; i386 usando o protocolo XMODEM (n&#227;o porque &#233; imposs&#237;vel, mas simplesmente porque isso n&#227;o faz sentido algum em um PC). Al&#233;m disso, voc&#234; n&#227;o ser&#225; capaz de controlar os perif&#233;ricos que normalmente encontram-se embutidos em uma CPU (SPI, I2C, PIO e todos os outros), porque eles n&#227;o est&#227;o presentes na plataforma i386 (que podem ser emulados atrav&#233;s de diferentes meios, mas este &#233; um assunto que vai al&#233;m do escopo de &lt;b&gt;eLua&lt;/b&gt;). Assim, at&#233; novo aviso, i386 ser&#225; nada mais do que uma plataforma de demonstra&#231;&#227;o para &lt;b&gt;eLua&lt;/b&gt;. Se voc&#234; acha que pode fazer algo al&#233;m disso, n&#227;o hesite em contactar-nos. Estou realmente muito interessado nisso, mas me faltam recursos necess&#225;rios para dar continuidade.&lt;/p&gt;
 $$FOOTER$$
 

Modified: tags/pre0.6/doc/pt/installing_lm3s.html
===================================================================
--- tags/pre0.6/doc/pt/installing_lm3s.html	2009-09-17 20:11:42 UTC (rev 452)
+++ tags/pre0.6/doc/pt/installing_lm3s.html	2009-09-18 03:00:33 UTC (rev 453)
@@ -1,47 +1,29 @@
 $$HEADER$$
-&lt;h3&gt;Using &lt;b&gt;eLua&lt;/b&gt; with the LM3S (Cortex-M3) CPUs from Luminary Micro&lt;/h3&gt;
- &lt;p&gt;&lt;a href=&quot;<A HREF="http://www.luminarymicro.com">http://www.luminarymicro.com</A>&quot;&gt;Luminary Micro&lt;/a&gt; is the company that produced the world's first silicon implementation of the Cortex-M3 processor. Their 
- device portfolio is quite impressive, ranging from relatively simple devices to full-featured CPUs (with on-chip USB, EMAC, CAN, and many other peripherals). The support
- package for these devices is also very good, with drivers for all the CPU peripherals and ports of 3rd party applications. And, on a personal note, I contacted Luminary Micro
- some while ago with a request to support this project with one of their evaluation kits, and their response was excellent (thanks again, Luminary!). That's how a
- &lt;a href=&quot;<A HREF="http://www.luminarymicro.com/products/lm3s8962_can_ethernet_evaluation_kit.html">http://www.luminarymicro.com/products/lm3s8962_can_ethernet_evaluation_kit.html</A>&quot;&gt;EKx-LM3S8962K&lt;/a&gt; landed on my desk. This is the development board that I'm going
- to use in this tutorial. &lt;b&gt;eLua&lt;/b&gt; also supports the &lt;a href=&quot;<A HREF="http://www.luminarymicro.com/products/ekk-lm3s6965_ethernet_evaluation_kit.html">http://www.luminarymicro.com/products/ekk-lm3s6965_ethernet_evaluation_kit.html</A>&quot;&gt;EKx-LM3S6965&lt;/a&gt; board from Luminary (which can be programmed exactly like the EKx-LM3S8962) and the &lt;a href=&quot;<A HREF="http://www.micromint.com/index.php/products/by-family/sbcs/77">http://www.micromint.com/index.php/products/by-family/sbcs/77</A>&quot;&gt;Eagle 100&lt;/a&gt; board from &lt;a href=&quot;<A HREF="http://www.micromint.com">http://www.micromint.com</A>&quot;&gt;Micromint&lt;/a&gt;, which uses a different installation procedure. 
+&lt;h3&gt;Usando &lt;b&gt;eLua&lt;/b&gt; com as CPUs LM3S (Cortex-M3) da Luminary Micro&lt;/h3&gt;
+ &lt;p&gt;&lt;a href=&quot;<A HREF="http://www.luminarymicro.com">http://www.luminarymicro.com</A>&quot;&gt;Luminary Micro&lt;/a&gt; &#233; a empresa que produziu a primeira implementa&#231;&#227;o de silicone do mundo para o processador Cortex-M3. A rela&#231;&#227;o de produtos da Luminary &#233; bastante variada, que v&#227;o desde dispositivos relativamente simples at&#233; CPUs com recursos completos (com on-chip USB, EMAC, CAN, e muitos outros perif&#233;ricos). O software que acompanha estes dispositivos tamb&#233;m &#233; muito bom, com drivers para todos os perif&#233;ricos da CPU e aplicativos de terceiros. A algum tempo atr&#225;s, entramos em contato com a Luminary Micro, solicitando um apoio a este projeto atrav&#233;s de um de seus kits de avalia&#231;&#227;o, a resposta foi excelente (obrigado mais uma v&#234;z, Luminary!). Foi assim que uma &lt;a href=&quot;<A HREF="http://www.luminarymicro.com/products/lm3s8962_can_ethernet_evaluation_kit.html">http://www.luminarymicro.com/products/lm3s8962_can_ethernet_evaluation_kit.html</A>&quot;&gt;EKx-LM3S8962K&lt;/a&gt; veio parar na minha mesa. Esta &#233; a placa de desenvolvimento que eu vou usar neste tutorial. &lt;b&gt;eLua&lt;/b&gt; tamb&#233;m suporta a placa &lt;a href=&quot;<A HREF="http://www.l!">http://www.l!</A>
 uminarymicro.com/products/ekk-lm3s6965_ethernet_evaluation_kit.html&quot;&gt;EKx-LM3S6965&lt;/a&gt; da Luminary (que pode ser programada exatamente como a EKX-LM3S8962) e a placa &lt;a href=&quot;<A HREF="http://www.micromint.com/index.php/products/by-family/sbcs/77">http://www.micromint.com/index.php/products/by-family/sbcs/77</A>&quot;&gt;Eagle 100&lt;/a&gt; da &lt;a href=&quot;<A HREF="http://www.micromint.com">http://www.micromint.com</A>&quot;&gt;Micromint&lt;/a&gt;, que usa um procedimento de instala&#231;&#227;o diferente.
 &lt;/p&gt;
- &lt;h3&gt;Pre-requisites&lt;/h3&gt; 
- &lt;p&gt;Before you'll be able to use &lt;b&gt;eLua&lt;/b&gt; on the LM3S CPU, make sure that:&lt;/p&gt;
+ &lt;h3&gt;Pr&#233;-requisitos&lt;/h3&gt; 
+ &lt;p&gt;Antes de come&#231;ar a utilizar &lt;b&gt;eLua&lt;/b&gt; com a CPU LM3S, certifique-se de que:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;you're using Windows. Yes, I really said &lt;b&gt;Windows&lt;/b&gt;. The reason is quite simple: we're going to use Luminary's tools to burn &lt;b&gt;eLua&lt;/b&gt; to the board,
- and they're Windows specific. This is the case with many CPUs and vendors out there. You can have Windows installed on your HDD, or under 
- an emulator in Linux, it doesn't matter, you can even try to run it from &lt;a href=&quot;<A HREF="http://www.winehq.org/">http://www.winehq.org/</A>&quot;&gt;Wine&lt;/a&gt; if you're really, really brave. I'm using XP, Vista should work too.&lt;/li&gt;
- &lt;li&gt;you have installed the LM Flash Programmer tool from Luminary. Look for it on &lt;a href=&quot;<A HREF="http://www.luminarymicro.com/products/ekk-lm3s8962_can_ethernet_evaluation_kit.html">http://www.luminarymicro.com/products/ekk-lm3s8962_can_ethernet_evaluation_kit.html</A>&quot;&gt;this page&lt;/a&gt;,
- for example (the link is in the &quot;Software updates&quot; table).&lt;/li&gt;
- &lt;li&gt;you already have your &lt;b&gt;eLua&lt;/b&gt; image for the LM3S8962 CPU (&lt;a href=&quot;building.html&quot;&gt;built&lt;/a&gt; or &lt;a href=&quot;downloads.html&quot;&gt;downloaded&lt;/a&gt;). &lt;/li&gt;
+ &lt;li&gt;voc&#234; est&#225; usando Windows. Isso mesmo, eu disse &lt;b&gt;Windows&lt;/b&gt;. O motivo &#233; bastante simples: vamos utilizar as ferramentas da Luminary para gravar  &lt;b&gt;eLua&lt;/b&gt; na placa, e estas s&#227;o espec&#237;ficas para Windows. Este &#233; o caso de muitas CPUs e fabricantes que existem por a&#237;. Pode-se ter o Windows instalado no seu disco r&#237;gido, ou debaixo de emulador no Linux, n&#227;o importa, caso voc&#234; esteja bastante irritado, pode-se rod&#225;-lo tamb&#233;m a partir do &lt;a href=&quot;<A HREF="http://www.winehq.org/">http://www.winehq.org/</A>&quot;&gt;Wine&lt;/a&gt;. Uso o XP, Vista deve funcionar tamb&#233;m.&lt;/li&gt;
+ &lt;li&gt;voc&#234; instalou o programa LM Flash Programmer da Luminary. Procure-o &lt;a href=&quot;<A HREF="http://www.luminarymicro.com/products/ekk-lm3s8962_can_ethernet_evaluation_kit.html">http://www.luminarymicro.com/products/ekk-lm3s8962_can_ethernet_evaluation_kit.html</A>&quot;&gt;nesta p&#225;gina&lt;/a&gt;, por exemplo (o link est&#225; na guia &quot;Software Updates&quot;).&lt;/li&gt;
+ &lt;li&gt;voc&#234; j&#225; tem a imagem de &lt;b&gt;eLua&lt;/b&gt; para a CPU LM3S8962 (&lt;a href=&quot;building.html&quot;&gt;gerada&lt;/a&gt; ou &lt;a href=&quot;downloads.html&quot;&gt;baixada&lt;/a&gt;).&lt;/li&gt;
  &lt;/ul&gt;
- &lt;h3&gt;Installing &lt;b&gt;eLua&lt;/b&gt; on EKx-LM3S8962EK and EKx-LM3S6965&lt;/h3&gt;
- &lt;p&gt;Fortunately, this is as easy and painless as possible. One of the nicest things about these two kits is they use the on-board USB port for both firmware downloading and for
- emulating a serial port (via a hardware USB to UART converter, so you don't need any special software on the CPU to access this UART port). Moreover, it automagically
- knows how (and when) to switch from the firmware download mode to the UART emulation mode, so you don't need to move jumpers around or anything like this. It's zero effort
- firmware upgrading at its best. So, let's do it:&lt;/p&gt;
+ &lt;h3&gt;Instalando &lt;b&gt;eLua&lt;/b&gt; nas CPUs EKx-LM3S8962EK e EKx-LM3S6965&lt;/h3&gt;
+ &lt;p&gt;Felizmente, esta instala&#231;&#227;o est&#225; mais f&#225;cil do que nunca. Uma das coisas agrad&#225;veis sobre esses dois kits &#233; que eles usam a porta USB on-board, tanto para baixar o firmware quanto para emular uma porta serial (atrav&#233;s de um conversor USB/UART, sendo assim, voc&#234; n&#227;o precisa de nenhum software especial para a CPU ter acesso a essa porta UART). Al&#233;m disso, a placa sabe automaticamente como (e quando) alternar entre o modo de download do firmware para o modo de emula&#231;&#227;o UART, assim voc&#234; n&#227;o precisa trocar jumpers de l&#225; para c&#225;, ou qualquer coisa assim. O esfor&#231;o de atualiza&#231;&#227;o do firmware &#233; nenhum mesmo. Ent&#227;o, vamos faz&#234;-lo:&lt;/p&gt;
  &lt;ul&gt;
- &lt;li&gt;connect your board to your PC using a suitable USB cable. If you didn't install the board drivers yet, you'll be asked to install them now.&lt;/li&gt;
- &lt;li&gt;if you're already using the USB connection on the board in the UART emulation mode, close your terminal program (or at least disconnect it from the USB COM port).&lt;/li&gt;
- &lt;li&gt;fire up the &quot;Luminary Micro Flash Programmer&quot; application.&lt;/li&gt;
- &lt;li&gt;in the &quot;Configuration&quot; tab, select &quot;LM3S8962 Ethernet and CAN Evaluation board&quot; or &quot;LM3S6965 Ethernet Evaluation Board&quot; (depending on your board).&lt;/li&gt;
- &lt;li&gt;in the &quot;Program&quot; tab, select the &lt;b&gt;eLua&lt;/b&gt; .bin file that you got from the compilation step.&lt;/li&gt;
- &lt;li&gt;select the &quot;Options&quot; as you like (I generally choose &quot;Erase entire flash&quot; and &quot;Reset MCU after program&quot;).&lt;/li&gt;
- &lt;li&gt;hit the &quot;Program&quot; button.&lt;/li&gt;
- &lt;li&gt;wait until programming is over, then exit the flash programmer application.&lt;/li&gt;
+ &lt;li&gt;conecte sua board no seu PC usando um cabo USB. Caso n&#227;o tenha instalado ainda os drivers, voc&#234; ser&#225; solicitado a faz&#234;-lo neste momento.&lt;/li&gt;
+ &lt;li&gt;se voc&#234; j&#225; estiver usando a conex&#227;o USB na placa no modo de emula&#231;&#227;o UART, feche o programa do terminal (ou, pelo menos, desconecte-o da porta USB).&lt;/li&gt;
+ &lt;li&gt;inicie a aplica&#231;&#227;o &quot;Luminary Micro Flash programmer&quot;.&lt;/li&gt;
+ &lt;li&gt;na guia &quot;Configura&#231;&#227;o&quot;, selecione &quot;LM3S8962 Ethernet and CAN Evaluation board&quot; ou &quot;LM3S6965 Ethernet Evaluation Board&quot; (dependendo da placa).&lt;/li&gt;
+ &lt;li&gt;na guia &quot;Programa&quot;, selecione o arquivo &lt;b&gt;eLua&lt;/b&gt;.bin que voc&#234; gerou na etapa de compila&#231;&#227;o.&lt;/li&gt;
+ &lt;li&gt;selecione as &quot;op&#231;&#245;es&quot; da maneira que achar melhor (geralmente escolho &quot;Erase entire flash&quot; e &quot;Reset MCU after program&quot;).&lt;/li&gt;
+ &lt;li&gt;pressione o bot&#227;o &quot;Program&quot;.&lt;/li&gt;
+ &lt;li&gt;espere at&#233; que a grava&#231;&#227;o tenha terminado, em seguida, saia do aplicativo.&lt;/li&gt;
  &lt;/ul&gt;
-&lt;p&gt;It's worth to mention that since these boards come with an USB to JTAG converter it should be possible to use OpenOCD (or a similar package) instead of the Luminary tool to program the image. The Luminary Micro forums are a good place to look for information if you're exploring the OpenOCD option.
-&lt;/p&gt;
-&lt;h3&gt;Installing eLua on Eagle 100&lt;/h3&gt;
-&lt;p&gt;The Eagle 100 board can also be programmed via JTAG, but it doesn't include an on-board USB to JTAG adapter, so you'd need an external adapter if you
-want to use JTAG for programming. Fortunately, it also comes with an Ethernet bootloader, so you can upload your image via Ethernet. The only requirement
-to use the bootloader is to start your image at address 0x2000 instead of the usual 0x0, since that's where the bootloader jumps. The 
-&lt;a href=&quot;building.html&quot;&gt;eLua build system&lt;/a&gt; does this automatically if the &quot;board=eagle-100&quot; parameter is given at build time.&lt;br&gt;
-For a full description of the Ethernet bootloader consult the &lt;a href=&quot;<A HREF="http://www.micromint.com/index.php/products/by-family/sbcs/54/118">http://www.micromint.com/index.php/products/by-family/sbcs/54/118</A>&quot;&gt;Eagle 100 board manual&lt;/a&gt;, or (more specifically) &lt;a href=&quot;<A HREF="http://www.micromint.com/index.php/products/by-family/sbcs/54/122">http://www.micromint.com/index.php/products/by-family/sbcs/54/122</A>&quot;&gt;this link&lt;/a&gt; (look for section 2.7, &lt;b&gt;Firmware Updates using the Ethernet Bootloader&lt;/b&gt;).&lt;br&gt;
-You still need the LM Flash Tool to use the Ethernet bootloader, but since the board can use JTAG for firmware uploading, it should be possible to use it 
-with OpenOCD (or a similar package) and an external USB to JTAG adapter. The Luminary Micro forums are a good place to look for information if you're exploring the OpenOCD option.
-&lt;/p&gt;
+&lt;p&gt;Vale a pena mencionar que uma vez que essas placas vem com um conversor USB JTAG, deve ser poss&#237;vel usar o OpenOCD (ou um pacote similar) em vez do programa da  Luminary para gravar a imagem de &lt;b&gt;eLua&lt;/b&gt;. Os f&#243;runs da Luminary Micro s&#227;o um bom lugar para procurar informa&#231;&#245;es, se voc&#234; est&#225; explorando a op&#231;&#227;o OpenOCD.&lt;/p&gt;
+&lt;h3&gt;Instalando eLua na Eagle 100&lt;/h3&gt;
+&lt;p&gt;A placa Eagle 100 tamb&#233;m pode ser programada via JTAG, mas n&#227;o inclui um adaptador USB para JTAG onboard, assim voc&#234; precisar&#225; de um adaptador externo, se voc&#234; pretende utilizar JTAG para programa&#231;&#227;o. Felizmente, ele tamb&#233;m vem com um carregador Ethernet, assim voc&#234; pode carregar a sua imagem atrav&#233;s da Ethernet. O &#250;nico requisito para utilizar o bootloader &#233; para iniciar a sua imagem no endere&#231;o 0x2000 em vez do 0x0 de costume, j&#225; que &#233; onde ficam os jumpers do bootloader. O &lt;a href=&quot;building.html&quot;&gt;sistema de gera&#231;&#227;o do eLua&lt;/a&gt; faz isso automaticamente se a placa &quot;= eagle-100&quot; par&#226;metro &#233; dado em tempo de compila&#231;&#227;o. Para uma descri&#231;&#227;o completa do bootloader Ethernet consulte o &lt;a href=&quot;<A HREF="http://www.micromint.com/index.php/products/by-family/sbcs/54/118">http://www.micromint.com/index.php/products/by-family/sbcs/54/118</A>&quot;&gt;manual da placa Eagle 100&lt;/a&gt;, ou (mais especificamente) &lt;a href=&quot;<A HREF="http://www.micromint.com/index.php/products/by-family/sbcs/54/122">http://www.micromint.com/index.php/products/by-family/sbcs/54/122</A>&quot;&gt;neste link&lt;/a&gt; (procure pela se&#231;&#227;o 2.7, &lt;b&gt;atualiza&#231;&#245;es do f!
 irmware usando o gerenciador de inicializa&#231;&#227;o Ethernet&lt;/b&gt;).&lt;br&gt;
+Voc&#234; ainda precisa do programa Flash LM para usar o bootloader Ethernet, mas desde que a placa pode utilizar JTAG para fazer upload do firmware, deve ser poss&#237;vel us&#225;-lo com OpenOCD (ou com um pacote similar) e um adaptador USB externo JTAG. Os f&#243;runs da Luminary Micro s&#227;o um bom lugar para procurar informa&#231;&#245;es, se voc&#234; est&#225; explorando a op&#231;&#227;o OpenOCD.&lt;/p&gt;
 $$FOOTER$$
 


</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000408.html">[Elua-svn] r452 - tags/pre0.6/doc/pt
</A></li>
	<LI>Next message: <A HREF="000410.html">[Elua-svn] r454 - trunk
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#409">[ date ]</a>
              <a href="thread.html#409">[ thread ]</a>
              <a href="subject.html#409">[ subject ]</a>
              <a href="author.html#409">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/elua-svn">More information about the eLua-svn
mailing list</a><br>
</body></html>
